{
    "ImdbId": "tt0499549",
    "total_reviews": 48,
    "reviews": [
        {
            "reviewer_name": "Misagh",
            "reviewer_url": "/user/ur13407466/?ref_=tturv_usr_1_t",
            "review_date": "Dec 13, 2009",
            "rating_value": "8",
            "short_review": "After a decade, Cameron sets the avatar of our new generation",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Samiam3",
            "reviewer_url": "/user/ur19511193/?ref_=tturv_usr_2_t",
            "review_date": "Dec 12, 2009",
            "rating_value": "9",
            "short_review": "Cameron Returns",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ClaytonDavis",
            "reviewer_url": "/user/ur2898980/?ref_=tturv_usr_3_t",
            "review_date": "Dec 14, 2009",
            "rating_value": "8",
            "short_review": "One of the best cinematic experiences ever...",
            "full_review": "Forgive me, I'm going to jump from professional to fan boy for a while here. I haven't had the jitters after a film the way I've had for Avatar in quite sometime. James Cameron's Avatar is the most entertaining and enthralling cinematic experiences of my life. It is incredible, simply put. What Cameron has done here is the most passionate film project put out since Steven Spielberg released Schindler's List. His attention to detail and his zeal for pushing the envelope is so admirable to any filmmaker or actor who will ever do another film from this point on.Avatar is the story of Jake Sully, a paraplegic marine, who replaces his brother on a secret mission to infiltrate the Na' vi, the colony of beings that sit on the planet of Pandora, where there is a precious ore, that sells at a ridiculous amount. When Jake learns the ways of the Na' vi, his feelings and learnings will put him and the people he trusts in dangerous jeopardy.The performances here, in the sense of reacting, becoming, and understanding what Cameron has written are astounding. Not to be confused with a sensational bravura performance from some of the centuries best such as Marion Brando, Tom Hanks, or Diane Keaton; these actors along with the director inhabit these visual transformations with special effects as if they are have lived these beings all their lives. This is all based on character movements and reactions. Sam Worthington, as Jake Sully, is an actor who's on his way to becoming a star. Though he has problems with his Aussie accent often enough in the film, he gets the job done. Zoe Saldana, who plays Neytiri, a Na' vi huntress, is thrilling and electrifying. Stephen Lang, as the rock hard Colonel Miles, takes on a villainous turn to a new level in science fiction. He offers actual emotion and emotes evil to the audience and gains our hatred easily. Sigourney Weaver as the beautiful Dr. Grace, is sufficient enough to have on screen again teamed with Cameron. She lives inside her role with effortless ease, but suffers from some of the typical James Cameron cheesy lines.Narratively the film works perfectly on the cinematic level. The first forty minutes or so require patience and hope as it is the weakest part of the film and offers some dreariness, but when the second act takes off, it's sky high with no limits for James Cameron. Avatar delivers the best action sequences put on film of all time. That is the boldest statement I have ever made in all my years of criticism. I sat on this for two days before charging it out, but I mean it. It is the best visual experience of my life, period.Other than those visuals, the film pops with all the other technical aspects thrown into one. Art Direction is killer as the two worlds blend in perfectly for an acceptable time. The Film Editing is the crowning achievement of the film as it also offers the perfect blend of the two worlds, enticing the viewer and shifting us around. Mauro Fiore is the threat for a Cinematography Oscar this year. It was if the viewer sat down in a chair, put on glasses, and was literally placed on Pandora, spaceships, and floating mountains. The viewer can feel so engulfed by the imagery, you feel like you can smell the leaves from the trees. Avatar is utterly hypnotizing. James Horner's score is some of the best work done in his career. It offers a variable of devastation that moves the viewer to near tears. It goes back to his work on Titanic, where the musical instruments lifted the material immensely. The entire sound team is also locked and loaded for Oscar recognition as the feeling of animals, machines, and arrows buzzing by your head leave you imprisoned in Cameron's exquisite film.James Cameron has come back home ladies and gentlemen Cameron is back, bigger, badder, and mature in his crowning work of his career. Terminator 2: Judgment Day and Titanic do not even compare anymore. This is the film that can blend the fans of those two films together and lock Cameron into your heart. He's a definite spoiler for a directing bid for the Academy Awards. You have admire the raw, natural talent the man has. How could you ever conceive such an experience and put that much effort and work into it and have it pay off? The box office success will surely keep him in the minds of voters for various critics' awards. His screenplay, leaps and bounds better than 1997's Best Picture Winner, is primed, developed and ripe for the taking. Though, you do acquire the tacky and atypical dialogue you expect from a science fiction director of this caliber, you can appreciate the effort and the honesty of it all. James Cameron is everything Michael Bay wishes he was, to put it bluntly.Avatar will bring also great actors putting their best foot forward such as Giovanni Ribisi, who is as underrated as they come. Michelle Rodriguez who exudes sexy like any woman starring in a sci-fi epic. Joel Moore, showing his range outside of his comedic work in Dodgeball: An Underdog Story. And the classy veteran actors, CCH Pounder and Wes Studi, who just simply don't work enough.Avatar is one of the best films of the year. The most exciting, thrilling, and superb work you'll feast your eyes on in any theater this century. Cinema, forever, will remember the benchmark that James Cameron placed not only for himself, but for any man, daring to change the game, the way Cameron did. Avatar is a movie experience to be remembered, and please experience in a movie theater first.***½/****",
            "data-review-id": ""
        },
        {
            "reviewer_name": "eldreddsouza",
            "reviewer_url": "/user/ur78310344/?ref_=tturv_usr_5_t",
            "review_date": "Sep 23, 2022",
            "rating_value": "10",
            "short_review": "It's an experience! A magical one.",
            "full_review": "I was waiting for this day for the longest time. I was a kid back in 2009 when this movie released. So never got to watch it back then. But now when it rereleased I booked the first day show to a IMAX show and oh boy was I blown away! This is nothing short of a masterpiece! It's beyond belief how a film like this could've been made. Every scene, every shot is perfection. You are transferred to a different world and become so engrossed in the film. Never have I attended a movie where at the end of it people got up from their seats and started clapping! Last time this happened was after Infinity War. That movie too was a damn brilliant one. I'm from India and this is legit rare, where people go crazy, so crazy after any English film. This was one experience that I will never forget. I'm definitely going for it again next weekend cuz just once was not enough.Every human on the planet needs to experience this magnificent work of art!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "cyberjedi-608-518993",
            "reviewer_url": "/user/ur22532965/?ref_=tturv_usr_6_t",
            "review_date": "Dec 14, 2009",
            "rating_value": "10",
            "short_review": "Best movie experience of the last 30 years...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "lionel-14",
            "reviewer_url": "/user/ur2064686/?ref_=tturv_usr_7_t",
            "review_date": "Dec 12, 2009",
            "rating_value": "10",
            "short_review": "Fascinating concept .Must be seen cannot be described",
            "full_review": "I saw this epic last night at the Empire Leicester Sq in London, which is a superb venue in which to view this film. Huge screen, excellent sound and an extraordinary Dolby, 3 dimensional image. The whole effect is mind blowing.This is a 'Must see' movie, innovative, and extraordinary. I think it will be regarded by most cinema goers as another milestone in the history of the art. The level of realism achieved is remarkable, and although the film is relatively long in real time, it retains it's excitement and holds the audience's attention to the end.Performances are good, but this is not the sort of film that dwells on big star value for the actors, although Sigorney Weaver does shine and delivers a very convincing performance, as do the rest of the cast. But as there is so much entertainment and action value on screen the human element does not dominate in the usual way.As Writer/Director, James Cameron deserves high praise for this creation and in my opinion it will break box office records. I thoroughly enjoyed this film.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "fnet_florent",
            "reviewer_url": "/user/ur10656343/?ref_=tturv_usr_8_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "6",
            "short_review": "Visually stunning, but ultimately unimaginative",
            "data-review-id": ""
        },
        {
            "reviewer_name": "yoel-47650",
            "reviewer_url": "/user/ur68961762/?ref_=tturv_usr_9_t",
            "review_date": "Nov 18, 2022",
            "rating_value": "9",
            "short_review": "A fantastic journey.",
            "full_review": "You know the feeling when you start watching a movie, realizing it's almost 3 hours, and saying to yourself - \"Well this is probably gonna be mostly boring\", well, the creators of this movie didn't let that happen, rest assures.From the beginning up until the ending, every scene is perfected, with amazing acting, stunning directing, great visual effects, and astounding sound effects.The story building is just great , characters are well-developed , and the concept is brilliant.The only thing that's missing to me, is a fitting-soundtrack which could've give some scenes a great boost.I avoided watching this movie for a long time, because it just seemed a little ridiculous to me (Come on there are blue people) but I'm so glad I finally decides to give it a chance, and boy did it serve.Loved it. 9.5/10.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "benjamin-heckendorn",
            "reviewer_url": "/user/ur22561863/?ref_=tturv_usr_10_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "6",
            "short_review": "How could anyone who's seen more than 4 movies in their life find this creative?",
            "data-review-id": ""
        },
        {
            "reviewer_name": "suhanime",
            "reviewer_url": "/user/ur150616236/?ref_=tturv_usr_11_t",
            "review_date": "Mar 9, 2022",
            "rating_value": "8",
            "short_review": "A great science fiction adventure from a master filmmaker!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "TheLittleSongbird",
            "reviewer_url": "/user/ur20552756/?ref_=tturv_usr_12_t",
            "review_date": "Aug 6, 2010",
            "rating_value": "6",
            "short_review": "Visually mind-blowing, but lacking in the story",
            "full_review": "I did see Avatar for the first time a while ago, and didn't know what to make of it. To me it felt like a visual feast if little else. Re-watching it again, I found more strengths, but there are several weaknesses that prevent it from being a masterpiece.Starting with Avatar's strengths, it is absolutely mind-blowing visually. The cinematography, landscapes, scenery, colours, make-up and effects are outstanding and are by far and away Avatar's strongest asset. I also liked the score, it is certainly not the best score I have ever heard, but it had some very nice moments, while Cameron's direction is competent, the message admirable, and the finale well and truly explosive. I also loved the flying sequences, they were breathtaking.The acting in general is a mixed bag. Sam Worthington is a charismatic enough lead, while Zoe Saldana is strong and spirited. Stephen Lang is an enjoyable and over-the-top villain of the piece too, however Sigourney Weaver is somewhat so-so, doesn't help really her character isn't that interesting while Michelle Rodriguez and Joel Moore aren't given very much to do.What didn't work so well is that Avatar's story, with themes of love in a time of chaos and man alone in a hostile environment, is rather simplistic and predictable. I also felt it took a while to get going, and that the relationship between Jake and Neytiri was on the dull side. And is it me, or does this film drag at times, particularly towards the end? Now don't get me wrong, I liked the concept, it wasn't exactly original, as I often heard it described as \"Dances with Wolves in Space with rip-offs of Pocahontas and FernGully\"- but I am not going to join those who say that- I have to admit regardless of its originality or lack of it the concept intrigued me. Then there is the dialogue, which is nothing special and never quite rings true. There are some amusing moments but a vast majority of the dialogue in the middle of the film never quite convinced or came across as cheesy. The characters also came across as rather clichéd, especially Giovanni Ribisi's, and the character development was lacking.So all in all, Avatar does have a lot of strengths, but a lot of weaknesses too. I will say I preferred it over The Hurt Locker, which to be honest left me cold, but I think I would be stretching it a bit if I said it was 5-star masterpiece. 6/10 Bethany Cox",
            "data-review-id": ""
        },
        {
            "reviewer_name": "elchocobollo",
            "reviewer_url": "/user/ur22516874/?ref_=tturv_usr_13_t",
            "review_date": "Dec 11, 2009",
            "full_review": "Well, I just saw Avatar this morning, one of the press premieres which are running on these days. My opinion: you've seen this story a hundred times, but never like this. Finally 3D is what it's supposed to be, an instrument at the service of the movie. You'll enjoy the visual experience, no doubt.As for the story, some of the \"inspirations\" are so huge and so obvious that mentioning two or three of them would REALLY ruin the movie for you, and I'm not willing to do that. Lots of mysticism and ecology, if you like that stuff. If you're 15 or so, you'll have a great time thinking that it's the first time somebody makes something like this. If you're an experienced movie watcher, better leave your skepticism at the door, bring lots of pop corn and enjoy with the usual action-flick-with-moral-and-loads-of-clichés.I liked it, however: \"the movie that re-invents movies\"??? No way.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "NonSequiturL",
            "reviewer_url": "/user/ur16237357/?ref_=tturv_usr_14_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "9",
            "short_review": "Incredible scope and spectacle",
            "full_review": "A film with the scope of James Cameron's Avatar was always going to be a risk both artistically and financially, especially in today's economic climate. Whether it will pay off monetarily is a question only time can answer, but this viewer can at the very least attest to it being an artistic triumph.Avatar brings us as close as cinema ever has to actually visiting an alien world. The beautiful environs, the exotic creatures and incredibly lifelike natives of Pandora arrest the senses, visually, aurally and emotionally. The world in Avatar is the true star of the show. The amount of detail and work that has gone into bringing this new world alive is seriously impressive, and it will be a while before we see anything that overtakes it in scope and quality. WETA Workshop and ILM have truly outdone themselves.Relative newcomer, Aussie Sam Worthington provides a solid human heart amongst all the science-fiction/fantasy beauty and Zoe Saldana gives an impressive performance as the 8 foot tall Na'vi, Neytiri. Even though the characters they both play are blue, giant, catlike aliens, they managed to evoke a chemistry and likability that pierces through the special effects.That's not to say that everything is perfect. The story is basic and dare I say, clichéd and predictable. We have seen it plenty of times in all forms of media. The bad guys are cartoonishly evil, and sadly paper thin. The love story, while charming, is also clichéd despite being between man and alien. But in the face of these shortcomings, Avatar is a success because its storytelling lies in the brilliant visuals.Avatar is a beautiful piece of film and a true event. It does exactly what cinema was always intended to - it takes us away from our problems and worries for a few hours and gives us memorable images which will undoubtedly and deservedly enter into the cultural lexicon to stay for the foreseeable future.9.5/10",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ftyl",
            "reviewer_url": "/user/ur5378817/?ref_=tturv_usr_15_t",
            "review_date": "Dec 15, 2009",
            "rating_value": "9",
            "short_review": "The best blockbuster in years - the master is back!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "shaikhirshad-41223",
            "reviewer_url": "/user/ur99503134/?ref_=tturv_usr_16_t",
            "review_date": "Sep 23, 2022",
            "rating_value": "10",
            "short_review": "A NEW WORLD.....",
            "full_review": "Hatts of to JAMES CAMERON for thinking and creating a vision like this. It takes a lotseof hardwork & research to build a whole new world. And there is a reason why this movie is still the no 1 movie in the world. I've never seen this kind of visuals in any other film. And this movie was made in 2009 that was an amazing achievement by the VFX creators & the director itself. You can easily get connected with the movie plot and the way the director has shown the Pandora world was just unbelievable. Cast of this film has done a fabulous job while performing so well and get into the character that not a single one will disappoint. Emotional scenes are so powerful that you feel the characters and their pain for what their suffering. Visual Effects makes this movie so powerful that every creature and big scenery scenes looks real. That's why it has re-released once again to feel the same experience. Don't miss this one on the big screen if you haven't seen it. It's a total new world experience. Can't wait for the PART 2....",
            "data-review-id": ""
        },
        {
            "reviewer_name": "MorganGrodecki",
            "reviewer_url": "/user/ur8152215/?ref_=tturv_usr_17_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "Avatar - Breathtakingly Beautiful",
            "full_review": "When movies are created, they are done so with intent. Different genres of film target specific audiences, a formula which has sustained Hollywood and it's industries since the beginning of the blockbuster movies. When a movie is created in a manner that sets in motion any given goal, said films success is pendant on whether or not that goal is reached. If a comedy creates laughter, or if a romance produces tears, then they are successes in their own right. So when a massively ambitious, seemingly impossible to create film aiming to usher in a new era manages to grab hold of it's audience and take them on an unprecedented cinematic roller coaster ride that delivers the goods every turn of the way, it can be considered successful. Avatar is that success.A work in progress that spanned a decade and a half, Avatar is more than just a film - it's an experience, an event. When James Cameron set out to make this movie back in the mid 90's, he realized that his ambitions were simply too far ahead of their time. His ideas could not be reached in a feasible manner, and due to this, he had to wait. Or create. Once informed that the image he held for this film was one that was out of grasp, he began working on the technology that would bring his masterpiece within reach. Fifteen years and nearly half a billion dollars later, James Cameron has brought that vision to the screen, and has done so in an extravagant and showstopping way.Avatar tells the tale of a war between species, each fighting for the ultimate survival of their race. Desperate to find the fuel for their dying planet, human soldiers and scientists set out from earth and set course for Pandora. A planet connected by all living things, Pandora is home to an indigenous species known as the Na'vi, as well as the precious element Unobtanium needed to save earth. Using transference technology, paralyzed marine Jake Sully is volunteered for the \"Avatar Program\", which enables the thoughts and mind of a human to be placed within the shell of a tube-born Na'vi body. Using this as technique to their advantage, Jake is sent into the harsh Jungles of Pandora in order to bond with the natives, thus gaining knowledge and insight on their ways. Having originally planned to use this knowledge as a means of negotiating the natives relocation, so that the humans can access the deposit of Unobtainium - which just happens to sit below their most worshiped and valued pseudo-deity of their planet.While the plot on paper may read as a standard shoot'em-up action sci-fi flick, it is a near inconceivable task to truly explain how incorrect this appearance truly is. This takes a stroke from every movie, and a dab from every genre, and manages to create a portrait of beauty, in which all pre-existing notion of what cinema can and cannot do is destroyed. Within the lengthy hundred and sixty some odd minutes of film, moviegoers will find that there is always something to keep them enthralled, a merciful gift when considering how tedious many of the longer film of recent memory can become.No matter what can be said about the overtly cheesy script,a criticism that, while holding true, manages to fit charmingly into the over-the-top nature of the film, Avatar does as it set out to do, bringing moviegoers a cinematic experience rather than a film. Relying on the technology that he created, Cameron pours his heart into this movie, and it shows in every scene. Ranging from the absurdly detailed creatures to all-too-realistic planet, this flick manages to tell a fulfilling story while all the while throwing jaw-dropping scenery at the audience, giving them only enough time to recover before bombarding them with yet another breathtaking shot.Be it the fantastical and charming love story told between the native and the outsider, or the too-real-to-be-true action scenes between gunships and foreign ferals, Avatar is what Star Wars was too the 70's, the Wizard Of Oz of the 40's - a masterpiece that will go down in movie history as a game changer of it's time.4 Stars out of 4 Stars",
            "data-review-id": ""
        },
        {
            "reviewer_name": "NoArrow",
            "reviewer_url": "/user/ur1903880/?ref_=tturv_usr_18_t",
            "review_date": "Jan 1, 2010",
            "rating_value": "6",
            "short_review": "Looks great, I just wish I cared what happened in it",
            "full_review": "\"Avatar\" is not the next \"Star Wars\" or \"Lord of the Rings.\" It might be the next \"Matrix,\" though. Or, perhaps more accurate, the next \"Matrix Revolutions.\" It's technically groundbreaking craftmanship put to work on a story that was played out after \"Return of the King.\" There are a lot of bad guys, a lot of good guys, and sooner or later they're all gonna meet on the battlefield. The little details are not-so-shockingly unimportant, since nothing could stop, change or even, really, comment on the unstoppable trajectory of this film's story.It's the future. An Evil Corporation is parked on distant planet Pandora, mining the planet of all its precious minerals. The native population, big blue humanoids called the \"Na'vi,\" aren't too happy about this. The corporation has hired scientists to create avatars of Na'vi bodies to be controlled by human brains, in order to communicate to the Na'vi that...they better move, lest be bulldozed by the evil Col. Qautrich (Stephen Lang).Jake Sully (Sam Worthington) is flown in to Pandora because his twin brother, who had an Avatar made specifically for him, is dead. The coincidence is an obvious plot device so that we can have a newcomer to Pandora to share in our amazement. Oh, and he's paralyzed, so running around in his new alien body is rather freeing for him.I don't feel as if I need to continue with the plot description. You know what'll happen. You've seen \"Dances with Wolves\" and \"The Last Samurai.\" Heck, even \"Dead Man.\" The Na'vi represent nature, the (all-American) corporation represents destructive technology. Quatrich has a Southern accent and says things like, \"we have to fight terror with terror.\" The Na'vi are clones of Native Americans - filtered through the imagination of a white liberal. It's all very obvious.The question, of course, is whether or not it's entertaining. Well...sometimes. It certainly looks good. Some sequences - especially those with the winged beasts - are eye-popping. Lang makes a fun villain. Pandora is more derivative than original, it reminded me most of Skull Island in Peter Jackson's King Kong. All the monsters have a plastic-y look to them that make them feel too well-done. The 3D is distracting at times and I had a headache before the movie was over.But there are scenes and individual shots that pop with ethereal beauty. It's worth seeing for that reason, but I don't think it'll be as fun after multiple viewings. The great thing about \"Star Wars\" was the characters: Han Solo, Luke Skywalker, Princess Leia, R2-D2, Darth Vader, Obi-Wan Kenobi, Yoda and so on. They embodied the other-worldliness of the story, taking the weight off the effects.In thirty-two years, I don't think anyone will remember \"Jake Sully.\" 6/10",
            "data-review-id": ""
        },
        {
            "reviewer_name": "hutchinson_3",
            "reviewer_url": "/user/ur3278830/?ref_=tturv_usr_19_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "6",
            "short_review": "Visually amazing, but otherwise average at best",
            "full_review": "Yeah this movie took several steps forward in terms of cinematography and filming technology, but that is all that can really be said to be what makes this film worth seeing. Everything else that makes a film great is totally lack luster.There is no deep character development. Why does Jake Sully really want to become a part of the Navi? What was life on Earth like? What really makes him want to break away from his roots there? Is it just the ability to walk? I mean are there no more Native Americans or Buddhists left on Earth (which is clearly who the Navi were based off of) to give him that spiritual satisfaction? How does he feel about filling his brother's shoes? Twin relationship? The conflict between scientists and the military is not developed. Every supporting character was a stock character. Michelle Rodriguez somehow manages to have a place in Hollywood after literally playing the same type of character in every film she is in (Fast and the Furious, SWAT, Blue Crush...yeah just put her in a futuristic helicopter and thats her in this one). Was Sigourney Weaver supposed to be a mother figure? How did the bad guy from the Last of the Mohicans feel about faking a Native American language? The plot was totally predictable, and the dialogue was crap. It was like James Cameron turned in his dialogue assignment a day late.This movie deserves no award nominations at all outside of those in technical categories.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "miruleyall",
            "reviewer_url": "/user/ur18853862/?ref_=tturv_usr_20_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "8",
            "short_review": "Visually Spellbinding!",
            "full_review": "I am sure my comment will be lost in a sea of blue but anyways here goes...Just attended the Advanced Screening at my local \"Event Cinema\" BCC in 3DNow this movies graphics are gorgeous, everything is so real, the 3D just adds to the effect beautifully without distracting you.From a technical standpoint this movie is amazing, just the detail on the Navi's faces are amazing, they feel more real then their real life counterparts!Without giving anything away about the story, the plot itself is very solid, very character driven and perfectly executed by Jim, safe to say this is his best original story since \"The Terminator\" and \"Terminator 2\" and is definitely one of his best movies, so good it ties with T2 which is my most favorite movie of all time...So for those of you who have not seen this yet... WHAT ARE YOU WAITING FOR?!5/5",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Bart_Mancuso",
            "reviewer_url": "/user/ur9034138/?ref_=tturv_usr_21_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "1",
            "short_review": "This movie made me feel blue",
            "data-review-id": ""
        },
        {
            "reviewer_name": "bob the moo",
            "reviewer_url": "/user/ur1002035/?ref_=tturv_usr_22_t",
            "review_date": "Mar 1, 2010",
            "full_review": "Although I was not too bothered about seeing Avatar as a film, I felt it was a bit foolish to let this milestone of cinema go past me – particularly when the thing it is hyped for are the effects and being the first \"big\" film to utilise 3D technology to this degree. It just seemed that watching it on my TV in about 9 months on DVD with a basic stereo system would be missing the point. Unsurprisingly I was right because Avatar is technically a brilliant film that deserves to sweep the Oscars in terms of awards for visual effects and other such categories.If we ignore the 3D for a minute, the actual effects look great and I imagine that it will still be impressive in 2D. The landscapes and world of Pandora are imaginative (ironic since how dumb the name of it is) and very vividly created to the point where you forget that they are effects when you step back from them. Likewise it is so easy to forget that the Na'vi are not actors in quite brilliant outfits and makeup because they look so real and move so naturally – it is a million miles from the films such as Spiderman or Indy 4 where you can see where the real person ends and the jumping/swinging special effect begin. There were points in the film where I found myself wondering how on earth they managed to get a particular shot and where the camera was, only for my brain to kick in a second later to remind me that what I'm seeing is entirely virtual. OK the fantastical visual aspects are clearly creations but I was startled by how accepting of it all was and, in 2D I thought that the effects were pretty seamless.In 3D it doesn't quite hit the same mark for me. The \"look it's in 3D\" shots are not as obvious as some of the other films (where stuff comes out of the screen for no reason) but it is still a little distracting when the 3D forces your focus or has stuff where it doesn't aid the scene. Of course the world of Pandora looks great with things moving around in front of you and the final battle sequences are great – the money is all there to be seen. Thing is, the reason I was able to think about \"how did they do that shot\" while watching the film is because the technical aspects of the film is really all there is to engage with. The plot is basic and obvious – others have talked at length about the rights and wrongs of a story where the white man comes to the aid of the indigenous people, so I'll not add to that debate. The problem for me is simpler than that, it is simply that the plot is weak and the script is just as weak. My girlfriend laughed out loud when the name of the mineral on Pandora was named as \"Unobtainium\" and there were plenty of things like this. The dialogue between the characters is full of needless plot exposition and thus doesn't ring true. Of course all this is helped by the action and the effects but the narrative and writing weaknesses are all I can think of when I have to listen to people tell me how Avatar is the best film ever.The cast manage to do solid jobs considering how easy it is for them to get lost in the effects (see the modern Star Wars films to see this happen). Worthington is stuck with some awful dialogue but he is a good presence even in his Avatar. Saldana's performance is good, again despite some of her expressions and dialogue. Weaver is \"so-so\", Moore is pointless, Ribisi is miscast in a character that is so clichéd that it needed a decent casting to make it be more than it was. I liked Lang a lot and his OTT badass character worked well. Rodriguez seems like she is there because someone important likes her and her character doesn't add a terrible lot. Voice work from Studi, Pounder and others is good.Overall Avatar deserves to be seen for its technical importance and how impressive it is but the degree of praise for it needs to be put in context by considering how it plays as more than just a special effects milestone. In these terms it is not as good due to a poor plot and script that hurts the actors more than the effects do by handing them some awful dialogue. That it works is testament to how impressive the effects are but there is not a terrible lot to gush about beyond these.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Radio-1s_Mr-MovieMad-Ami_104-1FM",
            "reviewer_url": "/user/ur77586437/?ref_=tturv_usr_23_t",
            "review_date": "Sep 22, 2019",
            "rating_value": "10",
            "short_review": "\" FI ( LM ) NOMENAL \" 💎 💎❗❗❗",
            "full_review": "A { - M I C R O - } REVIEW .I just { R E }-watched this film on DVD ...{ YES, believe it or not, some of us STILL like to do that ⭐❗}.. at home with my family the other night. I'm pretty darn sure that I'd watched it ATLEAST twice ( if not an outright THREE times ) ...just AS SOON AS it was released a whole D E C A D E ⭐ ago....... WAY, WAY, WAY back in December 2009 .I am ENTIRELY-aware that I'll be { TRULY :P } lucky if EVEN FIVE PEOPLE read this review, given the aforementioned, above fact. { THE REASON ⭐ } ..I'M writing this review is to get, ( say ), THREE of the \"5 of you\" who M A Y JUST ~ ( & this is ENTIRELY possible ) ~ N O T have seen it... Y E T . . to watch it . { YES , S T I L L❗} .... it is truly a \" TIMELESS \" . . . . M A S T E R P I E C E 🌠 .If you come to the film with an OPEN HEART & AN OPEN MIND, then I can unequivocally promise.... this \"truly LAVISH\" visual & metaphysical extravaganza will well & truly set your SOUL ON FIRE 🔥 🔥 { in the Good Sense, of course }. If you thought that the CGI & SPFX of \" T I T A N I C ❤ \" were just.. { - W - A - Y - } Ahead of their time, for circa 1997 ; then Trust Me . . . . . THIS TOPS EVEN { - T - H - A - T ⭐ - } VERITABLE CINEMATIC \"COLOSSUS\", believe -it-or-DON'T .A LAVISH, \"CELESTIAL\", NO-REGRETS 25 MARKS OUT OF 10 💥❗❗.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "goldeneyeonline",
            "reviewer_url": "/user/ur22572201/?ref_=tturv_usr_24_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "9",
            "short_review": "Masterpiece for eye and soul...",
            "full_review": "This movie actually blew my mind! I have to admit that it's quite easy to impress me, but when i left the cinema I was just amazed by the feelings this film left. First of all to say is that the visual effects and the whole setting of this movie is absolutely unique yet and will be for a few years still, I think. The Sorrounding on \"Pandora\" doesn't let you breathe for several minutes in which you just cannot close your mouth. But this is NOT what makes this movie unique and so awesome! The story is really a great part of it, and gives the film its spirit. OK, it IS predictable, but many tiny parts that are unexpected just give it the suspense it needs. This is no \"switch off your brain\"-movie!!!In my opinion this film is worth 9-10 stars, I'm giving 10 for the goose-flesh it still gives me every time I see the trailer or hear the soundtrack. This evening I'm gonna watch it again :-)PS: Sorry for my bad English, I'm from Germany...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "canuck15",
            "reviewer_url": "/user/ur22600186/?ref_=tturv_usr_25_t",
            "review_date": "Dec 27, 2009",
            "rating_value": "10",
            "short_review": "Escapism at it's best",
            "full_review": "Just go! The people who made this movie, most of which are just average working people making a normal salary deserve it for what they have created. This movie accomplishes what most people go to movies for. To escape from reality for a little while.Not only is this what I consider a milestone in the evolution of state of the art movie making, it's a good story with a simple message.A bit annoyed at some of the criticisms. I don't see anything political in the metaphorical message this movie presents. If Republicans hate the idea that getting close to nature is good and war is bad then too bad so sad for them! There is only 1 directly political reference to Bush. That is when the military offensive is referred to as a \"shock and awe\" campaign. If people are going to get their panties in a bunch over that then again, sucks to be them! Also don't understand the criticisms about the similarity to Dances with Wolves. Dances with Wolves was not a unique idea. Modern society has been screwing over aboriginals for centuries. What is so bad in pointing that out once in awhile in a way that most people can relate to? By seeing it through the eyes of someone from this modern world.I loved every minute of this movie. There were a couple tiny teeny little things in the dialog I would have done differently but no matter how you slice it, this is a masterpiece!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "vjlbym",
            "reviewer_url": "/user/ur22575297/?ref_=tturv_usr_26_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "10",
            "short_review": "I watched it twice within 24 hours!",
            "full_review": "Never before have I felt the need to express my views about a movie online except when I saw Lord of the Rings for the first time.Let's get it straight- the ONLY thing ordinary about Avatar is its screenplay. It's not bad, just ordinary. Story is clichéd, but very relevant. Everything else about the movie is just out of the world, literally! This is not a movie like Pulp Fiction or Fight Club. It doesn't require intelligence to understand the plot. But seriously, who cares? The visuals are so stunning and wonderful that you are sucked into Pandora. You feel like you are living on Pandora and watching the actors over their shoulders. This is where 3D filming has been put to great use in this movie. I can only speak for myself but I related to the characters so well that I was almost emotionally attached to them an hour into the movie.The two main messages of the story are environmentalism and peace. Both of them are extremely relevant today. But then again, the purpose of this movie is not just to carry those messages across. It's to show a completely different world in stunning detail and to let the viewers relate that world to our own. To me, it talks also about fighting injustice, even if it is perpetuated by \"your own\" people. The biological theory of connections between all the living things on the planet was pretty cool and is truly, the worldwide web.The acting doesn't stand out as mind-blowing but blame it not on the actors, but the visuals. James Horner, as always, delivers with the music. It is so inextricably linked to the scenes that you probably won't be able to imagine enjoying the movie without it. Special effects, needless to say, are outstanding! CGI on this scale for hundreds of characters is no mean task. Dialogs, as I mentioned before, are not extra-ordinary but then again, you don't expect a marine to be Shakespeare in his linguistic articulation. They definitely fit in with the plot.This definitely is another milestone in movie-making and will definitely spawn a lot more special-effects filled movies. All in all, the movie rises above others of its class for the way in which this rather simple-minded story is told. I still can't stop playing through the scenes in my mind. Go watch it and let go of your worries and live in Pandora for 166 minutes and trust me, it's a wonderful life!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "suckerdwsp316",
            "reviewer_url": "/user/ur2372821/?ref_=tturv_usr_27_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "6",
            "short_review": "There is So Much to Say About James Cameron's AVATAR",
            "full_review": "I'm not sure where to begin with James Cameron's Avatar. I could start by saying I've been waiting 12 years for this film. I could start by saying Terminator 2 is my all time favorite movie, and I've watched it a thousand times since I was a kid. But I'm going to start with the most positive thing I could say. James Cameron is a special filmmaker. He revolutionized film-making in the 1980s with The Terminator and Aliens. He did it again in the 1990s with Terminator 2 and Titanic. So after 12 years of anticipation and hype, and all the reports of the record budget being somewhere between a mind-boggling $300 and $500 million, I expected Avatar to be the greatest thing since sliced bread.And sadly, it wasn't. Not even close. I will admit that the visuals in the film were stunning, and sometimes made you feel like you were dreaming. Cameron has definitely spent his time wisely creating a new universe all his own, and inventing a totally new world, one that leaves us in awe. However, for a filmmaker like Cameron, the whole IMAX 3D element of the film really wore on me. After a while, I couldn't wait to take off those uncomfortable glasses which helps us \"see\" the stunning visuals, as Cameron wants us to, which are quite nauseating, particularly for a movie that is almost three hours in length. I've never seen a film in 3D or IMAX before, so I wasn't sure what to expect. But now that I've seen it, it begs the question, why? Hey Jimmy, you're James frickin' Cameron! You don't need 3D to make good movies, man! I feel like 3D is like cheating on a test that you've studied for your entire life. Why is Cameron trying to overcompensate for no reason? He can make superb films without any of this IMAX 3D CGI stuff.As for the plot, well there is none. Avatar essentially features no plot, or story, other than the typical love angle, which can only be classified as being beyond cheesy. If there is a \"story\", you've seen and heard it many times before. A man sent in to infiltrate a band of aliens grows close to their ways and in the end turns against his own kind when the two sides battle each other out. You've seen it in Dances With Wolves, you've seen it in The Last Samurai, hell, I could even go all the way back to 1956 and cite John Ford's The Searchers as a movie which features characters who are pulled into another society or world only to become one of them. Now, before you go and crucify me and say \"well every movie can be traced back to something else\", which is true, you need to understand that James Cameron is a trend-setter. HE is the one that makes the most refreshing movies, HE is the one that everyone else copies. HE doesn't need to copy anyone else. HE used to create films with creative plots and likable characters, but there's nobody to like in Avatar. After all, it's not easy to relate to a CGI-made 10 foot tall blue alien.I really expected more out of this film. The graphics were amazing, sometimes. Other times, it was just migraine-inducing. I wanted something to happen. And nothing really happened. Cameron could have made one of the all time great films if he had just put some more thought into it, and created a good story, with fleshed out characters, and a climax that doesn't come off as being a thoughtless, cookie-cutter finale. Armed with a budget of this enormity, and over a decade between narrative films, you'd think \"the king of the world\" would have come up with a better movie.But I do think people will love most of the visuals, I certainly did. But after nearly three hours, it suddenly dawns on you, \"is there anything else to this movie?\" Because while staring at the Mona Lisa is a very thought provoking thing to do, eventually, you move on! And that's what this film felt like. A beautiful painting come to life, but one that eventually gets tired and predictable. Sadly, and despite what most of people will say, because they loved the visuals and have never seen anything like it, James Cameron's Avatar was extremely disappointing and I'm not sure if I'll ever forget this kind of disappointment for a long, long time.I still love Terminator 2, and I still love James Cameron. But I feel like I've been waiting through a 12 year war for my loved one to return, only to see them come back a completely different person, one whom I simply don't know and can't trust anymore. Take this for what it is, an honest review from ONE viewer. Most will not be in favor of my thoughts, because it's not overly positive. But it is what it is. Avatar is not exactly a movie. It is something else. A $400 million cartoon perhaps. Or a $400 million live-action video game. It will probably be copied a million times over the course of the upcoming decade though. Maybe, hopefully, by the end of it, Cameron will return to making movies with real people again. Maybe then, everyone will copy him once more, and all movies will go back to being about real people again. I think that's something that we all want deep down inside, but, for some reason... we just won't admit it.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "nofoodu",
            "reviewer_url": "/user/ur22618335/?ref_=tturv_usr_28_t",
            "review_date": "Dec 30, 2009",
            "rating_value": "10",
            "short_review": "Its too god to be true",
            "full_review": "Avatar was probably the greatest movie i have ever seen in my life. The special effects were jaw-dropping, and i didn't even see the movie in 3-D. But i will go see it for the 3rd time this week, in Imax 3-D.The emotions displayed on the characters faces were incredibly detailed, especially Neytiri. It all looked so real. If i didn't know better, i would of said that they just went to a distant planet and filmed aliens. It looked so real... This was probably the first movie that i actually was disappointed that it ended. i really wanted it to never end. The flying scenes were incredible, and the scenes when the humans interact with the Na'Vi were flawless.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "willandthomas-picturehou",
            "reviewer_url": "/user/ur16596626/?ref_=tturv_usr_29_t",
            "review_date": "Feb 8, 2010",
            "rating_value": "7",
            "short_review": "7 For Chutzpah",
            "full_review": "You put your glasses on and you're in. A feast for the eyes at least for the first hour. The brain, however, remains asleep. How strange that such an ambitious enterprise could ignore its most important aspect, the story. A rehash of other things with dialogues from a high school play. Also, very self referential. The bitch! from Aliens truly omnipresent. I was surprised Sam Worthington didn't say \"I think I've seen an iceberg\" or maybe he did say it while I conceded myself a little nap - after the second hour - So here we are, facing a film future in 3D\" I will, still, long for characters in movies, people I can, not just relate, but be inspired by, thought provoking and all the rest that goes with it. So, Cameron did it again and if money is at the center of the world, he remains \"king of the world\"",
            "data-review-id": ""
        },
        {
            "reviewer_name": "JoshuaParis",
            "reviewer_url": "/user/ur22709325/?ref_=tturv_usr_30_t",
            "review_date": "Jan 19, 2010",
            "rating_value": "8",
            "short_review": "Welcome to Pandora",
            "full_review": "It's been 12 years since we last saw James Cameron's visionary directing on the big screen. He previously graced Our Cinemas with the Likes of The Terminator, Aliens and the rather popular titanic. The latter went on to gross more than 1.8 billion dollars worldwide and bag 11 Oscar's. Now he's back with another epic, Avatar. It's been 12 years in the making, now it is being realised in glorious 3-D.The story is set hundreds of years from today on the distant moon of Pandora. The planets a lush, vivid place full of beautiful and deadly creatures. The population that inhabit this planet are the Na'vi, they are big, very fast and athletic with a knack for not taking the humans lightly. The film centres on Jake sully (Sam Worthington) a paraplegic marine who is offered a second chance at being a soldier. He is asked to fill in his recently deceased brother's boots and head to Pandora. The First thing you will notice about this film is that it looks incredible. Every single blade of grass has been fully detailed. The motion capture technology brings the Na'vi to life, with every emotion being realised. This is truly from a visionary point of view, a work of art.You are transported to the Moon of Pandora and it's a marvel if you are seeing it in 3-D, as intended. You are then introduced to the main characters of the film. First you meet the rather joyful and impressive colonel Quaritch (Stephen Lang) He gives a stand out performance as a stereotypical American Grunt, a rather over used cliché by the Canadian director. You are then introduced to Dr. Grace Augustine (Sigourney Weaver) who has affection for the Na'vi, and looking for a way back into the indigenous population's community.You will notice through the film that there are many references to James Cameron's previous work Aliens. There are a few small similarities' and one big, Aliens is arguably Cameron's best work, so it's not a negative. The role of Parker Selfridge (Giovanni Ribisi) will remind you of Carter Burke, the slimy all business Executive from Aliens. The score by James Horner, who also worked with Cameron on the 1986 hit leaves a familiar taste in your mouth. Cameron originally wanted Michael Biehn to play the role of Quaritch but thought the audience would get confused as Sigourney Weaver is also in the movie.The introduction of neytiri (Zoe Saldana) is powerful and exciting, You get the impression that she knows how to handle herself, This is a trait of all Jim Cameron's heroines. She introduces us to the Na'vi culture, and in the process, we start to care for and understand the advanced race.The film flows well; it can drag at times, especially in the middle act of the film. This could have been improved with an extra RDA encounter, to further mount the tension between the Na'vi and the inpatient humans. The Action in the film is amazing, real hard hitting stuff. But it is in no way mindless. Every scene of action has been carefully crafted, by the trusty hands and eyes of James Cameron, Who has a knack for getting the audiences, pulse racing. The final battle lasts around 40 minutes long and it is defiantly a sight to be seen.Final Thought's: On a technical level the film is a triumph with moments of wonder, the action is top notch to boot. The script and story can let it down at points, but that is no reason not to see the movie.Avatar is like a beautiful painting. What you see is what you get, and what you get is nothing short of epic.A moment of brilliance: The final battle scene is as good as they come. The last time you had Goosebumps like this, was when a well known farm boy, destroyed a death star.Reviewer: Joshua Roberts",
            "data-review-id": ""
        },
        {
            "reviewer_name": "in_chainsagain",
            "reviewer_url": "/user/ur3929021/?ref_=tturv_usr_31_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "6",
            "short_review": "Masterpiece or Pocahontas in Space?",
            "full_review": "It's movies like this that are a reminder that story should always be the number one priority when making a movie. The amount of clichés at multiple phases in the movie is unbelievable. It would be too easy to point out obvious and rather blatant rip offs that occur throughout (going into a misunderstood tribal group, sacred trees, being in tune with nature). After all I was almost shocked I didn't see the writers of the Disney version of Pocahontas credited as assistant writers.After saying this, I have to give credit where credit is due. James Cameron's vision for film making is unmatched by anyone. The visuals are outstanding; entertaining and saved me from regretting laying down the extra two dollars to see this film in 3-D (it's not worth it to see the regular version). It is obvious that Cameron has unparallel dedication and drive to make a film that people will want to see. This same dedication and drive made him want to handle writing this one himself. Few posses the power to demand the type of budget that Cameron can and it's obvious this film could not have been made without a substantial budget. If you would have combined this new ground breaking and visually stunning technology, with an equally moving and unique script then that's the movie I want to see.Am I disappointed I invested 162 minutes and $10.50 into this movie? No. The visual themselves are worth the price. But at points you will be nauseated, you will roll your eyes, and will ask the question: Why does Hollywood not think we can handle a good story anymore?",
            "data-review-id": ""
        },
        {
            "reviewer_name": "tomskaal",
            "reviewer_url": "/user/ur20287260/?ref_=tturv_usr_32_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "1",
            "short_review": "Extremely predictable and very unoriginal!!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "moonscore",
            "reviewer_url": "/user/ur3479888/?ref_=tturv_usr_33_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "A spectacle for our time, for all time...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ithmaril",
            "reviewer_url": "/user/ur5441645/?ref_=tturv_usr_34_t",
            "review_date": "Dec 17, 2009",
            "rating_value": "10",
            "short_review": "It feels so good to be a fanboy again.",
            "full_review": "I did my best to keep the expectations low, but it didn't quite work out. I mean, it's a movie directed by James Cameron, featuring sassy badass Space Marines, evil corporations, power armor, and Sigourney Weaver. That's the closest I'll ever get to a direct Aliens sequel, definitely one of my top 5 movies of all time and inspiration of countless wet military sci-fi dreams.On the other hand, although trying to stay spoiler-free, I kinda did expect something that would turn me off on a certain levels, hearing things about \"dances with wolves\" in space and a straight green message, delivered in black and white, without the necessary shades of grey in between. Don't get me wrong, I'm all for saving the planet and respecting the natives, but I like my messages delivered in a subtle way that makes me care, instead of the sledgehammer-in-your-face method. See \"the day the earth stood still\" remake. Bah, humbug.Third point: My first movie in 3d. Wasn't sure how it would work out for me with my glasses, and if it would enhance or distract from the experience. Really, I had no clue.So. here's a spoiler-free, very personal summary of what I think: Go. See. That. Movie.In a nutshell: It's flawed, but for me, a flawless experience. It's extremely CGI-heavy (something I couldn't be more sceptic about), but it's CGI you buy into. The designs, the human characters, the animated characters, there's just... chemistry. The illusion is there and makes you overlook the obvious. The plot is predictable, but it didn't give me time to predict, because it gripped me and didn't let me go. See, a movie can have the most blatant story, the question is how it is delivered by the people involved, from the actors to the director. That's the theory, and I was always sceptic of such gibberish. But boy, it was delivered, straight to my inner child, on a silver plate full of awesome. It immersed me. It worked. I was in awe. I was in tears. I was cheering. The whole premise, the parallels to our history, the message, the love story, it's all naive. And I'm so glad that it just shut the **** up that cynic in me in the most elegant way for three hours and made me naive and open for the beauty and wit and wonder in it. I didn't think I was still capable of that, but I watched that movie with the wide, blue eyes of a fourteen year old, enjoying a thrilling, heartbreaking mix of \"ALIENS\" and \"E.T.\".Also, sh** blows up really good.See, the Star Wars prequels were something that should have been just that. Instead, I was pulled out of it and shaking my head all over the place. I was pulled out by wooden, badly-directed actors acting confused in front of too much blue screen. I was pulled out by half-assed cartoony CGI characters. By video game sequences of unbelievable combat and plot holes as big as a small moon.And here's the movie where it's all so flawless, human and elegant- characters, effects, delivery- that I gladly overlook its faults and enjoy it for what makes it awesome. Here's the spiritual successor of the movies I grew up with and loved, that just left me dreaming. Suddenly I remember how it was to watch 1977's Star Wars for the very first time. Grinning, crying, cheering and clapping.This is it. But don't listen to me, I'm being a biased fanboy here.See? It managed to make me a biased fanboy. Nothing has done that in a decade. And it feels so good!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "pippin_evil_genius",
            "reviewer_url": "/user/ur7626893/?ref_=tturv_usr_35_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "10",
            "short_review": "Avatar: Once in a lifetime film making",
            "full_review": "James Cameron is one of the best directors of all time. He is what you may call an Auteur. If you aren't aware of this, then you probably are not a movie person. James Cameron wrote and directed Terminator, Aliens, Terminator 2, and Titanic. That last one I'm not a fan of, but he won Best Director, Picture, and it became the highest grossing film of all time. $1.2 billion dollars.Avatar is his latest film, it is a movie that has been in the works since 1994. After a decade of being in the works, you would expect it to be a good movie. But the real question is it any good? It is the most expensive film ever made. The budget was $500,000,000 so you'll be wondering if all that money was put to good use, and if you should spend $11.00 to see the film in 3-D. Should you or should you not?The answer is that you should. Avatar is a monumental success. It is a film unlike anything you have ever seen. It uses special effects to a level that you have never seen, and that's not a bad thing.The story to Avatar revolves around Jake Sully, a paraplegic ex-marine who is sent unwillingly to a hostile planet known as Pandora. While on this planet he finds himself caught in the middle of a war between the planet's indigenous people known as the Na'vi, and his own race. He must decide whether he should fight for what he knows is right or help his own people destroy Pandora as they destroyed earth. I don't want to spoil anything in the story, so I'll refrain from saying anything else. To put it simple, the whole movie was the prime example of a colonialism work.The cast in Avatar is strong. Sam Worthington (Terminator: Salvation) stars as Jake Sully. He does a fantastic job, but the real credit in the film has to go to Zoe Saldana (Star Trek) for playing the native Neytiri. She creates most of the emotion in the entire film. She preforms fantastically and I also have to mention that she is also really attractive as a blue woman. (True fact.) Some people have complained about Stephen Lang (Public Enemies) as the antagonist of the film. But he actually pulls off a very believable and cruel performance. All the actors in the film are great. But the real actors are the ones that are the digital Na'vi. These actors are the ones that create the film. I think that this movie is proof that special effects don't have to be of just robots killing and blowing stuff up. (Even though that's in this movie.) This movie shows that special effects can be used to take us to places that we never even dreamed of.Other films have used special effects like this. (Lord of the Rings, King Kong, Pirates of the Caribbean, District 9) But none of them have gone as far as this movie has. This movie takes you to a whole new level of film making that you can't even imagine. You almost want to call this movie insane, because of how different and unique it is. You really have never seen anything like this, and that's a very good thing. What I really enjoyed about this film, was how it is a breath of fresh air. You don't see that very often. The only other films to do that this year for me were District 9 and Fantastic Mr. Fox. But Avatar is far more different and unique than these other movies.One thing that I always enjoy about a James Cameron film is his sense of innovation. Avatar is the most innovative movie I've seen in years. It is so different from anything else that you have seen. It is a movie a film that you literally cannot describe. This is a see to believe film. You'll have to see the movie to believe that it's as good as I'm telling you. Avatar is a once in a lifetime film. You will not get another chance to see a movie like this one.James Cameron creates not only a visually beautiful race of people, but also a culture that is so beautiful. The Na'vi in Avatar felt very Native American to me. Everything from how they dress to the musical score is very unique, and made me think of Native Americans. The film was almost like a reenactment of our history, with the Native Americans being driven out of their home land. It's all very believable. It's all very sad as well; and it moves you. I sympathize with the Na'vi as they fight for their lives and their home.I am not a fan of 3D. I think it is over used, and ultimately lessens the movie experience. Avatar however, is not like that. The 3D in Avatar is extraordinary. Little bugs on the screen fly right past you, leaves fall from trees towards you, and the battles are astronomical. You really feel like you're there, and forget that this is a movie. The cinematography is actually enhanced by the 3D which is a rare thing. The wide flying camera shots make you feel like you're flying with the film, it is fantastic.Avatar is a difficult movie to review because it is so innovative. It blows away almost all sci-fi epics out there, and is a must see. See Avatar. It is well worth full-price, and it is the best picture of the year. The only movie that comes to being as good as Avatar is District 9. Avatar however, I will say is better because Avatar has heart. A truly fantastic movie. Avatar is one of the most beautiful movies ever made, it is James Cameron's masterpiece, and it should not be missed.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "petr-42",
            "reviewer_url": "/user/ur16329412/?ref_=tturv_usr_36_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "10",
            "short_review": "King of the world?... No! .... Master of the universe!",
            "full_review": "Simple as that :-) This movie is more than most of you think. It has the message. Cameron has certainly done his homework.Have you ever heard of Gaia theory - living spirit of the planet (so it is not some dead rock as some of you may think) Or what about the theory of the Akashi field? You have it here. If your soul is evolved sufficiently, you'll feel this movie.What i find absolutely brilliant are not just the spellbinding effects or the depths of the story but the SIMPLICITY that is ingenious.The most simple thing done in the right way can have the deepest effect on you and Cameron did that with this movie (and just the line \"I see you\" in the movie is a proof how brilliant and ingenious this movie is)A milestone of the movie-making - and the message for the grabbing hands among us",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Quinoa1984",
            "reviewer_url": "/user/ur0453068/?ref_=tturv_usr_37_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "6",
            "short_review": "Mr so-called \"King of the World\" returns with a visually dazzling spectacle and so-so story",
            "full_review": "James Cameron has big ideas and big visions. Thankfully, the latter he dives into with a lust for cinematic glory and (with more money than some countries have in an entire year) he has made his vision of a planet called Pandora in the year 21-something something of a real wonder. If only his big ideas weren't, for the most part, cribbed from other movies and stories and archetypes. I would be reminded of Joseph Campbell's myth-buster formula that so many have taken to heart in adventure movies, but Cameron's formula would appear to come second to his attention to visual detail. This has its pros and cons, some more or some less depending on what viewer sees/hears in it all.It is ambitious, and quite expensive, and it all shows up on the screen. It has to be said, Avatar is absorbing to look at. So much time and energy was spent into creating this fictional alien species, the Na'vi, and it pays off in the respect that Cameron's visual fx team painstakingly makes it appear real and otherworldly at the same time. We might recognize the lush and green surroundings, or even some of the trippy creatures, and if it comes close to anything it's like Ferngully: The Last Rainforest squared and made semi-pre-historic. But it's the scope and grandeur, and when we see the Na'Vi in close-ups or even just far away, you can see the sweat and the detail in their faces, the human beings playing them projecting off the screen. I forgot, if only for a few moments at a time, that they were animated and done in motion-capture. If part of a filmmaker's job, in a situation like a super-mega-sci-fi epic is to make us believe in another world and place (even if it's familiar), then Cameron has done his job very admirably.So if Pandora is great to look at (especially in the practically prerequisite 3D, which also has its own levels of detail and nuance and doesn't just JUMP at a viewer), and if the technology shown on screen- of how a human being goes into an avatar, is fascinating, then why isn't it such a smash all around? Simple - the story, and the characters. Cameron does pay them attention, but only inasmuch as to get us going into the Pandora environment. When he has characters like Jake Sully (very good Sam Worthington) and Neytiri (Zoe Saldana, even better) saying such trite dialog and going through the motions of a story that is familiar to anyone who has seen Ferngully or Dances with Wolves or, to a lessor extent, Last Samurai or New World (super pro-environment, obvious anti-colonialist), it starts to drag the film with it. I never grew tired of the cinematography or the wonderful sights on Pandora, but could I have done without such one-dimensional gritting-of-teeth from Stephen Lang? Absolutely.I'm not sure if there should be more movies like Avatar. It takes a filmmaker with the ambition and drive, and the super-screw-you-guys clout that James Cameron has with such a project (not to mention the time for it allotted him - not since Kubrick has a filmmaker taken so long between projects), to pull off something like this. CGI-driven movies could progress thanks to the prowess displayed here, but it does need to be done with the right frame of attitude towards the story. Even if such story is formulaic as this one, a filmmaker does need to try and push the technology a little further while also not forgetting about the human element. Cameron comes close... no, he does go over the brink of doing style over substance, but for this case- and maybe just this one time from an otherwise masterful blockbuster director- it's satisfying.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "URBestFriend4Ever1",
            "reviewer_url": "/user/ur5177230/?ref_=tturv_usr_38_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "10",
            "short_review": "Avatar is a Cinematic Experience !",
            "full_review": "welcome back, James Cameron, One thing is Sure Avatar will break previous ,the all-time box-office Titanic ...The special effects in the movie is Byond Imagination, and Cameron showed us how to use them. Many of them he invented himself! The love story of Jake and Neytiri also really touching one,plot which featured the conflict between two species, namely the Na'vi of Pandora ..Humans tendency is exploit everything ...its resembles Spanish settlers European atrocities against red Indian's Native Americans comparison between human vs navi .Avatar's origins, however, come from the Sanskrit language Oldest Language in the World in sacred Hindu texts, and Avatar it's a term for divine beings sent to restore goodness to Earth.It is believed that these deities sent avatars — incarnations of themselves in human form — to perform \"dharma,\" or righteous duty, to right wrongs or to restore peace and goodness.And James Cameroon used Blue color which is similar to Hindu god Vishu and avatar Ram,Lord Krsna ! Star Wars,Matrix Trilogy all those Sci-Fi Movies where based on Eastern Philosophy Hinduism & Metaphysics .'Avatar' i epic adventure Above all its fun to watch along with a crowd in theater and not at home .!! It was outstanding,unique,superb,unparalleled and keeps the audience spell-bound even after movie ends.Avatar is a cinematic experience and an event, not a mere film it is Magic only James Cameroon can deliver.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "zuma777",
            "reviewer_url": "/user/ur20274624/?ref_=tturv_usr_40_t",
            "review_date": "Jan 4, 2010",
            "rating_value": "7",
            "short_review": "Thank You Mr. Cameron",
            "data-review-id": ""
        },
        {
            "reviewer_name": "rettercritical",
            "reviewer_url": "/user/ur10427060/?ref_=tturv_usr_41_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "10",
            "short_review": "AVATAR has a soul",
            "full_review": "AVATAR has a soul I saw AVATAR today. It was a boiling 40 degrees Celsius in Australia. I caught a bus and train to get there. I spent months on a forum before that. Incremental stops included a scriptment, stills, a teaser, a foot, AVATAR day and a full trailer. Now released I have had many reviews to read which have been mostly very positive. It is a marvel to watch. The opening scenes are very sci-fi with a glimpse of low gravity aboard a space-craft. Sam Worthington fills us in with a short narration. He is taking over his diseased brother's role in the AVATAR program. These opening scenes are actually among the most effective 3D in the film, pulling you into this story, tracking shots putting you into the steps of the characters. I jump ahead, like the film, to The world of Pandora which is lush with earthly life as seen through pulp fantasies. The rendering of this world is terrific. The life and activity is in the plants as much as it is the animals. Wonder is generated with this ambitious creation. Cameron has lifted the bar. The CG is the best I have ever seen. Everything you have heard is true. The 3D enhances this with leaves falling and swaying branches life-like in the foreground. The realisation of the Navii is also ambitious. They are CG but there are many moments that make you think they are real and in terms of the story they are more than good enough to propel the narrative with strong emotional content. I went into this film knowing mostly everything within it. Hours of reading, some from the treatment and pages of the recent reviews. It is very much a family film like \"Nealz\" said in his IMDb review. There is a moment where one of the ferocious animal species that earlier were attacking Jake are seen with a litter, the children in the audience loved the cute pups! The spiritual side of this film is much better than expected. It is in fact a beautiful story. The structure is classical film-making but with amazingly new scope in CGI to express grand images. An epic The journey that Jake takes through Pandora is lovely. He is taken in by the Navii and explores their culture, language and habitat. Natirii, the female Navii he meets while lost, helps him through this journey. This is a love story of both soul mates and with a wider picture. Existential connections with the natural world. Personal destiny. I had tears in this film. I tried to hold them back but by the roll of credits they came. This is a movie that I have anticipated for so long. I think the ingredients of its story and my connection to this films production gave me a very emotional response. I cant imagine this disappointing any of the fans on the board. Keeping in mind that it is a family film but delivered everything I wanted. Expect a special edition. After AVATAR is a hit, a special edition will make its way to the cinema. I can understand why they would cut the earth scenes and it works. The actual film seems pretty brisk and it could also have more padding out. You want more of it and that is a triumph for this type of film running two and a half hours. It is a good balance because at two and a half hours AVATAR is aimed directly at the cinema going audience. Broadly appealing with elements for everyone. My earlier prediction of a billion or more world-wide seems safe. I don't want to go on about visuals too much but the lovely shots of the natural wonderland of glowing life in still 3D shots is magical. Something to take kids to see. Floating tiny neon life jellyfish their way through the air with grace. The monkey-like extra-limbed creatures with the peeping eyes flock through the forrest quickly. The creature design is done in a clever way with the motion of a living thing. The action is over the top, epic, frenetic and a new take on the battle sequence. James Cameron didn't stuff this up. He probably pressed the studio way beyond their comfort zone with the time, money and effort that has gone into this. Sam Worthington is excellent casting choice. Sigourney Weaver ads frank reason. Stephen Lang chews the scenery as the ultimate you know what. Zoe Saldana is beautiful as Jakes guide into this world and. I went to the cinema and it was a very hot day. By the time I left the cinema, the streets were wet with rain. A warm humidity was thick in the air. Lightning splashed my walk to the train station with white light. I honestly wondered if It was my time to be struck down with a bolt of electricity from the sky. Watch this film. It is destined to become a childhood classic to many little-ones too young to be on this forum. It will be talked about at high school by male and females as spectacular. It will be watched multiple times by fans. I loved it but beyond my appreciation for the film itself, is the the message of love permeating from this movie that I hope enters the zeitgeist like elements of Cameron's other stories have. At its heart is a soul. AVATAR is an achievement in many technical departments but I wouldn't say the story is deficient. It is a beautiful experience and the story is surprisingly what I loved most. Believe the hype.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "LumanoidAU",
            "reviewer_url": "/user/ur18553033/?ref_=tturv_usr_42_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "6",
            "short_review": "If you thought Jurrasic Park was your favorite childhood fantasy adventure film, then imagine how children today are going to feel about this!",
            "full_review": "AVATAR is the Jurassic Park of this generation, with no doubt is it a family film, but it is also a hybrid of everything good in Cameron.Firstly, The highly-talked about visuals have given me, and the audience a true experience, if that is counted by the number of gasps, claps and heartbeats of every audience member, I seriously didn't get that in Transformers or 2012, people literally gasped when Jake explored the Bio-Luminescence nightlife of Pandora, now that is something you don't usually get in films! But this film isn't just about visuals, it's about the magic of film-making. And that is something rarely achieved in such absolute beauty, beauty that leaves you walking away from the theater, wanting to return the next day, and the day after that. I have never felt so good after watching a movie, a movie that holds such beautiful magic, since the original star-wars trilogy came out back in the 70's and 80's.The film ends leaving you wanting more, it starts by slowly enticing you, then gradually building up into one heck of an adventure, rolling at such a speed that you'd never think it would end, but films end eventually, and I just hope that we are given more in the future, so seriously, enjoy the power of seeing it for the first-time, watch it with a fresh-mind, an empty bowl and zero distractions because the world of Pandora awaits, the trip of a lifetime to an alien world beyond your imagination!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "mlbstellar",
            "reviewer_url": "/user/ur22655468/?ref_=tturv_usr_43_t",
            "review_date": "Jan 5, 2010",
            "rating_value": "1",
            "short_review": "The Most Unoriginal Film of the Decade",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Znukkas",
            "reviewer_url": "/user/ur11733401/?ref_=tturv_usr_44_t",
            "review_date": "Dec 18, 2022",
            "rating_value": "10",
            "short_review": "A mustsee masterpiece!",
            "full_review": "Avatar: The Way of the Water is visually breathtaking and entertaining. The storyline is original and only leave a want for more. The length of the film was no concern and needed for proper character development. The characters in the film were a good selection and made the film more enjoyable and watchable. The movie may be classified as scifi, but it meets the expectation of almost every genre. Like the first Avatar, this movie wil be my go to movie until the next Avatars come out. Both Avatar movies are deserving of the best movie title. Thank you, James Cameron, you did not disappoint. I look forward to the next installments.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "florianwebner-94771",
            "reviewer_url": "/user/ur152686370/?ref_=tturv_usr_45_t",
            "review_date": "Dec 19, 2022",
            "rating_value": "10",
            "short_review": "Just the best Cinema experience on this planet",
            "full_review": "The visuals and 3D are truly amazing. Some people spend Thousands for traveling to see beautiful landscapes and that's fine. But in the cinema we see the most beautiful world and the visuals are so good, one forgets being in a cinema. It feels like 3 hour trip to another planet. Some people say its boring, because the story is not unique. But that doesn't matter. A movie is a story and how the story is told is 100 times more important than the story itself. Every crime movie has same story: Someone dies -> detective identifies murderer. Yet we want to see HOW the detective does it.Actually I think, there are not so many different base stories and many movies are similar to each other. But Avatar has only one similar movie which is why people notice it.No one would complain about a crime movie: I know this story from this movie, and that movie, and that movie, and this one as well... Oh and this one and that one.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Ali-hi42",
            "reviewer_url": "/user/ur28919344/?ref_=tturv_usr_46_t",
            "review_date": "Jul 13, 2020",
            "rating_value": "10",
            "short_review": "11/10",
            "full_review": "If i may rate it 11 i will surely do. Can't wait for Avatar 2 at 2021",
            "data-review-id": ""
        },
        {
            "reviewer_name": "jaykchan",
            "reviewer_url": "/user/ur16371618/?ref_=tturv_usr_47_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "10",
            "short_review": "Stunning visuals and an \"OK\" story!",
            "full_review": "Snapshot: Avatar is a \"visually stunning\" movie that captures your imagination with a pretty ordinary story that SOME might find triteWhy I LOVED IT?When people were first informed about Avatar NO ONE spoke about \"A Great Story\" or \"Wonderful and complex Characters\". Avatar was supposed to be a treat for the eye, a very imaginative and immersive world. Avatar exactly does that. I LOVED it because it delivers what it promised to!Why is it \"Ground Breaking\" and \"Stunning\"?Avatar totally blew me away in the visuals department. Now I know some people are saying that there are many movies that look more \"REAL\" and have better quality of animation than Avatar e.g. Final Fantasy, but I guess these people are missing the point. Avatar is actually about NOT looking real, it is about showing something that we have never seen or have never imagined (exotic creatures and floating mountains!!!). It is also about meticulous attention to details that we may actually never notice especially when we see the movie for the first time. So ultimately using fine details and imagination of some very creative artists a stunning and immersive world called \"Pandora\" has been created. What's NOT good? Avatar does not try to do anything new in the story line department. It's got a couple cheesy dialogues and just a touch predictable. It is the same old story told in a new way. But then how many movies that are made are really original today? From my perspective I even LIKED the story but some people with different taste, perspective and expectations might complaint!Who should watch it? I suggest EVERYONE, at least for \"Pandora\"Who should avoid it? NO ONE! HOWEVER if you are VERY RELUCTANT about \"ORIGINAL STORY\", \"GREAT CHARACTERS\" blah blah blah and just cannot get the message right then don't watch it, but then you will be missing something very special \"Trust me\" on this one!SummaryGo for the movie with the right expectations i.e. \"An imaginative and visually spectacular movie\" and put other things like a \"GREAT STORY\" aside. Avatar is everything what it promised to be and that is why I give it 10/10",
            "data-review-id": ""
        },
        {
            "reviewer_name": "0U",
            "reviewer_url": "/user/ur87850731/?ref_=tturv_usr_48_t",
            "review_date": "Feb 23, 2020",
            "full_review": "Avatar tells a familiar story but its a story that works so well inside of this movie. The visuals and 3d are still one of the best to date and i totally get why it made so much money.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "CihanVercan",
            "reviewer_url": "/user/ur19658928/?ref_=tturv_usr_49_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "7",
            "short_review": "Putting perfect Visuals and Virtualities aside, going deep into the Avatar's concept",
            "full_review": "Looking into Hindu mythology, when Gods descend to Earth they acquire avatars to make themselves known by human beings. Of the recent years' TV animation series let's look over \"Ōban Star-Racers\" from Jetix and \"The Last Airbender\" from Nickelodeon for avatar concept. In Ōban Star-Racers, the Earth had been threatening by antagonist galactic races and human beings were expecting a savior from space who is called the Avatar. On the other hand in the Last Airbender, avatar concept was completely confused with Prophecy. Aang the Avatar was born in the form of human being, which is wrong; because Avatar is a form of a God which has no destiny, no life, no death. Herein James Cameron's Avatar, the concept is truly appropriate to the origins of Hindu mythology: When humankind explores the planet Pandora, they aimed to search for underground resources; so they send an ex-serviceman to the natives in a DNA mapped hybrid body(which seems like one of them) to capture their secrets. Becoming the Avatar of natives by time, the ex-serviceman saves the planet from humankind, turning against his origin. Exploring a new planet, descending on the ground, trying to capture it by blending within natives, but failing to do so... This actually is the same storyline with a Sci-Fi legend: Franklin Schaffner's \"Planet of The Apes(1968)\". Still keeping its sense with having the most terrifying ending of all science fiction works ever created, Planet of The Apes has so many things in common with Avatar. The Apes and the Na'vis both seemed atrocious and uncivilized at first. Then we realized that they're in fact very cuddly creatures. Both Charlton Heston and Sam Worthington became beloved with a female native, and we're introduced to their untouched and God's gift virgin nature. Then as in Star Wars and Abyss, humankind declares war against the natives to capture their lands and resources. Another unique similarity between Planet of the Apes is that humankind is the evil-side again. So the same message we get with a deeper self-criticism is that humankind is the one who destroys the nature and is responsible of all wars. Wasn't this the Terminator's message as well, spoken out by Sarah Connor? \"It's in our nature to destroy ourselves\". All to the good, we didn't lose our World to apes or cyborgs this time.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "PerpetuumMobile09",
            "reviewer_url": "/user/ur22130130/?ref_=tturv_usr_50_t",
            "review_date": "Jan 11, 2010",
            "rating_value": "10",
            "short_review": "A grand cinematic experience",
            "full_review": "AVATAR is one of the few films in recent years that I've really looked forward to. Given Cameron's solid track-record when it comes to sci-fi/action-films, there was no doubt in my mind that this film would be good, even though it's been 12 years since his last feature film. The only question in my mind was whether the film would be great or merely good. Fortunately, it turned out to be the former.I'll start by mentioning a few things that I really liked about the film, and areas in which I feel it succeeded very well: The characters: Cameron invests enough time in his characters so that the viewer actually care about them when the going gets tough later on in the film. Most action-directors put too much emphasis on the action and fail to involve the audience on an emotional level: You couldn't care less what happens to the main characters and the feeling of genuine suspense is severely undermined. AVATAR is an action/adventure film with a heart.The CG (primarily by WETA Digital) looks great, especially when it comes to organic objects, such as plants and the blue humanoid-looking natives. The great attention to detail makes a significant difference in terms of photorealism. The natives move and express themselves in a very convincing, natural manner. Mocap (*) has been used for many years, but this is one of the few films in which the movements (both body and face) look completely realistic. AVATAR sets a new milestone when it comes to photorealistic characters. I was also very impressed by the seamless integration of CG and live shots, and the CG explosions: The explosions were actually created using fluid simulations which made them look very realistic (the normal approach is to use live shots of real explosions, composited on top of CG elements).The directing: With AVATAR, Cameron demonstrates why I consider him one of the best action directors in modern cinema. The long finale, in particular, is one of the best action-sequences I've ever seen. It's dynamic, intense and exhilarating to watch. The rhythm and pacing is spot on. Cameron also slowly builds the film to its finale, and this makes the action-sequences even more rewarding (because the buildup serves as 'foreplay' and creates anticipation).Other things that I liked: The beautiful cinematography and the interesting, underlying themes related to imperialism and the environment. It makes you think a bit after you leave the theatre, and it adds a bit of extra depth and meaning to the film. This is more than you can expect from a typical film in this genre nowadays.It's hard to pick things that I didn't like about the film, because there was nothing that really bothered me. If I had to mention one thing that I was hoping would be better, then it would be James Horner's score. It didn't seem as prominent or memorable as it should've been. Its impact on the overall movie experience was much smaller compared to his score for films such as TITANIC, ALIENS or BRAVEHEART. I'm not saying the score is bad, far from it, it just lacked that little extra.Some people have complained about the simple plot and predictable ending. I personally didn't have any issues with the plot, and I must admit that I don't really understand those who get too obsessed with spotting plot holes and logical problems. First of all, it's not really the story itself that matters, its the way it's told, because film is primarily an audiovisual medium. Cameron's films are simply structured in general and they're easy to follow. But he makes things interesting and engaging to watch because of his storytelling skills. Although the film lasts for over 2,5 hours, I never felt there was a dull moment. Cameron sucked me into the film from the get go and he didn't loosen his grip until the end-credits started to roll.I've seen both the 3D and 2D version. Some people clearly prefer the 3D version, but I didn't feel that I lost anything substantial when I saw the 2D version. Cameron doesn't make the mistake of trying to use 3D as a cheap gimmick, and the use of 3D effects isn't exaggerated. The 3D effect is impressive, though, and the technology has obviously improved significantly in recent years. After a few minutes into the film I almost forgot that I was wearing the glasses: They were comfortable and they didn't cause dizziness.AVATAR is a visual tour de force that really needs be seen on the big screen in order to be appreciated fully. Don't wait until the DVD or Blu-Ray is released: The experience simply won't be the same, unless you have a big, high-end home-theatre.(*) Motion capture: Technology used to capture the actors's performances, so that they can be reproduced by their CG characters.",
            "data-review-id": ""
        }
    ]
}