{
    "ImdbId": "tt0499549",
    "total_reviews": 144,
    "reviews": [
        {
            "reviewer_name": "Misagh",
            "reviewer_url": "/user/ur13407466/?ref_=tturv_usr_1_t",
            "review_date": "Dec 13, 2009",
            "rating_value": "8",
            "short_review": "After a decade, Cameron sets the avatar of our new generation",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Samiam3",
            "reviewer_url": "/user/ur19511193/?ref_=tturv_usr_2_t",
            "review_date": "Dec 12, 2009",
            "rating_value": "9",
            "short_review": "Cameron Returns",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ClaytonDavis",
            "reviewer_url": "/user/ur2898980/?ref_=tturv_usr_3_t",
            "review_date": "Dec 14, 2009",
            "rating_value": "8",
            "short_review": "One of the best cinematic experiences ever...",
            "full_review": "Forgive me, I'm going to jump from professional to fan boy for a while here. I haven't had the jitters after a film the way I've had for Avatar in quite sometime. James Cameron's Avatar is the most entertaining and enthralling cinematic experiences of my life. It is incredible, simply put. What Cameron has done here is the most passionate film project put out since Steven Spielberg released Schindler's List. His attention to detail and his zeal for pushing the envelope is so admirable to any filmmaker or actor who will ever do another film from this point on.Avatar is the story of Jake Sully, a paraplegic marine, who replaces his brother on a secret mission to infiltrate the Na' vi, the colony of beings that sit on the planet of Pandora, where there is a precious ore, that sells at a ridiculous amount. When Jake learns the ways of the Na' vi, his feelings and learnings will put him and the people he trusts in dangerous jeopardy.The performances here, in the sense of reacting, becoming, and understanding what Cameron has written are astounding. Not to be confused with a sensational bravura performance from some of the centuries best such as Marion Brando, Tom Hanks, or Diane Keaton; these actors along with the director inhabit these visual transformations with special effects as if they are have lived these beings all their lives. This is all based on character movements and reactions. Sam Worthington, as Jake Sully, is an actor who's on his way to becoming a star. Though he has problems with his Aussie accent often enough in the film, he gets the job done. Zoe Saldana, who plays Neytiri, a Na' vi huntress, is thrilling and electrifying. Stephen Lang, as the rock hard Colonel Miles, takes on a villainous turn to a new level in science fiction. He offers actual emotion and emotes evil to the audience and gains our hatred easily. Sigourney Weaver as the beautiful Dr. Grace, is sufficient enough to have on screen again teamed with Cameron. She lives inside her role with effortless ease, but suffers from some of the typical James Cameron cheesy lines.Narratively the film works perfectly on the cinematic level. The first forty minutes or so require patience and hope as it is the weakest part of the film and offers some dreariness, but when the second act takes off, it's sky high with no limits for James Cameron. Avatar delivers the best action sequences put on film of all time. That is the boldest statement I have ever made in all my years of criticism. I sat on this for two days before charging it out, but I mean it. It is the best visual experience of my life, period.Other than those visuals, the film pops with all the other technical aspects thrown into one. Art Direction is killer as the two worlds blend in perfectly for an acceptable time. The Film Editing is the crowning achievement of the film as it also offers the perfect blend of the two worlds, enticing the viewer and shifting us around. Mauro Fiore is the threat for a Cinematography Oscar this year. It was if the viewer sat down in a chair, put on glasses, and was literally placed on Pandora, spaceships, and floating mountains. The viewer can feel so engulfed by the imagery, you feel like you can smell the leaves from the trees. Avatar is utterly hypnotizing. James Horner's score is some of the best work done in his career. It offers a variable of devastation that moves the viewer to near tears. It goes back to his work on Titanic, where the musical instruments lifted the material immensely. The entire sound team is also locked and loaded for Oscar recognition as the feeling of animals, machines, and arrows buzzing by your head leave you imprisoned in Cameron's exquisite film.James Cameron has come back home ladies and gentlemen Cameron is back, bigger, badder, and mature in his crowning work of his career. Terminator 2: Judgment Day and Titanic do not even compare anymore. This is the film that can blend the fans of those two films together and lock Cameron into your heart. He's a definite spoiler for a directing bid for the Academy Awards. You have admire the raw, natural talent the man has. How could you ever conceive such an experience and put that much effort and work into it and have it pay off? The box office success will surely keep him in the minds of voters for various critics' awards. His screenplay, leaps and bounds better than 1997's Best Picture Winner, is primed, developed and ripe for the taking. Though, you do acquire the tacky and atypical dialogue you expect from a science fiction director of this caliber, you can appreciate the effort and the honesty of it all. James Cameron is everything Michael Bay wishes he was, to put it bluntly.Avatar will bring also great actors putting their best foot forward such as Giovanni Ribisi, who is as underrated as they come. Michelle Rodriguez who exudes sexy like any woman starring in a sci-fi epic. Joel Moore, showing his range outside of his comedic work in Dodgeball: An Underdog Story. And the classy veteran actors, CCH Pounder and Wes Studi, who just simply don't work enough.Avatar is one of the best films of the year. The most exciting, thrilling, and superb work you'll feast your eyes on in any theater this century. Cinema, forever, will remember the benchmark that James Cameron placed not only for himself, but for any man, daring to change the game, the way Cameron did. Avatar is a movie experience to be remembered, and please experience in a movie theater first.***½/****",
            "data-review-id": ""
        },
        {
            "reviewer_name": "eldreddsouza",
            "reviewer_url": "/user/ur78310344/?ref_=tturv_usr_5_t",
            "review_date": "Sep 23, 2022",
            "rating_value": "10",
            "short_review": "It's an experience! A magical one.",
            "full_review": "I was waiting for this day for the longest time. I was a kid back in 2009 when this movie released. So never got to watch it back then. But now when it rereleased I booked the first day show to a IMAX show and oh boy was I blown away! This is nothing short of a masterpiece! It's beyond belief how a film like this could've been made. Every scene, every shot is perfection. You are transferred to a different world and become so engrossed in the film. Never have I attended a movie where at the end of it people got up from their seats and started clapping! Last time this happened was after Infinity War. That movie too was a damn brilliant one. I'm from India and this is legit rare, where people go crazy, so crazy after any English film. This was one experience that I will never forget. I'm definitely going for it again next weekend cuz just once was not enough.Every human on the planet needs to experience this magnificent work of art!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "cyberjedi-608-518993",
            "reviewer_url": "/user/ur22532965/?ref_=tturv_usr_6_t",
            "review_date": "Dec 14, 2009",
            "rating_value": "10",
            "short_review": "Best movie experience of the last 30 years...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "lionel-14",
            "reviewer_url": "/user/ur2064686/?ref_=tturv_usr_7_t",
            "review_date": "Dec 12, 2009",
            "rating_value": "10",
            "short_review": "Fascinating concept .Must be seen cannot be described",
            "full_review": "I saw this epic last night at the Empire Leicester Sq in London, which is a superb venue in which to view this film. Huge screen, excellent sound and an extraordinary Dolby, 3 dimensional image. The whole effect is mind blowing.This is a 'Must see' movie, innovative, and extraordinary. I think it will be regarded by most cinema goers as another milestone in the history of the art. The level of realism achieved is remarkable, and although the film is relatively long in real time, it retains it's excitement and holds the audience's attention to the end.Performances are good, but this is not the sort of film that dwells on big star value for the actors, although Sigorney Weaver does shine and delivers a very convincing performance, as do the rest of the cast. But as there is so much entertainment and action value on screen the human element does not dominate in the usual way.As Writer/Director, James Cameron deserves high praise for this creation and in my opinion it will break box office records. I thoroughly enjoyed this film.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "fnet_florent",
            "reviewer_url": "/user/ur10656343/?ref_=tturv_usr_8_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "6",
            "short_review": "Visually stunning, but ultimately unimaginative",
            "data-review-id": ""
        },
        {
            "reviewer_name": "yoel-47650",
            "reviewer_url": "/user/ur68961762/?ref_=tturv_usr_9_t",
            "review_date": "Nov 18, 2022",
            "rating_value": "9",
            "short_review": "A fantastic journey.",
            "full_review": "You know the feeling when you start watching a movie, realizing it's almost 3 hours, and saying to yourself - \"Well this is probably gonna be mostly boring\", well, the creators of this movie didn't let that happen, rest assures.From the beginning up until the ending, every scene is perfected, with amazing acting, stunning directing, great visual effects, and astounding sound effects.The story building is just great , characters are well-developed , and the concept is brilliant.The only thing that's missing to me, is a fitting-soundtrack which could've give some scenes a great boost.I avoided watching this movie for a long time, because it just seemed a little ridiculous to me (Come on there are blue people) but I'm so glad I finally decides to give it a chance, and boy did it serve.Loved it. 9.5/10.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "benjamin-heckendorn",
            "reviewer_url": "/user/ur22561863/?ref_=tturv_usr_10_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "6",
            "short_review": "How could anyone who's seen more than 4 movies in their life find this creative?",
            "data-review-id": ""
        },
        {
            "reviewer_name": "suhanime",
            "reviewer_url": "/user/ur150616236/?ref_=tturv_usr_11_t",
            "review_date": "Mar 9, 2022",
            "rating_value": "8",
            "short_review": "A great science fiction adventure from a master filmmaker!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "TheLittleSongbird",
            "reviewer_url": "/user/ur20552756/?ref_=tturv_usr_12_t",
            "review_date": "Aug 6, 2010",
            "rating_value": "6",
            "short_review": "Visually mind-blowing, but lacking in the story",
            "full_review": "I did see Avatar for the first time a while ago, and didn't know what to make of it. To me it felt like a visual feast if little else. Re-watching it again, I found more strengths, but there are several weaknesses that prevent it from being a masterpiece.Starting with Avatar's strengths, it is absolutely mind-blowing visually. The cinematography, landscapes, scenery, colours, make-up and effects are outstanding and are by far and away Avatar's strongest asset. I also liked the score, it is certainly not the best score I have ever heard, but it had some very nice moments, while Cameron's direction is competent, the message admirable, and the finale well and truly explosive. I also loved the flying sequences, they were breathtaking.The acting in general is a mixed bag. Sam Worthington is a charismatic enough lead, while Zoe Saldana is strong and spirited. Stephen Lang is an enjoyable and over-the-top villain of the piece too, however Sigourney Weaver is somewhat so-so, doesn't help really her character isn't that interesting while Michelle Rodriguez and Joel Moore aren't given very much to do.What didn't work so well is that Avatar's story, with themes of love in a time of chaos and man alone in a hostile environment, is rather simplistic and predictable. I also felt it took a while to get going, and that the relationship between Jake and Neytiri was on the dull side. And is it me, or does this film drag at times, particularly towards the end? Now don't get me wrong, I liked the concept, it wasn't exactly original, as I often heard it described as \"Dances with Wolves in Space with rip-offs of Pocahontas and FernGully\"- but I am not going to join those who say that- I have to admit regardless of its originality or lack of it the concept intrigued me. Then there is the dialogue, which is nothing special and never quite rings true. There are some amusing moments but a vast majority of the dialogue in the middle of the film never quite convinced or came across as cheesy. The characters also came across as rather clichéd, especially Giovanni Ribisi's, and the character development was lacking.So all in all, Avatar does have a lot of strengths, but a lot of weaknesses too. I will say I preferred it over The Hurt Locker, which to be honest left me cold, but I think I would be stretching it a bit if I said it was 5-star masterpiece. 6/10 Bethany Cox",
            "data-review-id": ""
        },
        {
            "reviewer_name": "elchocobollo",
            "reviewer_url": "/user/ur22516874/?ref_=tturv_usr_13_t",
            "review_date": "Dec 11, 2009",
            "full_review": "Well, I just saw Avatar this morning, one of the press premieres which are running on these days. My opinion: you've seen this story a hundred times, but never like this. Finally 3D is what it's supposed to be, an instrument at the service of the movie. You'll enjoy the visual experience, no doubt.As for the story, some of the \"inspirations\" are so huge and so obvious that mentioning two or three of them would REALLY ruin the movie for you, and I'm not willing to do that. Lots of mysticism and ecology, if you like that stuff. If you're 15 or so, you'll have a great time thinking that it's the first time somebody makes something like this. If you're an experienced movie watcher, better leave your skepticism at the door, bring lots of pop corn and enjoy with the usual action-flick-with-moral-and-loads-of-clichés.I liked it, however: \"the movie that re-invents movies\"??? No way.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "NonSequiturL",
            "reviewer_url": "/user/ur16237357/?ref_=tturv_usr_14_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "9",
            "short_review": "Incredible scope and spectacle",
            "full_review": "A film with the scope of James Cameron's Avatar was always going to be a risk both artistically and financially, especially in today's economic climate. Whether it will pay off monetarily is a question only time can answer, but this viewer can at the very least attest to it being an artistic triumph.Avatar brings us as close as cinema ever has to actually visiting an alien world. The beautiful environs, the exotic creatures and incredibly lifelike natives of Pandora arrest the senses, visually, aurally and emotionally. The world in Avatar is the true star of the show. The amount of detail and work that has gone into bringing this new world alive is seriously impressive, and it will be a while before we see anything that overtakes it in scope and quality. WETA Workshop and ILM have truly outdone themselves.Relative newcomer, Aussie Sam Worthington provides a solid human heart amongst all the science-fiction/fantasy beauty and Zoe Saldana gives an impressive performance as the 8 foot tall Na'vi, Neytiri. Even though the characters they both play are blue, giant, catlike aliens, they managed to evoke a chemistry and likability that pierces through the special effects.That's not to say that everything is perfect. The story is basic and dare I say, clichéd and predictable. We have seen it plenty of times in all forms of media. The bad guys are cartoonishly evil, and sadly paper thin. The love story, while charming, is also clichéd despite being between man and alien. But in the face of these shortcomings, Avatar is a success because its storytelling lies in the brilliant visuals.Avatar is a beautiful piece of film and a true event. It does exactly what cinema was always intended to - it takes us away from our problems and worries for a few hours and gives us memorable images which will undoubtedly and deservedly enter into the cultural lexicon to stay for the foreseeable future.9.5/10",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ftyl",
            "reviewer_url": "/user/ur5378817/?ref_=tturv_usr_15_t",
            "review_date": "Dec 15, 2009",
            "rating_value": "9",
            "short_review": "The best blockbuster in years - the master is back!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "shaikhirshad-41223",
            "reviewer_url": "/user/ur99503134/?ref_=tturv_usr_16_t",
            "review_date": "Sep 23, 2022",
            "rating_value": "10",
            "short_review": "A NEW WORLD.....",
            "full_review": "Hatts of to JAMES CAMERON for thinking and creating a vision like this. It takes a lotseof hardwork & research to build a whole new world. And there is a reason why this movie is still the no 1 movie in the world. I've never seen this kind of visuals in any other film. And this movie was made in 2009 that was an amazing achievement by the VFX creators & the director itself. You can easily get connected with the movie plot and the way the director has shown the Pandora world was just unbelievable. Cast of this film has done a fabulous job while performing so well and get into the character that not a single one will disappoint. Emotional scenes are so powerful that you feel the characters and their pain for what their suffering. Visual Effects makes this movie so powerful that every creature and big scenery scenes looks real. That's why it has re-released once again to feel the same experience. Don't miss this one on the big screen if you haven't seen it. It's a total new world experience. Can't wait for the PART 2....",
            "data-review-id": ""
        },
        {
            "reviewer_name": "MorganGrodecki",
            "reviewer_url": "/user/ur8152215/?ref_=tturv_usr_17_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "Avatar - Breathtakingly Beautiful",
            "full_review": "When movies are created, they are done so with intent. Different genres of film target specific audiences, a formula which has sustained Hollywood and it's industries since the beginning of the blockbuster movies. When a movie is created in a manner that sets in motion any given goal, said films success is pendant on whether or not that goal is reached. If a comedy creates laughter, or if a romance produces tears, then they are successes in their own right. So when a massively ambitious, seemingly impossible to create film aiming to usher in a new era manages to grab hold of it's audience and take them on an unprecedented cinematic roller coaster ride that delivers the goods every turn of the way, it can be considered successful. Avatar is that success.A work in progress that spanned a decade and a half, Avatar is more than just a film - it's an experience, an event. When James Cameron set out to make this movie back in the mid 90's, he realized that his ambitions were simply too far ahead of their time. His ideas could not be reached in a feasible manner, and due to this, he had to wait. Or create. Once informed that the image he held for this film was one that was out of grasp, he began working on the technology that would bring his masterpiece within reach. Fifteen years and nearly half a billion dollars later, James Cameron has brought that vision to the screen, and has done so in an extravagant and showstopping way.Avatar tells the tale of a war between species, each fighting for the ultimate survival of their race. Desperate to find the fuel for their dying planet, human soldiers and scientists set out from earth and set course for Pandora. A planet connected by all living things, Pandora is home to an indigenous species known as the Na'vi, as well as the precious element Unobtanium needed to save earth. Using transference technology, paralyzed marine Jake Sully is volunteered for the \"Avatar Program\", which enables the thoughts and mind of a human to be placed within the shell of a tube-born Na'vi body. Using this as technique to their advantage, Jake is sent into the harsh Jungles of Pandora in order to bond with the natives, thus gaining knowledge and insight on their ways. Having originally planned to use this knowledge as a means of negotiating the natives relocation, so that the humans can access the deposit of Unobtainium - which just happens to sit below their most worshiped and valued pseudo-deity of their planet.While the plot on paper may read as a standard shoot'em-up action sci-fi flick, it is a near inconceivable task to truly explain how incorrect this appearance truly is. This takes a stroke from every movie, and a dab from every genre, and manages to create a portrait of beauty, in which all pre-existing notion of what cinema can and cannot do is destroyed. Within the lengthy hundred and sixty some odd minutes of film, moviegoers will find that there is always something to keep them enthralled, a merciful gift when considering how tedious many of the longer film of recent memory can become.No matter what can be said about the overtly cheesy script,a criticism that, while holding true, manages to fit charmingly into the over-the-top nature of the film, Avatar does as it set out to do, bringing moviegoers a cinematic experience rather than a film. Relying on the technology that he created, Cameron pours his heart into this movie, and it shows in every scene. Ranging from the absurdly detailed creatures to all-too-realistic planet, this flick manages to tell a fulfilling story while all the while throwing jaw-dropping scenery at the audience, giving them only enough time to recover before bombarding them with yet another breathtaking shot.Be it the fantastical and charming love story told between the native and the outsider, or the too-real-to-be-true action scenes between gunships and foreign ferals, Avatar is what Star Wars was too the 70's, the Wizard Of Oz of the 40's - a masterpiece that will go down in movie history as a game changer of it's time.4 Stars out of 4 Stars",
            "data-review-id": ""
        },
        {
            "reviewer_name": "NoArrow",
            "reviewer_url": "/user/ur1903880/?ref_=tturv_usr_18_t",
            "review_date": "Jan 1, 2010",
            "rating_value": "6",
            "short_review": "Looks great, I just wish I cared what happened in it",
            "full_review": "\"Avatar\" is not the next \"Star Wars\" or \"Lord of the Rings.\" It might be the next \"Matrix,\" though. Or, perhaps more accurate, the next \"Matrix Revolutions.\" It's technically groundbreaking craftmanship put to work on a story that was played out after \"Return of the King.\" There are a lot of bad guys, a lot of good guys, and sooner or later they're all gonna meet on the battlefield. The little details are not-so-shockingly unimportant, since nothing could stop, change or even, really, comment on the unstoppable trajectory of this film's story.It's the future. An Evil Corporation is parked on distant planet Pandora, mining the planet of all its precious minerals. The native population, big blue humanoids called the \"Na'vi,\" aren't too happy about this. The corporation has hired scientists to create avatars of Na'vi bodies to be controlled by human brains, in order to communicate to the Na'vi that...they better move, lest be bulldozed by the evil Col. Qautrich (Stephen Lang).Jake Sully (Sam Worthington) is flown in to Pandora because his twin brother, who had an Avatar made specifically for him, is dead. The coincidence is an obvious plot device so that we can have a newcomer to Pandora to share in our amazement. Oh, and he's paralyzed, so running around in his new alien body is rather freeing for him.I don't feel as if I need to continue with the plot description. You know what'll happen. You've seen \"Dances with Wolves\" and \"The Last Samurai.\" Heck, even \"Dead Man.\" The Na'vi represent nature, the (all-American) corporation represents destructive technology. Quatrich has a Southern accent and says things like, \"we have to fight terror with terror.\" The Na'vi are clones of Native Americans - filtered through the imagination of a white liberal. It's all very obvious.The question, of course, is whether or not it's entertaining. Well...sometimes. It certainly looks good. Some sequences - especially those with the winged beasts - are eye-popping. Lang makes a fun villain. Pandora is more derivative than original, it reminded me most of Skull Island in Peter Jackson's King Kong. All the monsters have a plastic-y look to them that make them feel too well-done. The 3D is distracting at times and I had a headache before the movie was over.But there are scenes and individual shots that pop with ethereal beauty. It's worth seeing for that reason, but I don't think it'll be as fun after multiple viewings. The great thing about \"Star Wars\" was the characters: Han Solo, Luke Skywalker, Princess Leia, R2-D2, Darth Vader, Obi-Wan Kenobi, Yoda and so on. They embodied the other-worldliness of the story, taking the weight off the effects.In thirty-two years, I don't think anyone will remember \"Jake Sully.\" 6/10",
            "data-review-id": ""
        },
        {
            "reviewer_name": "hutchinson_3",
            "reviewer_url": "/user/ur3278830/?ref_=tturv_usr_19_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "6",
            "short_review": "Visually amazing, but otherwise average at best",
            "full_review": "Yeah this movie took several steps forward in terms of cinematography and filming technology, but that is all that can really be said to be what makes this film worth seeing. Everything else that makes a film great is totally lack luster.There is no deep character development. Why does Jake Sully really want to become a part of the Navi? What was life on Earth like? What really makes him want to break away from his roots there? Is it just the ability to walk? I mean are there no more Native Americans or Buddhists left on Earth (which is clearly who the Navi were based off of) to give him that spiritual satisfaction? How does he feel about filling his brother's shoes? Twin relationship? The conflict between scientists and the military is not developed. Every supporting character was a stock character. Michelle Rodriguez somehow manages to have a place in Hollywood after literally playing the same type of character in every film she is in (Fast and the Furious, SWAT, Blue Crush...yeah just put her in a futuristic helicopter and thats her in this one). Was Sigourney Weaver supposed to be a mother figure? How did the bad guy from the Last of the Mohicans feel about faking a Native American language? The plot was totally predictable, and the dialogue was crap. It was like James Cameron turned in his dialogue assignment a day late.This movie deserves no award nominations at all outside of those in technical categories.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "miruleyall",
            "reviewer_url": "/user/ur18853862/?ref_=tturv_usr_20_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "8",
            "short_review": "Visually Spellbinding!",
            "full_review": "I am sure my comment will be lost in a sea of blue but anyways here goes...Just attended the Advanced Screening at my local \"Event Cinema\" BCC in 3DNow this movies graphics are gorgeous, everything is so real, the 3D just adds to the effect beautifully without distracting you.From a technical standpoint this movie is amazing, just the detail on the Navi's faces are amazing, they feel more real then their real life counterparts!Without giving anything away about the story, the plot itself is very solid, very character driven and perfectly executed by Jim, safe to say this is his best original story since \"The Terminator\" and \"Terminator 2\" and is definitely one of his best movies, so good it ties with T2 which is my most favorite movie of all time...So for those of you who have not seen this yet... WHAT ARE YOU WAITING FOR?!5/5",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Bart_Mancuso",
            "reviewer_url": "/user/ur9034138/?ref_=tturv_usr_21_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "1",
            "short_review": "This movie made me feel blue",
            "data-review-id": ""
        },
        {
            "reviewer_name": "bob the moo",
            "reviewer_url": "/user/ur1002035/?ref_=tturv_usr_22_t",
            "review_date": "Mar 1, 2010",
            "full_review": "Although I was not too bothered about seeing Avatar as a film, I felt it was a bit foolish to let this milestone of cinema go past me – particularly when the thing it is hyped for are the effects and being the first \"big\" film to utilise 3D technology to this degree. It just seemed that watching it on my TV in about 9 months on DVD with a basic stereo system would be missing the point. Unsurprisingly I was right because Avatar is technically a brilliant film that deserves to sweep the Oscars in terms of awards for visual effects and other such categories.If we ignore the 3D for a minute, the actual effects look great and I imagine that it will still be impressive in 2D. The landscapes and world of Pandora are imaginative (ironic since how dumb the name of it is) and very vividly created to the point where you forget that they are effects when you step back from them. Likewise it is so easy to forget that the Na'vi are not actors in quite brilliant outfits and makeup because they look so real and move so naturally – it is a million miles from the films such as Spiderman or Indy 4 where you can see where the real person ends and the jumping/swinging special effect begin. There were points in the film where I found myself wondering how on earth they managed to get a particular shot and where the camera was, only for my brain to kick in a second later to remind me that what I'm seeing is entirely virtual. OK the fantastical visual aspects are clearly creations but I was startled by how accepting of it all was and, in 2D I thought that the effects were pretty seamless.In 3D it doesn't quite hit the same mark for me. The \"look it's in 3D\" shots are not as obvious as some of the other films (where stuff comes out of the screen for no reason) but it is still a little distracting when the 3D forces your focus or has stuff where it doesn't aid the scene. Of course the world of Pandora looks great with things moving around in front of you and the final battle sequences are great – the money is all there to be seen. Thing is, the reason I was able to think about \"how did they do that shot\" while watching the film is because the technical aspects of the film is really all there is to engage with. The plot is basic and obvious – others have talked at length about the rights and wrongs of a story where the white man comes to the aid of the indigenous people, so I'll not add to that debate. The problem for me is simpler than that, it is simply that the plot is weak and the script is just as weak. My girlfriend laughed out loud when the name of the mineral on Pandora was named as \"Unobtainium\" and there were plenty of things like this. The dialogue between the characters is full of needless plot exposition and thus doesn't ring true. Of course all this is helped by the action and the effects but the narrative and writing weaknesses are all I can think of when I have to listen to people tell me how Avatar is the best film ever.The cast manage to do solid jobs considering how easy it is for them to get lost in the effects (see the modern Star Wars films to see this happen). Worthington is stuck with some awful dialogue but he is a good presence even in his Avatar. Saldana's performance is good, again despite some of her expressions and dialogue. Weaver is \"so-so\", Moore is pointless, Ribisi is miscast in a character that is so clichéd that it needed a decent casting to make it be more than it was. I liked Lang a lot and his OTT badass character worked well. Rodriguez seems like she is there because someone important likes her and her character doesn't add a terrible lot. Voice work from Studi, Pounder and others is good.Overall Avatar deserves to be seen for its technical importance and how impressive it is but the degree of praise for it needs to be put in context by considering how it plays as more than just a special effects milestone. In these terms it is not as good due to a poor plot and script that hurts the actors more than the effects do by handing them some awful dialogue. That it works is testament to how impressive the effects are but there is not a terrible lot to gush about beyond these.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Radio-1s_Mr-MovieMad-Ami_104-1FM",
            "reviewer_url": "/user/ur77586437/?ref_=tturv_usr_23_t",
            "review_date": "Sep 22, 2019",
            "rating_value": "10",
            "short_review": "\" FI ( LM ) NOMENAL \" 💎 💎❗❗❗",
            "full_review": "A { - M I C R O - } REVIEW .I just { R E }-watched this film on DVD ...{ YES, believe it or not, some of us STILL like to do that ⭐❗}.. at home with my family the other night. I'm pretty darn sure that I'd watched it ATLEAST twice ( if not an outright THREE times ) ...just AS SOON AS it was released a whole D E C A D E ⭐ ago....... WAY, WAY, WAY back in December 2009 .I am ENTIRELY-aware that I'll be { TRULY :P } lucky if EVEN FIVE PEOPLE read this review, given the aforementioned, above fact. { THE REASON ⭐ } ..I'M writing this review is to get, ( say ), THREE of the \"5 of you\" who M A Y JUST ~ ( & this is ENTIRELY possible ) ~ N O T have seen it... Y E T . . to watch it . { YES , S T I L L❗} .... it is truly a \" TIMELESS \" . . . . M A S T E R P I E C E 🌠 .If you come to the film with an OPEN HEART & AN OPEN MIND, then I can unequivocally promise.... this \"truly LAVISH\" visual & metaphysical extravaganza will well & truly set your SOUL ON FIRE 🔥 🔥 { in the Good Sense, of course }. If you thought that the CGI & SPFX of \" T I T A N I C ❤ \" were just.. { - W - A - Y - } Ahead of their time, for circa 1997 ; then Trust Me . . . . . THIS TOPS EVEN { - T - H - A - T ⭐ - } VERITABLE CINEMATIC \"COLOSSUS\", believe -it-or-DON'T .A LAVISH, \"CELESTIAL\", NO-REGRETS 25 MARKS OUT OF 10 💥❗❗.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "goldeneyeonline",
            "reviewer_url": "/user/ur22572201/?ref_=tturv_usr_24_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "9",
            "short_review": "Masterpiece for eye and soul...",
            "full_review": "This movie actually blew my mind! I have to admit that it's quite easy to impress me, but when i left the cinema I was just amazed by the feelings this film left. First of all to say is that the visual effects and the whole setting of this movie is absolutely unique yet and will be for a few years still, I think. The Sorrounding on \"Pandora\" doesn't let you breathe for several minutes in which you just cannot close your mouth. But this is NOT what makes this movie unique and so awesome! The story is really a great part of it, and gives the film its spirit. OK, it IS predictable, but many tiny parts that are unexpected just give it the suspense it needs. This is no \"switch off your brain\"-movie!!!In my opinion this film is worth 9-10 stars, I'm giving 10 for the goose-flesh it still gives me every time I see the trailer or hear the soundtrack. This evening I'm gonna watch it again :-)PS: Sorry for my bad English, I'm from Germany...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "canuck15",
            "reviewer_url": "/user/ur22600186/?ref_=tturv_usr_25_t",
            "review_date": "Dec 27, 2009",
            "rating_value": "10",
            "short_review": "Escapism at it's best",
            "full_review": "Just go! The people who made this movie, most of which are just average working people making a normal salary deserve it for what they have created. This movie accomplishes what most people go to movies for. To escape from reality for a little while.Not only is this what I consider a milestone in the evolution of state of the art movie making, it's a good story with a simple message.A bit annoyed at some of the criticisms. I don't see anything political in the metaphorical message this movie presents. If Republicans hate the idea that getting close to nature is good and war is bad then too bad so sad for them! There is only 1 directly political reference to Bush. That is when the military offensive is referred to as a \"shock and awe\" campaign. If people are going to get their panties in a bunch over that then again, sucks to be them! Also don't understand the criticisms about the similarity to Dances with Wolves. Dances with Wolves was not a unique idea. Modern society has been screwing over aboriginals for centuries. What is so bad in pointing that out once in awhile in a way that most people can relate to? By seeing it through the eyes of someone from this modern world.I loved every minute of this movie. There were a couple tiny teeny little things in the dialog I would have done differently but no matter how you slice it, this is a masterpiece!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "vjlbym",
            "reviewer_url": "/user/ur22575297/?ref_=tturv_usr_26_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "10",
            "short_review": "I watched it twice within 24 hours!",
            "full_review": "Never before have I felt the need to express my views about a movie online except when I saw Lord of the Rings for the first time.Let's get it straight- the ONLY thing ordinary about Avatar is its screenplay. It's not bad, just ordinary. Story is clichéd, but very relevant. Everything else about the movie is just out of the world, literally! This is not a movie like Pulp Fiction or Fight Club. It doesn't require intelligence to understand the plot. But seriously, who cares? The visuals are so stunning and wonderful that you are sucked into Pandora. You feel like you are living on Pandora and watching the actors over their shoulders. This is where 3D filming has been put to great use in this movie. I can only speak for myself but I related to the characters so well that I was almost emotionally attached to them an hour into the movie.The two main messages of the story are environmentalism and peace. Both of them are extremely relevant today. But then again, the purpose of this movie is not just to carry those messages across. It's to show a completely different world in stunning detail and to let the viewers relate that world to our own. To me, it talks also about fighting injustice, even if it is perpetuated by \"your own\" people. The biological theory of connections between all the living things on the planet was pretty cool and is truly, the worldwide web.The acting doesn't stand out as mind-blowing but blame it not on the actors, but the visuals. James Horner, as always, delivers with the music. It is so inextricably linked to the scenes that you probably won't be able to imagine enjoying the movie without it. Special effects, needless to say, are outstanding! CGI on this scale for hundreds of characters is no mean task. Dialogs, as I mentioned before, are not extra-ordinary but then again, you don't expect a marine to be Shakespeare in his linguistic articulation. They definitely fit in with the plot.This definitely is another milestone in movie-making and will definitely spawn a lot more special-effects filled movies. All in all, the movie rises above others of its class for the way in which this rather simple-minded story is told. I still can't stop playing through the scenes in my mind. Go watch it and let go of your worries and live in Pandora for 166 minutes and trust me, it's a wonderful life!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "suckerdwsp316",
            "reviewer_url": "/user/ur2372821/?ref_=tturv_usr_27_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "6",
            "short_review": "There is So Much to Say About James Cameron's AVATAR",
            "full_review": "I'm not sure where to begin with James Cameron's Avatar. I could start by saying I've been waiting 12 years for this film. I could start by saying Terminator 2 is my all time favorite movie, and I've watched it a thousand times since I was a kid. But I'm going to start with the most positive thing I could say. James Cameron is a special filmmaker. He revolutionized film-making in the 1980s with The Terminator and Aliens. He did it again in the 1990s with Terminator 2 and Titanic. So after 12 years of anticipation and hype, and all the reports of the record budget being somewhere between a mind-boggling $300 and $500 million, I expected Avatar to be the greatest thing since sliced bread.And sadly, it wasn't. Not even close. I will admit that the visuals in the film were stunning, and sometimes made you feel like you were dreaming. Cameron has definitely spent his time wisely creating a new universe all his own, and inventing a totally new world, one that leaves us in awe. However, for a filmmaker like Cameron, the whole IMAX 3D element of the film really wore on me. After a while, I couldn't wait to take off those uncomfortable glasses which helps us \"see\" the stunning visuals, as Cameron wants us to, which are quite nauseating, particularly for a movie that is almost three hours in length. I've never seen a film in 3D or IMAX before, so I wasn't sure what to expect. But now that I've seen it, it begs the question, why? Hey Jimmy, you're James frickin' Cameron! You don't need 3D to make good movies, man! I feel like 3D is like cheating on a test that you've studied for your entire life. Why is Cameron trying to overcompensate for no reason? He can make superb films without any of this IMAX 3D CGI stuff.As for the plot, well there is none. Avatar essentially features no plot, or story, other than the typical love angle, which can only be classified as being beyond cheesy. If there is a \"story\", you've seen and heard it many times before. A man sent in to infiltrate a band of aliens grows close to their ways and in the end turns against his own kind when the two sides battle each other out. You've seen it in Dances With Wolves, you've seen it in The Last Samurai, hell, I could even go all the way back to 1956 and cite John Ford's The Searchers as a movie which features characters who are pulled into another society or world only to become one of them. Now, before you go and crucify me and say \"well every movie can be traced back to something else\", which is true, you need to understand that James Cameron is a trend-setter. HE is the one that makes the most refreshing movies, HE is the one that everyone else copies. HE doesn't need to copy anyone else. HE used to create films with creative plots and likable characters, but there's nobody to like in Avatar. After all, it's not easy to relate to a CGI-made 10 foot tall blue alien.I really expected more out of this film. The graphics were amazing, sometimes. Other times, it was just migraine-inducing. I wanted something to happen. And nothing really happened. Cameron could have made one of the all time great films if he had just put some more thought into it, and created a good story, with fleshed out characters, and a climax that doesn't come off as being a thoughtless, cookie-cutter finale. Armed with a budget of this enormity, and over a decade between narrative films, you'd think \"the king of the world\" would have come up with a better movie.But I do think people will love most of the visuals, I certainly did. But after nearly three hours, it suddenly dawns on you, \"is there anything else to this movie?\" Because while staring at the Mona Lisa is a very thought provoking thing to do, eventually, you move on! And that's what this film felt like. A beautiful painting come to life, but one that eventually gets tired and predictable. Sadly, and despite what most of people will say, because they loved the visuals and have never seen anything like it, James Cameron's Avatar was extremely disappointing and I'm not sure if I'll ever forget this kind of disappointment for a long, long time.I still love Terminator 2, and I still love James Cameron. But I feel like I've been waiting through a 12 year war for my loved one to return, only to see them come back a completely different person, one whom I simply don't know and can't trust anymore. Take this for what it is, an honest review from ONE viewer. Most will not be in favor of my thoughts, because it's not overly positive. But it is what it is. Avatar is not exactly a movie. It is something else. A $400 million cartoon perhaps. Or a $400 million live-action video game. It will probably be copied a million times over the course of the upcoming decade though. Maybe, hopefully, by the end of it, Cameron will return to making movies with real people again. Maybe then, everyone will copy him once more, and all movies will go back to being about real people again. I think that's something that we all want deep down inside, but, for some reason... we just won't admit it.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "nofoodu",
            "reviewer_url": "/user/ur22618335/?ref_=tturv_usr_28_t",
            "review_date": "Dec 30, 2009",
            "rating_value": "10",
            "short_review": "Its too god to be true",
            "full_review": "Avatar was probably the greatest movie i have ever seen in my life. The special effects were jaw-dropping, and i didn't even see the movie in 3-D. But i will go see it for the 3rd time this week, in Imax 3-D.The emotions displayed on the characters faces were incredibly detailed, especially Neytiri. It all looked so real. If i didn't know better, i would of said that they just went to a distant planet and filmed aliens. It looked so real... This was probably the first movie that i actually was disappointed that it ended. i really wanted it to never end. The flying scenes were incredible, and the scenes when the humans interact with the Na'Vi were flawless.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "willandthomas-picturehou",
            "reviewer_url": "/user/ur16596626/?ref_=tturv_usr_29_t",
            "review_date": "Feb 8, 2010",
            "rating_value": "7",
            "short_review": "7 For Chutzpah",
            "full_review": "You put your glasses on and you're in. A feast for the eyes at least for the first hour. The brain, however, remains asleep. How strange that such an ambitious enterprise could ignore its most important aspect, the story. A rehash of other things with dialogues from a high school play. Also, very self referential. The bitch! from Aliens truly omnipresent. I was surprised Sam Worthington didn't say \"I think I've seen an iceberg\" or maybe he did say it while I conceded myself a little nap - after the second hour - So here we are, facing a film future in 3D\" I will, still, long for characters in movies, people I can, not just relate, but be inspired by, thought provoking and all the rest that goes with it. So, Cameron did it again and if money is at the center of the world, he remains \"king of the world\"",
            "data-review-id": ""
        },
        {
            "reviewer_name": "JoshuaParis",
            "reviewer_url": "/user/ur22709325/?ref_=tturv_usr_30_t",
            "review_date": "Jan 19, 2010",
            "rating_value": "8",
            "short_review": "Welcome to Pandora",
            "full_review": "It's been 12 years since we last saw James Cameron's visionary directing on the big screen. He previously graced Our Cinemas with the Likes of The Terminator, Aliens and the rather popular titanic. The latter went on to gross more than 1.8 billion dollars worldwide and bag 11 Oscar's. Now he's back with another epic, Avatar. It's been 12 years in the making, now it is being realised in glorious 3-D.The story is set hundreds of years from today on the distant moon of Pandora. The planets a lush, vivid place full of beautiful and deadly creatures. The population that inhabit this planet are the Na'vi, they are big, very fast and athletic with a knack for not taking the humans lightly. The film centres on Jake sully (Sam Worthington) a paraplegic marine who is offered a second chance at being a soldier. He is asked to fill in his recently deceased brother's boots and head to Pandora. The First thing you will notice about this film is that it looks incredible. Every single blade of grass has been fully detailed. The motion capture technology brings the Na'vi to life, with every emotion being realised. This is truly from a visionary point of view, a work of art.You are transported to the Moon of Pandora and it's a marvel if you are seeing it in 3-D, as intended. You are then introduced to the main characters of the film. First you meet the rather joyful and impressive colonel Quaritch (Stephen Lang) He gives a stand out performance as a stereotypical American Grunt, a rather over used cliché by the Canadian director. You are then introduced to Dr. Grace Augustine (Sigourney Weaver) who has affection for the Na'vi, and looking for a way back into the indigenous population's community.You will notice through the film that there are many references to James Cameron's previous work Aliens. There are a few small similarities' and one big, Aliens is arguably Cameron's best work, so it's not a negative. The role of Parker Selfridge (Giovanni Ribisi) will remind you of Carter Burke, the slimy all business Executive from Aliens. The score by James Horner, who also worked with Cameron on the 1986 hit leaves a familiar taste in your mouth. Cameron originally wanted Michael Biehn to play the role of Quaritch but thought the audience would get confused as Sigourney Weaver is also in the movie.The introduction of neytiri (Zoe Saldana) is powerful and exciting, You get the impression that she knows how to handle herself, This is a trait of all Jim Cameron's heroines. She introduces us to the Na'vi culture, and in the process, we start to care for and understand the advanced race.The film flows well; it can drag at times, especially in the middle act of the film. This could have been improved with an extra RDA encounter, to further mount the tension between the Na'vi and the inpatient humans. The Action in the film is amazing, real hard hitting stuff. But it is in no way mindless. Every scene of action has been carefully crafted, by the trusty hands and eyes of James Cameron, Who has a knack for getting the audiences, pulse racing. The final battle lasts around 40 minutes long and it is defiantly a sight to be seen.Final Thought's: On a technical level the film is a triumph with moments of wonder, the action is top notch to boot. The script and story can let it down at points, but that is no reason not to see the movie.Avatar is like a beautiful painting. What you see is what you get, and what you get is nothing short of epic.A moment of brilliance: The final battle scene is as good as they come. The last time you had Goosebumps like this, was when a well known farm boy, destroyed a death star.Reviewer: Joshua Roberts",
            "data-review-id": ""
        },
        {
            "reviewer_name": "in_chainsagain",
            "reviewer_url": "/user/ur3929021/?ref_=tturv_usr_31_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "6",
            "short_review": "Masterpiece or Pocahontas in Space?",
            "full_review": "It's movies like this that are a reminder that story should always be the number one priority when making a movie. The amount of clichés at multiple phases in the movie is unbelievable. It would be too easy to point out obvious and rather blatant rip offs that occur throughout (going into a misunderstood tribal group, sacred trees, being in tune with nature). After all I was almost shocked I didn't see the writers of the Disney version of Pocahontas credited as assistant writers.After saying this, I have to give credit where credit is due. James Cameron's vision for film making is unmatched by anyone. The visuals are outstanding; entertaining and saved me from regretting laying down the extra two dollars to see this film in 3-D (it's not worth it to see the regular version). It is obvious that Cameron has unparallel dedication and drive to make a film that people will want to see. This same dedication and drive made him want to handle writing this one himself. Few posses the power to demand the type of budget that Cameron can and it's obvious this film could not have been made without a substantial budget. If you would have combined this new ground breaking and visually stunning technology, with an equally moving and unique script then that's the movie I want to see.Am I disappointed I invested 162 minutes and $10.50 into this movie? No. The visual themselves are worth the price. But at points you will be nauseated, you will roll your eyes, and will ask the question: Why does Hollywood not think we can handle a good story anymore?",
            "data-review-id": ""
        },
        {
            "reviewer_name": "tomskaal",
            "reviewer_url": "/user/ur20287260/?ref_=tturv_usr_32_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "1",
            "short_review": "Extremely predictable and very unoriginal!!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "moonscore",
            "reviewer_url": "/user/ur3479888/?ref_=tturv_usr_33_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "A spectacle for our time, for all time...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "pippin_evil_genius",
            "reviewer_url": "/user/ur7626893/?ref_=tturv_usr_34_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "10",
            "short_review": "Avatar: Once in a lifetime film making",
            "full_review": "James Cameron is one of the best directors of all time. He is what you may call an Auteur. If you aren't aware of this, then you probably are not a movie person. James Cameron wrote and directed Terminator, Aliens, Terminator 2, and Titanic. That last one I'm not a fan of, but he won Best Director, Picture, and it became the highest grossing film of all time. $1.2 billion dollars.Avatar is his latest film, it is a movie that has been in the works since 1994. After a decade of being in the works, you would expect it to be a good movie. But the real question is it any good? It is the most expensive film ever made. The budget was $500,000,000 so you'll be wondering if all that money was put to good use, and if you should spend $11.00 to see the film in 3-D. Should you or should you not?The answer is that you should. Avatar is a monumental success. It is a film unlike anything you have ever seen. It uses special effects to a level that you have never seen, and that's not a bad thing.The story to Avatar revolves around Jake Sully, a paraplegic ex-marine who is sent unwillingly to a hostile planet known as Pandora. While on this planet he finds himself caught in the middle of a war between the planet's indigenous people known as the Na'vi, and his own race. He must decide whether he should fight for what he knows is right or help his own people destroy Pandora as they destroyed earth. I don't want to spoil anything in the story, so I'll refrain from saying anything else. To put it simple, the whole movie was the prime example of a colonialism work.The cast in Avatar is strong. Sam Worthington (Terminator: Salvation) stars as Jake Sully. He does a fantastic job, but the real credit in the film has to go to Zoe Saldana (Star Trek) for playing the native Neytiri. She creates most of the emotion in the entire film. She preforms fantastically and I also have to mention that she is also really attractive as a blue woman. (True fact.) Some people have complained about Stephen Lang (Public Enemies) as the antagonist of the film. But he actually pulls off a very believable and cruel performance. All the actors in the film are great. But the real actors are the ones that are the digital Na'vi. These actors are the ones that create the film. I think that this movie is proof that special effects don't have to be of just robots killing and blowing stuff up. (Even though that's in this movie.) This movie shows that special effects can be used to take us to places that we never even dreamed of.Other films have used special effects like this. (Lord of the Rings, King Kong, Pirates of the Caribbean, District 9) But none of them have gone as far as this movie has. This movie takes you to a whole new level of film making that you can't even imagine. You almost want to call this movie insane, because of how different and unique it is. You really have never seen anything like this, and that's a very good thing. What I really enjoyed about this film, was how it is a breath of fresh air. You don't see that very often. The only other films to do that this year for me were District 9 and Fantastic Mr. Fox. But Avatar is far more different and unique than these other movies.One thing that I always enjoy about a James Cameron film is his sense of innovation. Avatar is the most innovative movie I've seen in years. It is so different from anything else that you have seen. It is a movie a film that you literally cannot describe. This is a see to believe film. You'll have to see the movie to believe that it's as good as I'm telling you. Avatar is a once in a lifetime film. You will not get another chance to see a movie like this one.James Cameron creates not only a visually beautiful race of people, but also a culture that is so beautiful. The Na'vi in Avatar felt very Native American to me. Everything from how they dress to the musical score is very unique, and made me think of Native Americans. The film was almost like a reenactment of our history, with the Native Americans being driven out of their home land. It's all very believable. It's all very sad as well; and it moves you. I sympathize with the Na'vi as they fight for their lives and their home.I am not a fan of 3D. I think it is over used, and ultimately lessens the movie experience. Avatar however, is not like that. The 3D in Avatar is extraordinary. Little bugs on the screen fly right past you, leaves fall from trees towards you, and the battles are astronomical. You really feel like you're there, and forget that this is a movie. The cinematography is actually enhanced by the 3D which is a rare thing. The wide flying camera shots make you feel like you're flying with the film, it is fantastic.Avatar is a difficult movie to review because it is so innovative. It blows away almost all sci-fi epics out there, and is a must see. See Avatar. It is well worth full-price, and it is the best picture of the year. The only movie that comes to being as good as Avatar is District 9. Avatar however, I will say is better because Avatar has heart. A truly fantastic movie. Avatar is one of the most beautiful movies ever made, it is James Cameron's masterpiece, and it should not be missed.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ithmaril",
            "reviewer_url": "/user/ur5441645/?ref_=tturv_usr_35_t",
            "review_date": "Dec 17, 2009",
            "rating_value": "10",
            "short_review": "It feels so good to be a fanboy again.",
            "full_review": "I did my best to keep the expectations low, but it didn't quite work out. I mean, it's a movie directed by James Cameron, featuring sassy badass Space Marines, evil corporations, power armor, and Sigourney Weaver. That's the closest I'll ever get to a direct Aliens sequel, definitely one of my top 5 movies of all time and inspiration of countless wet military sci-fi dreams.On the other hand, although trying to stay spoiler-free, I kinda did expect something that would turn me off on a certain levels, hearing things about \"dances with wolves\" in space and a straight green message, delivered in black and white, without the necessary shades of grey in between. Don't get me wrong, I'm all for saving the planet and respecting the natives, but I like my messages delivered in a subtle way that makes me care, instead of the sledgehammer-in-your-face method. See \"the day the earth stood still\" remake. Bah, humbug.Third point: My first movie in 3d. Wasn't sure how it would work out for me with my glasses, and if it would enhance or distract from the experience. Really, I had no clue.So. here's a spoiler-free, very personal summary of what I think: Go. See. That. Movie.In a nutshell: It's flawed, but for me, a flawless experience. It's extremely CGI-heavy (something I couldn't be more sceptic about), but it's CGI you buy into. The designs, the human characters, the animated characters, there's just... chemistry. The illusion is there and makes you overlook the obvious. The plot is predictable, but it didn't give me time to predict, because it gripped me and didn't let me go. See, a movie can have the most blatant story, the question is how it is delivered by the people involved, from the actors to the director. That's the theory, and I was always sceptic of such gibberish. But boy, it was delivered, straight to my inner child, on a silver plate full of awesome. It immersed me. It worked. I was in awe. I was in tears. I was cheering. The whole premise, the parallels to our history, the message, the love story, it's all naive. And I'm so glad that it just shut the **** up that cynic in me in the most elegant way for three hours and made me naive and open for the beauty and wit and wonder in it. I didn't think I was still capable of that, but I watched that movie with the wide, blue eyes of a fourteen year old, enjoying a thrilling, heartbreaking mix of \"ALIENS\" and \"E.T.\".Also, sh** blows up really good.See, the Star Wars prequels were something that should have been just that. Instead, I was pulled out of it and shaking my head all over the place. I was pulled out by wooden, badly-directed actors acting confused in front of too much blue screen. I was pulled out by half-assed cartoony CGI characters. By video game sequences of unbelievable combat and plot holes as big as a small moon.And here's the movie where it's all so flawless, human and elegant- characters, effects, delivery- that I gladly overlook its faults and enjoy it for what makes it awesome. Here's the spiritual successor of the movies I grew up with and loved, that just left me dreaming. Suddenly I remember how it was to watch 1977's Star Wars for the very first time. Grinning, crying, cheering and clapping.This is it. But don't listen to me, I'm being a biased fanboy here.See? It managed to make me a biased fanboy. Nothing has done that in a decade. And it feels so good!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "petr-42",
            "reviewer_url": "/user/ur16329412/?ref_=tturv_usr_36_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "10",
            "short_review": "King of the world?... No! .... Master of the universe!",
            "full_review": "Simple as that :-) This movie is more than most of you think. It has the message. Cameron has certainly done his homework.Have you ever heard of Gaia theory - living spirit of the planet (so it is not some dead rock as some of you may think) Or what about the theory of the Akashi field? You have it here. If your soul is evolved sufficiently, you'll feel this movie.What i find absolutely brilliant are not just the spellbinding effects or the depths of the story but the SIMPLICITY that is ingenious.The most simple thing done in the right way can have the deepest effect on you and Cameron did that with this movie (and just the line \"I see you\" in the movie is a proof how brilliant and ingenious this movie is)A milestone of the movie-making - and the message for the grabbing hands among us",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Quinoa1984",
            "reviewer_url": "/user/ur0453068/?ref_=tturv_usr_37_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "6",
            "short_review": "Mr so-called \"King of the World\" returns with a visually dazzling spectacle and so-so story",
            "full_review": "James Cameron has big ideas and big visions. Thankfully, the latter he dives into with a lust for cinematic glory and (with more money than some countries have in an entire year) he has made his vision of a planet called Pandora in the year 21-something something of a real wonder. If only his big ideas weren't, for the most part, cribbed from other movies and stories and archetypes. I would be reminded of Joseph Campbell's myth-buster formula that so many have taken to heart in adventure movies, but Cameron's formula would appear to come second to his attention to visual detail. This has its pros and cons, some more or some less depending on what viewer sees/hears in it all.It is ambitious, and quite expensive, and it all shows up on the screen. It has to be said, Avatar is absorbing to look at. So much time and energy was spent into creating this fictional alien species, the Na'vi, and it pays off in the respect that Cameron's visual fx team painstakingly makes it appear real and otherworldly at the same time. We might recognize the lush and green surroundings, or even some of the trippy creatures, and if it comes close to anything it's like Ferngully: The Last Rainforest squared and made semi-pre-historic. But it's the scope and grandeur, and when we see the Na'Vi in close-ups or even just far away, you can see the sweat and the detail in their faces, the human beings playing them projecting off the screen. I forgot, if only for a few moments at a time, that they were animated and done in motion-capture. If part of a filmmaker's job, in a situation like a super-mega-sci-fi epic is to make us believe in another world and place (even if it's familiar), then Cameron has done his job very admirably.So if Pandora is great to look at (especially in the practically prerequisite 3D, which also has its own levels of detail and nuance and doesn't just JUMP at a viewer), and if the technology shown on screen- of how a human being goes into an avatar, is fascinating, then why isn't it such a smash all around? Simple - the story, and the characters. Cameron does pay them attention, but only inasmuch as to get us going into the Pandora environment. When he has characters like Jake Sully (very good Sam Worthington) and Neytiri (Zoe Saldana, even better) saying such trite dialog and going through the motions of a story that is familiar to anyone who has seen Ferngully or Dances with Wolves or, to a lessor extent, Last Samurai or New World (super pro-environment, obvious anti-colonialist), it starts to drag the film with it. I never grew tired of the cinematography or the wonderful sights on Pandora, but could I have done without such one-dimensional gritting-of-teeth from Stephen Lang? Absolutely.I'm not sure if there should be more movies like Avatar. It takes a filmmaker with the ambition and drive, and the super-screw-you-guys clout that James Cameron has with such a project (not to mention the time for it allotted him - not since Kubrick has a filmmaker taken so long between projects), to pull off something like this. CGI-driven movies could progress thanks to the prowess displayed here, but it does need to be done with the right frame of attitude towards the story. Even if such story is formulaic as this one, a filmmaker does need to try and push the technology a little further while also not forgetting about the human element. Cameron comes close... no, he does go over the brink of doing style over substance, but for this case- and maybe just this one time from an otherwise masterful blockbuster director- it's satisfying.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "URBestFriend4Ever1",
            "reviewer_url": "/user/ur5177230/?ref_=tturv_usr_38_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "10",
            "short_review": "Avatar is a Cinematic Experience !",
            "full_review": "welcome back, James Cameron, One thing is Sure Avatar will break previous ,the all-time box-office Titanic ...The special effects in the movie is Byond Imagination, and Cameron showed us how to use them. Many of them he invented himself! The love story of Jake and Neytiri also really touching one,plot which featured the conflict between two species, namely the Na'vi of Pandora ..Humans tendency is exploit everything ...its resembles Spanish settlers European atrocities against red Indian's Native Americans comparison between human vs navi .Avatar's origins, however, come from the Sanskrit language Oldest Language in the World in sacred Hindu texts, and Avatar it's a term for divine beings sent to restore goodness to Earth.It is believed that these deities sent avatars — incarnations of themselves in human form — to perform \"dharma,\" or righteous duty, to right wrongs or to restore peace and goodness.And James Cameroon used Blue color which is similar to Hindu god Vishu and avatar Ram,Lord Krsna ! Star Wars,Matrix Trilogy all those Sci-Fi Movies where based on Eastern Philosophy Hinduism & Metaphysics .'Avatar' i epic adventure Above all its fun to watch along with a crowd in theater and not at home .!! It was outstanding,unique,superb,unparalleled and keeps the audience spell-bound even after movie ends.Avatar is a cinematic experience and an event, not a mere film it is Magic only James Cameroon can deliver.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "zuma777",
            "reviewer_url": "/user/ur20274624/?ref_=tturv_usr_40_t",
            "review_date": "Jan 4, 2010",
            "rating_value": "7",
            "short_review": "Thank You Mr. Cameron",
            "data-review-id": ""
        },
        {
            "reviewer_name": "rettercritical",
            "reviewer_url": "/user/ur10427060/?ref_=tturv_usr_41_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "10",
            "short_review": "AVATAR has a soul",
            "full_review": "AVATAR has a soul I saw AVATAR today. It was a boiling 40 degrees Celsius in Australia. I caught a bus and train to get there. I spent months on a forum before that. Incremental stops included a scriptment, stills, a teaser, a foot, AVATAR day and a full trailer. Now released I have had many reviews to read which have been mostly very positive. It is a marvel to watch. The opening scenes are very sci-fi with a glimpse of low gravity aboard a space-craft. Sam Worthington fills us in with a short narration. He is taking over his diseased brother's role in the AVATAR program. These opening scenes are actually among the most effective 3D in the film, pulling you into this story, tracking shots putting you into the steps of the characters. I jump ahead, like the film, to The world of Pandora which is lush with earthly life as seen through pulp fantasies. The rendering of this world is terrific. The life and activity is in the plants as much as it is the animals. Wonder is generated with this ambitious creation. Cameron has lifted the bar. The CG is the best I have ever seen. Everything you have heard is true. The 3D enhances this with leaves falling and swaying branches life-like in the foreground. The realisation of the Navii is also ambitious. They are CG but there are many moments that make you think they are real and in terms of the story they are more than good enough to propel the narrative with strong emotional content. I went into this film knowing mostly everything within it. Hours of reading, some from the treatment and pages of the recent reviews. It is very much a family film like \"Nealz\" said in his IMDb review. There is a moment where one of the ferocious animal species that earlier were attacking Jake are seen with a litter, the children in the audience loved the cute pups! The spiritual side of this film is much better than expected. It is in fact a beautiful story. The structure is classical film-making but with amazingly new scope in CGI to express grand images. An epic The journey that Jake takes through Pandora is lovely. He is taken in by the Navii and explores their culture, language and habitat. Natirii, the female Navii he meets while lost, helps him through this journey. This is a love story of both soul mates and with a wider picture. Existential connections with the natural world. Personal destiny. I had tears in this film. I tried to hold them back but by the roll of credits they came. This is a movie that I have anticipated for so long. I think the ingredients of its story and my connection to this films production gave me a very emotional response. I cant imagine this disappointing any of the fans on the board. Keeping in mind that it is a family film but delivered everything I wanted. Expect a special edition. After AVATAR is a hit, a special edition will make its way to the cinema. I can understand why they would cut the earth scenes and it works. The actual film seems pretty brisk and it could also have more padding out. You want more of it and that is a triumph for this type of film running two and a half hours. It is a good balance because at two and a half hours AVATAR is aimed directly at the cinema going audience. Broadly appealing with elements for everyone. My earlier prediction of a billion or more world-wide seems safe. I don't want to go on about visuals too much but the lovely shots of the natural wonderland of glowing life in still 3D shots is magical. Something to take kids to see. Floating tiny neon life jellyfish their way through the air with grace. The monkey-like extra-limbed creatures with the peeping eyes flock through the forrest quickly. The creature design is done in a clever way with the motion of a living thing. The action is over the top, epic, frenetic and a new take on the battle sequence. James Cameron didn't stuff this up. He probably pressed the studio way beyond their comfort zone with the time, money and effort that has gone into this. Sam Worthington is excellent casting choice. Sigourney Weaver ads frank reason. Stephen Lang chews the scenery as the ultimate you know what. Zoe Saldana is beautiful as Jakes guide into this world and. I went to the cinema and it was a very hot day. By the time I left the cinema, the streets were wet with rain. A warm humidity was thick in the air. Lightning splashed my walk to the train station with white light. I honestly wondered if It was my time to be struck down with a bolt of electricity from the sky. Watch this film. It is destined to become a childhood classic to many little-ones too young to be on this forum. It will be talked about at high school by male and females as spectacular. It will be watched multiple times by fans. I loved it but beyond my appreciation for the film itself, is the the message of love permeating from this movie that I hope enters the zeitgeist like elements of Cameron's other stories have. At its heart is a soul. AVATAR is an achievement in many technical departments but I wouldn't say the story is deficient. It is a beautiful experience and the story is surprisingly what I loved most. Believe the hype.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "LumanoidAU",
            "reviewer_url": "/user/ur18553033/?ref_=tturv_usr_42_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "6",
            "short_review": "If you thought Jurrasic Park was your favorite childhood fantasy adventure film, then imagine how children today are going to feel about this!",
            "full_review": "AVATAR is the Jurassic Park of this generation, with no doubt is it a family film, but it is also a hybrid of everything good in Cameron.Firstly, The highly-talked about visuals have given me, and the audience a true experience, if that is counted by the number of gasps, claps and heartbeats of every audience member, I seriously didn't get that in Transformers or 2012, people literally gasped when Jake explored the Bio-Luminescence nightlife of Pandora, now that is something you don't usually get in films! But this film isn't just about visuals, it's about the magic of film-making. And that is something rarely achieved in such absolute beauty, beauty that leaves you walking away from the theater, wanting to return the next day, and the day after that. I have never felt so good after watching a movie, a movie that holds such beautiful magic, since the original star-wars trilogy came out back in the 70's and 80's.The film ends leaving you wanting more, it starts by slowly enticing you, then gradually building up into one heck of an adventure, rolling at such a speed that you'd never think it would end, but films end eventually, and I just hope that we are given more in the future, so seriously, enjoy the power of seeing it for the first-time, watch it with a fresh-mind, an empty bowl and zero distractions because the world of Pandora awaits, the trip of a lifetime to an alien world beyond your imagination!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "mlbstellar",
            "reviewer_url": "/user/ur22655468/?ref_=tturv_usr_43_t",
            "review_date": "Jan 5, 2010",
            "rating_value": "1",
            "short_review": "The Most Unoriginal Film of the Decade",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Ali-hi42",
            "reviewer_url": "/user/ur28919344/?ref_=tturv_usr_44_t",
            "review_date": "Jul 13, 2020",
            "rating_value": "10",
            "short_review": "11/10",
            "full_review": "If i may rate it 11 i will surely do. Can't wait for Avatar 2 at 2021",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Znukkas",
            "reviewer_url": "/user/ur11733401/?ref_=tturv_usr_45_t",
            "review_date": "Dec 18, 2022",
            "rating_value": "10",
            "short_review": "A mustsee masterpiece!",
            "full_review": "Avatar: The Way of the Water is visually breathtaking and entertaining. The storyline is original and only leave a want for more. The length of the film was no concern and needed for proper character development. The characters in the film were a good selection and made the film more enjoyable and watchable. The movie may be classified as scifi, but it meets the expectation of almost every genre. Like the first Avatar, this movie wil be my go to movie until the next Avatars come out. Both Avatar movies are deserving of the best movie title. Thank you, James Cameron, you did not disappoint. I look forward to the next installments.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "florianwebner-94771",
            "reviewer_url": "/user/ur152686370/?ref_=tturv_usr_46_t",
            "review_date": "Dec 19, 2022",
            "rating_value": "10",
            "short_review": "Just the best Cinema experience on this planet",
            "full_review": "The visuals and 3D are truly amazing. Some people spend Thousands for traveling to see beautiful landscapes and that's fine. But in the cinema we see the most beautiful world and the visuals are so good, one forgets being in a cinema. It feels like 3 hour trip to another planet. Some people say its boring, because the story is not unique. But that doesn't matter. A movie is a story and how the story is told is 100 times more important than the story itself. Every crime movie has same story: Someone dies -> detective identifies murderer. Yet we want to see HOW the detective does it.Actually I think, there are not so many different base stories and many movies are similar to each other. But Avatar has only one similar movie which is why people notice it.No one would complain about a crime movie: I know this story from this movie, and that movie, and that movie, and this one as well... Oh and this one and that one.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "jaykchan",
            "reviewer_url": "/user/ur16371618/?ref_=tturv_usr_47_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "10",
            "short_review": "Stunning visuals and an \"OK\" story!",
            "full_review": "Snapshot: Avatar is a \"visually stunning\" movie that captures your imagination with a pretty ordinary story that SOME might find triteWhy I LOVED IT?When people were first informed about Avatar NO ONE spoke about \"A Great Story\" or \"Wonderful and complex Characters\". Avatar was supposed to be a treat for the eye, a very imaginative and immersive world. Avatar exactly does that. I LOVED it because it delivers what it promised to!Why is it \"Ground Breaking\" and \"Stunning\"?Avatar totally blew me away in the visuals department. Now I know some people are saying that there are many movies that look more \"REAL\" and have better quality of animation than Avatar e.g. Final Fantasy, but I guess these people are missing the point. Avatar is actually about NOT looking real, it is about showing something that we have never seen or have never imagined (exotic creatures and floating mountains!!!). It is also about meticulous attention to details that we may actually never notice especially when we see the movie for the first time. So ultimately using fine details and imagination of some very creative artists a stunning and immersive world called \"Pandora\" has been created. What's NOT good? Avatar does not try to do anything new in the story line department. It's got a couple cheesy dialogues and just a touch predictable. It is the same old story told in a new way. But then how many movies that are made are really original today? From my perspective I even LIKED the story but some people with different taste, perspective and expectations might complaint!Who should watch it? I suggest EVERYONE, at least for \"Pandora\"Who should avoid it? NO ONE! HOWEVER if you are VERY RELUCTANT about \"ORIGINAL STORY\", \"GREAT CHARACTERS\" blah blah blah and just cannot get the message right then don't watch it, but then you will be missing something very special \"Trust me\" on this one!SummaryGo for the movie with the right expectations i.e. \"An imaginative and visually spectacular movie\" and put other things like a \"GREAT STORY\" aside. Avatar is everything what it promised to be and that is why I give it 10/10",
            "data-review-id": ""
        },
        {
            "reviewer_name": "0U",
            "reviewer_url": "/user/ur87850731/?ref_=tturv_usr_48_t",
            "review_date": "Feb 23, 2020",
            "full_review": "Avatar tells a familiar story but its a story that works so well inside of this movie. The visuals and 3d are still one of the best to date and i totally get why it made so much money.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "CihanVercan",
            "reviewer_url": "/user/ur19658928/?ref_=tturv_usr_49_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "7",
            "short_review": "Putting perfect Visuals and Virtualities aside, going deep into the Avatar's concept",
            "full_review": "Looking into Hindu mythology, when Gods descend to Earth they acquire avatars to make themselves known by human beings. Of the recent years' TV animation series let's look over \"Ōban Star-Racers\" from Jetix and \"The Last Airbender\" from Nickelodeon for avatar concept. In Ōban Star-Racers, the Earth had been threatening by antagonist galactic races and human beings were expecting a savior from space who is called the Avatar. On the other hand in the Last Airbender, avatar concept was completely confused with Prophecy. Aang the Avatar was born in the form of human being, which is wrong; because Avatar is a form of a God which has no destiny, no life, no death. Herein James Cameron's Avatar, the concept is truly appropriate to the origins of Hindu mythology: When humankind explores the planet Pandora, they aimed to search for underground resources; so they send an ex-serviceman to the natives in a DNA mapped hybrid body(which seems like one of them) to capture their secrets. Becoming the Avatar of natives by time, the ex-serviceman saves the planet from humankind, turning against his origin. Exploring a new planet, descending on the ground, trying to capture it by blending within natives, but failing to do so... This actually is the same storyline with a Sci-Fi legend: Franklin Schaffner's \"Planet of The Apes(1968)\". Still keeping its sense with having the most terrifying ending of all science fiction works ever created, Planet of The Apes has so many things in common with Avatar. The Apes and the Na'vis both seemed atrocious and uncivilized at first. Then we realized that they're in fact very cuddly creatures. Both Charlton Heston and Sam Worthington became beloved with a female native, and we're introduced to their untouched and God's gift virgin nature. Then as in Star Wars and Abyss, humankind declares war against the natives to capture their lands and resources. Another unique similarity between Planet of the Apes is that humankind is the evil-side again. So the same message we get with a deeper self-criticism is that humankind is the one who destroys the nature and is responsible of all wars. Wasn't this the Terminator's message as well, spoken out by Sarah Connor? \"It's in our nature to destroy ourselves\". All to the good, we didn't lose our World to apes or cyborgs this time.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "PerpetuumMobile09",
            "reviewer_url": "/user/ur22130130/?ref_=tturv_usr_50_t",
            "review_date": "Jan 11, 2010",
            "rating_value": "10",
            "short_review": "A grand cinematic experience",
            "full_review": "AVATAR is one of the few films in recent years that I've really looked forward to. Given Cameron's solid track-record when it comes to sci-fi/action-films, there was no doubt in my mind that this film would be good, even though it's been 12 years since his last feature film. The only question in my mind was whether the film would be great or merely good. Fortunately, it turned out to be the former.I'll start by mentioning a few things that I really liked about the film, and areas in which I feel it succeeded very well: The characters: Cameron invests enough time in his characters so that the viewer actually care about them when the going gets tough later on in the film. Most action-directors put too much emphasis on the action and fail to involve the audience on an emotional level: You couldn't care less what happens to the main characters and the feeling of genuine suspense is severely undermined. AVATAR is an action/adventure film with a heart.The CG (primarily by WETA Digital) looks great, especially when it comes to organic objects, such as plants and the blue humanoid-looking natives. The great attention to detail makes a significant difference in terms of photorealism. The natives move and express themselves in a very convincing, natural manner. Mocap (*) has been used for many years, but this is one of the few films in which the movements (both body and face) look completely realistic. AVATAR sets a new milestone when it comes to photorealistic characters. I was also very impressed by the seamless integration of CG and live shots, and the CG explosions: The explosions were actually created using fluid simulations which made them look very realistic (the normal approach is to use live shots of real explosions, composited on top of CG elements).The directing: With AVATAR, Cameron demonstrates why I consider him one of the best action directors in modern cinema. The long finale, in particular, is one of the best action-sequences I've ever seen. It's dynamic, intense and exhilarating to watch. The rhythm and pacing is spot on. Cameron also slowly builds the film to its finale, and this makes the action-sequences even more rewarding (because the buildup serves as 'foreplay' and creates anticipation).Other things that I liked: The beautiful cinematography and the interesting, underlying themes related to imperialism and the environment. It makes you think a bit after you leave the theatre, and it adds a bit of extra depth and meaning to the film. This is more than you can expect from a typical film in this genre nowadays.It's hard to pick things that I didn't like about the film, because there was nothing that really bothered me. If I had to mention one thing that I was hoping would be better, then it would be James Horner's score. It didn't seem as prominent or memorable as it should've been. Its impact on the overall movie experience was much smaller compared to his score for films such as TITANIC, ALIENS or BRAVEHEART. I'm not saying the score is bad, far from it, it just lacked that little extra.Some people have complained about the simple plot and predictable ending. I personally didn't have any issues with the plot, and I must admit that I don't really understand those who get too obsessed with spotting plot holes and logical problems. First of all, it's not really the story itself that matters, its the way it's told, because film is primarily an audiovisual medium. Cameron's films are simply structured in general and they're easy to follow. But he makes things interesting and engaging to watch because of his storytelling skills. Although the film lasts for over 2,5 hours, I never felt there was a dull moment. Cameron sucked me into the film from the get go and he didn't loosen his grip until the end-credits started to roll.I've seen both the 3D and 2D version. Some people clearly prefer the 3D version, but I didn't feel that I lost anything substantial when I saw the 2D version. Cameron doesn't make the mistake of trying to use 3D as a cheap gimmick, and the use of 3D effects isn't exaggerated. The 3D effect is impressive, though, and the technology has obviously improved significantly in recent years. After a few minutes into the film I almost forgot that I was wearing the glasses: They were comfortable and they didn't cause dizziness.AVATAR is a visual tour de force that really needs be seen on the big screen in order to be appreciated fully. Don't wait until the DVD or Blu-Ray is released: The experience simply won't be the same, unless you have a big, high-end home-theatre.(*) Motion capture: Technology used to capture the actors's performances, so that they can be reproduced by their CG characters.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "doctorx2",
            "reviewer_url": "/user/ur12431180/?ref_=tturv_usr_51_t",
            "review_date": "Jan 12, 2010",
            "rating_value": "10",
            "short_review": "Powerful on Many Levels",
            "data-review-id": ""
        },
        {
            "reviewer_name": "nolan-09154",
            "reviewer_url": "/user/ur116745726/?ref_=tturv_usr_52_t",
            "review_date": "Dec 13, 2020",
            "rating_value": "7",
            "short_review": "Incredible",
            "full_review": "I remember watching Avatar when I was 9 years old and loving it back in 2009. 11 years later I thought I'd revisit it as some people w had been talking about it ironically how it is amazing, etc. And this movie kinda blew me away. We watched the extended cut that tags on 16 minutes of intro before the real film begins and that added a sense of new-ness to the movie. The animation and visuals at times blew me away and made me realize why this movie was such a cultural landmark for cinema. At other times id did look a little bit like a ps3 game where the graphics take a minute to load and everything is smooth without texture. I also forgot about how hard hitting the message of the movie is and how revolutionary AVATAR really is! James Cameron knows how to appeal to a large audience hook people in and show them a message that they cant argue with. Avatar shows us the exploitative nature of Capitalism and the husks of people behind it and how its good to go against the grain of societies order. The main character although some complain that he's not interesting or a good actor works even better for this message as he is clueless and he's 100% on the side of the military and the state and gets convinced ad won over to then lead the revolutionary battle for freedom. He is an unmemorable, plain character than makes a decision to do what's right and that relates to the masses. You don't have to be the most charismatic perfect person to make change. Where Starship Troopers (although satirical) is a movie to promote fascism (again satirical, I love this movie) and authoritarianism, Avatar is our movie to promote the right path we have to take, a path away from capitalism and it cannot be long lasting. (Also its creepy how James Cameron kinda precited Venezuela and still impressive how he Invented all that 3D Technology)",
            "data-review-id": ""
        },
        {
            "reviewer_name": "jim-2379",
            "reviewer_url": "/user/ur17767193/?ref_=tturv_usr_53_t",
            "review_date": "Dec 26, 2009",
            "rating_value": "1",
            "short_review": "Mediocre cr-pfest",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Fjalar_",
            "reviewer_url": "/user/ur5262026/?ref_=tturv_usr_54_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "9",
            "short_review": "Happy Symbolical Birthday; to Jake, to Pandora and to James Cameron - who has been born again",
            "full_review": "Science fiction is, at its core, more than just a hypothetical fantasy about our distant neighbours twinkling in the night. It is also a reflection on humanity. It holds the mirror up to our faces and forces us to question who we are; when our aspirations, morals, ideals and weaknesses are put to the test, are we really who we think? And what is our place in the great darkness that surrounds us, frightens and amazes us? To know your own culture; learn another man's customs. It is only by comparison that we can truly see ourselves. And it is also only us, as subjective individuals, that can know who we are beneath our human exteriors. Many of us focus too much on our weaknesses and turn to God/s and religion for love and acceptance despite our faults, with heaven as the ultimate point of approval. Acceptance by someone or something that truly sees us, not only the shortcomings, but also for what we hope to believe that we fundamentally are; good, decent, with the heart in the right place, trying to make the best of what we have been given. Some of us don't believe in God, or profoundly question his/her/its existence. Many fear death, the unknown, never to see, feel or experience anything again. To be forgotten. For ever.So the question becomes: does this introduction have a point and what does Avatar have to do with it? Mr James Cameron is a self-proclaimed sci-fi nerd and - not to mention - a human being (although I agree questionable, let us make that assumption for convenience sake) and just like many of us I am sure he shares many of the same existential thoughts and questions that find their way into our human brains and skeptic hearts. And like many of us he seems to share a craving for adventure, discovery, enlightenment and a curiosity of the world, the universe and the beings with whom we happen to share our short time here on Earth.With Avatar, Mr Cameron manages to address most of these existential questions: who are we? Not in the comfort of our living rooms, nestled in the sofa with a bag of crisps and a chocolate bar in front of the TV, but in the face of choice. The choice between convenience and what we believe in. When all the luxuries have been taken away, and all the shields and walls and layers have been peeled off, do we like what we see? Avatarians have an expression; \"I see you\", which comes with such a deep ring to it because it is what we all want the world and people around us to do; to recognize, appreciate and care about us and to see that no matter how we might act and react on occasions, deep down we are good. These glasses we desire others to wear when they look at us also have another umbrella term; love. Some say love is blind, but to me at least, real love is not blind, it is understanding. It looks beyond the flaws and recognizes us for all the good things that we are. It sees our actions from our point of view.The story of Pandora's box in Greek mythology depicts how numerous evils were let into our world in a moment of weakness on Pandora's behalf. In much the same way, humanity in James Cameron's Avatar goes to the planet of Pandora and is confronted with a choice; open the lid or let the box be. Naturally, the greed (for money, power, etc) wins, and so, the lid is opened. Naturally, it has consequences. However, just like in the original story of Pandora's box, something else was let into the world when the lid was pulled away, something to counterbalance the evils that had been unleashed; hope. The hope that the good will, eventually, win. In Cameron's Avatar, this hope is represented by a group of humans who are not set out to exploit the people and resources of Pandora, but to understand it. And with understanding comes the ability to see clearly, and with this comes, ultimately, love. Love is not blind, but ignorance is, and ignorance is the root of most evils taking place in the world today.We all choose how we want to see the world. Everything is neutral as far as the universe is concerned; there is no good or evil, no good or bad, no morals set in some sacred stone at the heart of the heart of the universe. Morals are what we, humans, have created because we have a conscience. We have the ability to empathise and sympathise, to see the world through other's eyes as if they were our own.On Pandora, everything is connected; the trees, the animals, the flora and fauna, the past and the present, the living and the dead. If we as humans could be as connected with each other and communicating as much, I believe understanding of each other's differences would ultimately result in the realisation that we are in fact more similar than different. I believe that one such medium of communication already exists today – the Internet. Another one is the media but the question is how well it is working.I think Cameron's intended message with this film is very simple and – I admit – very cliché, but also very true and it doesn't hurt to be reminded of every once in a while; to see what we value and to stand up for it.Plus, it's easier to see the world through another's eyes when it's presented with such smashing CGI...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "SPJames79",
            "reviewer_url": "/user/ur22678017/?ref_=tturv_usr_55_t",
            "review_date": "Jan 9, 2010",
            "rating_value": "10",
            "short_review": "Breathtaking story with AMAZING visuals MUST SEE",
            "data-review-id": ""
        },
        {
            "reviewer_name": "deathscythe_42",
            "reviewer_url": "/user/ur4282525/?ref_=tturv_usr_56_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "9",
            "short_review": "A Whole New World",
            "full_review": "Director James Cameron's return to the world of science fiction cinema is a glorious one indeed. Twelve years after delivering us the highest grossing film of all time, Cameron brings us the sci-fi epic Avatar, a film that is not only visually breathtaking, but also character driven, emotional, exciting, effective, and masterfully directed.The marketing and hype for this movie was mostly based around the groundbreaking visual effects, so I'll start there. I was lucky enough to get to see this film in a digital 3D theater. My only complaint is with myself, in that I wish I had seen a couple of 3D movies before this one. This was my first experience with a 3D film, so I really didn't have anything to compare it against, but all I knew from the very first shot of the movie was that this was going to be unlike anything I had ever seen before. At first it took me a while to adjust to the dimensions of the film, but after my eyes got used to what i was seeing, I realized that what I was looking at was not a 3D gimmick but a world with an incredible amount of depth. James Cameron rarely gets right in your face with the big things in this movie. He is more subtle than that. The things that appear to be directly in front of you (and they really do) are the little things that capture the ambiance of the scene and make you feel like you're there with the characters. The rest of the 3D effect serve to add dimensions and reality to the scenes.The visual achievement in this film is not in the action scenes (which are some of the most exciting I've ever seen) but in the lengths that were gone to to bring this world to life. James Cameron has created a planet, a species, and a culture that work in perfect harmony with each other, and likewise the visuals are in perfect harmony. I'll admit I was a little apprehensive that this movie was more computer animated than live action. To me that usually suggests that a film crew is getting lazy, and that it's going to look like a video game. That is not at all the case here. The truth is that without computer animation there is no other way this film would have looked this impeccable. The planet of Pandora is extremely beautiful and detailed, and the Na'vi species fit with it perfectly. In all honesty, you can in fact tell that the aliens are computer animated. They still haven't quite attained the ability to make CG characters that look absolutely 100% unquestionably real, and in a live action world they might still have suffered the out-of-place look that many CG characters in movie get. However, in the computer animated world of Pandora, they blend in seamlessly and beautifully. This is of course not to downplay the design of the na'vi. They look as real as you could possibly hope for. The nearness they have come to looking real, the motion capture used in this movie, the range of facial expressions and emotions that they show, are all unprecedented.All of that being said, the next big question about this movie is this: Are visual effects all it has to offer? My answer: Not at all. The depth of Avatar goes far beyond the visuals themselves.As with all of Cameron's movies, Avatar is character driven. The central characters of the film are all dynamic, well written, and very well acted. You go on an adventure with them and throughout the movie you fall in love them (or grow to despise them depending on which characters).The general plot-line of the movie is a bit generic but that's okay. No, the premise isn't anything completely brand new, but it's still an excellent plot, and one that is familiar to our society and very important for us to remember. Along with that there are still several aspects of the plot that are quite original. James Cameron took a familiar story, one that many storytellers before him have told version of, and made it his own. Furthermore, this is one of those movies where you predict things because you want to see them happen, and when your predictions turn out to come true it's gratifying. That's not to say that everything is predictable, because that would get old. Don't worry, Cameron has thrown in a fair amount of little surprises too.This film is also as much emotionally effective as it is visually effective. James Cameron is a master at getting a certain emotion or feeling out of his viewers, and every scene in the movie works toward one or more of these effects. It's very light-hearted at times, with a good bit of comedic relief, and then quite intense in other scenes. Some scenes make you fear for the main characters, or perhaps even for yourself. Much of the film is brimming with anticipation and suspense, and several scenes had me simply grinning with excitement.Overall this is one of the greatest cinematic experiences I've ever had. Avatar is groundbreaking, dynamic, powerful, and a ton of fun. I must say it was worth the wait, but I certainly hope Cameron is here to stay this time.10/10",
            "data-review-id": ""
        },
        {
            "reviewer_name": "smr1223",
            "reviewer_url": "/user/ur22027236/?ref_=tturv_usr_57_t",
            "review_date": "Jan 21, 2010",
            "rating_value": "10",
            "short_review": "Avatar is This Decade's \"Star Wars\"!!!",
            "full_review": "In 2154, the RDA corporation is mining Pandora, a lush, Earth-like moon of the planet Polyphemus, heads the mining operation, which employs Marines for security, intending to exploit Pandora's reserves of a valuable mineral called unobtanium. Pandora's inhabitants are the Na'vi, a blue-skinned species of humanoids with feline characteristics. Physically stronger and taller than humans, the Na'vi live in harmony with nature, worshiping a mother goddess called Eywa.Pandora's atmosphere is toxic to humans, necessitating the use of breathing masks. Attempting to improve relations with the natives and learn about Pandora's biology, scientists grow Na'vi bodies modified with human DNA, called avatars, that are controlled by genetically matched, mentally linked human operators. Jake Sully (Sam Worthington), a paraplegic former marine, replaces his twin brother, a scientist trained to be an avatar operator, who was killed in a mugging. Doctor Grace Augustine (Sigourney Weaver), the head of the Avatar Program, considers Sully an inadequate replacement for his brother and relegates him to a bodyguard role.In their avatar forms, Jake escorts Augustine and biologist Norm Spellman (Joel David Moore) on a mission to reestablish peaceful relations with the Na'vi. A predator attacks the group and Jake becomes separated and lost. Forced to survive the night in Pandora's jungles, he is rescued by Neytiri (Zoe Saldana), a female Na'vi. Neytiri brings Jake to Hometree, which is inhabited by her clan, the Omaticaya. Mo'at (C. C. H. Pounder), a shaman and Neytiri's mother, shows interest in the warrior \"Dream-walker\", and instructs her daughter to teach Jake their ways. Colonel Miles Quaritch (Stephen Lang), leader of the security forces, enlists Jake to bring him intelligence about the natives that could help RDA negotiate for access to the huge unobtanium deposit under Hometree. He promises Jake that he will help him obtain the expensive neuroregeneration treatment to restore his legs.At first, Jake delivers key strategic information to Quaritch. Augustine becomes suspicious and relocates herself, Jake, and Norm to a remote scientific outpost with an avatar link module. Over three months, Jake grows close to Neytiri and the Omaticaya, while questioning his loyalty to RDA's agenda. He is initiated into the Omaticaya, and he and Neytiri choose each other as mates. Jake reveals his change of allegiance when he disables a bulldozer as it destroys the tribe's \"Tree of Voices\". Quaritch presents Selfridge and Augustine with a video diary in which Jake admits that the Omaticaya will never abandon Hometree. Selfridge decides further attempts at negotiations are futile and orders Hometree destroyed.Augustine argues that the destruction of Hometree could affect the bio-botanical neural network that all Pandoran organisms are connected to, and Selfridge gives Jake and Augustine one hour to convince the Na'vi to leave Hometree. When Jake reveals his original mission to the Omaticaya, Neytiri accuses him of betraying them. Jake and Augustine's avatars are taken captive. Quaritch's forces arrive and destroy Hometree, killing Eytucan (Wes Studi), Neytiri's father and clan chief, and many others. Jake and Augustine are disconnected from their avatars and detained for treason along with Norm. Trudy Chacón (Michelle Rodriguez), a security force pilot disgusted with Quaritch's senseless violence, breaks them out and flies them to the remote link module. During their escape, Quaritch shoots Augustine.Hoping the Omaticaya can help Augustine, Jake tames a Toruk, a powerful flying beast that only five Na'vi have ever tamed, to regain their trust. Jake finds the Omaticaya at the sacred Tree of Souls and pleads with Mo'at to heal Augustine. The clan attempts to transfer Grace from her dying body into her Na'vi avatar with the aid of the Tree, but she succumbs to her injuries before the transfer completes. Mo'at declares that \"she is with Eywa now\".With the assistance of Neytiri and Tsu'Tey (Laz Alonso), the new leader of the Omaticaya, Jake assembles thousands of Na'vi from other clans to repel the humans. Jake prays to Eywa, via neural connection to the Tree of Souls, to intercede on behalf of the Na'vi in the coming battle. Quaritch notes the mobilization of Na'vi clans and convinces Selfridge to authorize a preemptive strike on the Tree of Souls. Because it is a center of Na'vi religion and culture, its destruction would leave the Na'vi too demoralized to resist further encroachment.As the security forces attack, the Na'vi retaliate but suffer heavy casualties, among them Tsu'Tey and Trudy. Suddenly, the Pandoran wildlife joins the attack on the corporation's forces, overwhelming them. Neytiri interprets this as Eywa answering Jake's prayer. Jake destroys the main bomber before it can reach the Tree of Souls. Quaritch stumbles across the avatar link module where Jake's human body is located and attacks it, exposing Jake to Pandora's atmosphere. Neytiri kills Quaritch and saves Jake. With the attack repelled, Neytiri and Jake reaffirm their love as she sees his human body for the first time.Selfridge and the remaining corporate personnel are expelled from Pandora, while Jake, Norm, and the scientists studying Pandora are allowed to remain. Jake is seen wearing the insignia of the Omaticaya leader. The clan performs the ritual that permanently transfers Jake from his human body into his Na'vi avatar.Brilliant CGI, sound, & vividly showcased in vibrant colors!!! Everyone will cheer for one of the most exciting & innovative films of all time!!!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "cristeabogdan2003",
            "reviewer_url": "/user/ur9304470/?ref_=tturv_usr_58_t",
            "review_date": "Dec 31, 2009",
            "full_review": "I want to start this review with the note that this is my first review ever,i did not write one until now because i am a critical person and i have not met a movie yet which moved me so deeply that i felt the need to write a review. I saw today Avatar in 3d with some friends,i went to the movie knowing it has nice effects and visuals but with no big expectations, i do not know if i have ever been more surprised in my entire life , this movie has absolutely incredible breathtaking visuals.And here is the good part,it does not only deliver images which you could watch for days without a break,but the story is also intense and well written.When Jake Sully takes control of hes avatar for the first time i almost cried, if you are a sickly person like i am,never been able to do sports or enjoy runs, then those moments will deeply move you,he develops so much joy and fun running around ,breathing deep, feeling the nature ,it takes you in ,and makes you want a new body. Throughout the movie i cried ( and i am 22 years old), i laughed ,i had shivers running down my spine,i had so much anger i nearly stood up and punched somebody,and at some scenes my heart even skipped a few beats,which never happened watching another movie before.This movie just overwhelms you with emotions.The outcome of the movie makes you seriously think about us people ,about our lives and how we treat the nature and animals,about our behavior as mankind,we enjoy killing and destruction instead of respecting ourselves and others and the world that surrounds us. I recommend this movie to anybody,especially those people who can understand the deeper meaning,it is very likely that this movie will stay with you for the rest of your life,and its sure that this is one of the best movies ever made.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "snuritdinov",
            "reviewer_url": "/user/ur10667534/?ref_=tturv_usr_59_t",
            "review_date": "Dec 27, 2009",
            "rating_value": "10",
            "short_review": "What movies should be like!",
            "full_review": "James Cameron once more shows that he knows what he is doing. I finally get to watch it yesterday in 3D after waiting so long, and it was worth all the reviews and even better. I am still in shock from what I experienced. The visual effects and the 3D experience in the movie- you have to watch it with your own eyes to feel the magic James Cameron has captured with this masterpiece. Acting is excellent, you can't ask for anything more than the actors gave from science fiction. Whoever said no love or passion in the movie is mistaking big time, it has something for everyone starting from astonishing score (bravo! James Horner) and love story, big epic, awesome war episode and a unrepeatable beauty of Pandora- WOW. If you didn't like the movie at any point, you seriously need to see your doctor. After coming out of the cinema, all I could think about was to go back in, so that's what I am doing today and probably tomorrow as well. Thank you, James Cameron for the best experience of my life!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "michaelgs",
            "reviewer_url": "/user/ur2173678/?ref_=tturv_usr_60_t",
            "review_date": "Dec 26, 2009",
            "rating_value": "6",
            "short_review": "Great spectacle, mindlessly predictable plot",
            "full_review": "Like Peter Jackson and George Lucas, James Cameron raises the level of technical achievement in film making in every movie he makes, and Avatar is no exception. We have set before us a digital masterpiece of beauty and spectacle, where the technology has once again surprised us, but the beauty and imagination of the artists behind it inspires us even more. Now, as before, much of the movie was green screened, but unlike before, it doesn't matter. When live actors are on the screen, they actually look less real than their surroundings. The idealized Na'vi are sacred, vivid, and real. Live actors are dimly lit, phony profanities in James Cameron's digital reality. The central problem with the story is its appalling lack of originality. The plot, and moment after moment in this film, is ripped from previous movies with reckless abandon. No person who has seen such movies as Dances with Wolves, the Last Samurai, Pocahontas (Dis.) or any number of other movies should be surprised at any part of the story here. The plot is simply an excuse to string together a beautiful canvas of rich, detailed digital fantasy art. Soldiers are portrayed here either as self-hating pansies or narrow-minded bad asses. The Na'vi are portrayed as a race in perfect balance with the world around them, rather than as products of natural selection with their own defects. Count me as someone who wanted to see a story which had real characters with real people in them, or a twist in the story I didn't see coming. I have a few moral qualms with the story as well, which plays out not as a message about tolerance of differences or peaceful coexistence, but as a racist ballad where the sacred Na'vi have been perverted by contact with the infernal humans and it is the humans that need to be eradicated or exiled.This is a movie you will want to see if eye-popping visuals and vivid detail at all appeal to you. But if you're looking for a compelling story that you haven't seen before, look elsewhere. As sci-fi, District 9 is a much better movie, and I would say even Star Trek has the edge on a compelling story line.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "InTheNameOfCinema",
            "reviewer_url": "/user/ur19164391/?ref_=tturv_usr_61_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "10",
            "short_review": "A new age of cinematic visualization starts here...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "AlsExGal",
            "reviewer_url": "/user/ur15148330/?ref_=tturv_usr_62_t",
            "review_date": "Jul 28, 2010",
            "rating_value": "6",
            "short_review": "Mediocre in every aspect but the technical ones",
            "full_review": "This is not the worst movie ever made, but it's not something that will change the direction of cinema either, and it's definitely not something I would want to sit through a second time. Like Cameron's Titanic it will largely be forgotten in ten years to the point that people in the future will just not believe all of the hype that went on at the time it was in theaters.Cameron is brilliant with special effects and technology, but he's a good businessman with a sense of showmanship too, and thus he realizes that if he simply made a documentary entitled \"How I Did It\" and showed off and explained how he produced some of his pioneering technological tricks, that nobody but a few dozen geeks such as myself would buy a ticket to see it.Thus a narrative is added - usually an obvious and emotionally manipulative one - to draw in the largest audience. That was what was done in Titanic, and that is the case here. I can't say that Cameron plagiarized the story either, because he's also a master at taking known story lines and putting them through a blender where you can at no point say this is a retread of any one story. However, it is retread of several well known ones. I won't tell you which stories or else I might give the plot away to the few people left on this planet who haven't seen Avatar and still intend to do so.My recommendation - see it or don't see it. This one won't change your life.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "MACarter214",
            "reviewer_url": "/user/ur17546726/?ref_=tturv_usr_63_t",
            "review_date": "Jan 7, 2010",
            "rating_value": "1",
            "short_review": "OK, I get it...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "bryonyx70",
            "reviewer_url": "/user/ur20345261/?ref_=tturv_usr_64_t",
            "review_date": "Jan 2, 2010",
            "rating_value": "9",
            "short_review": "An exceptional piece of film-making by an exceptional director, this is James Camerons Avatar.",
            "full_review": "The sheer amount of pressure for one single film from one single man was so immense, that it is a wonder that Cameron even dared to tip-toe back into the film industry for one brief glance, let alone make an actual movie. And yet, it is an extremely rare and beautiful thing that something is created which can not only meet it's former film in pretty much all aspects as well as the pressure from media all over the world, but dare even to out shine it. Yet i have to agree that Avatar, in my opinion, does just that.I cannot deny that Titanic was not a piece of marvel and excellence, and the scale of the special effects as well as the intensity of that infamous jack and rose love story were so remarkable that is was enough to leave most that watched it weep like a small child. However, Avatar gives us a look at a different story of love, and like Titanic, it is forbidden and frowned upon, yet is still heart warming and similarly tragic in some places. The only criticism I have is that the love between Jake and Neytiri lacks that throat choking moment which still holds Titanic in such high regard even today. On the other hand it also must be commented that despite these films being among the most expensive ever made, the story lines do not rely on they're huge explosions and crashing objects to make the movie, because both of the stories are deeper and more meaningful than that and they manage not to drown in the special effects like so many films nowadays do.Speaking of the spectacular effects, those in Avatar are really just that. The beauty of Pandora makes you get goose pimples as the sheer detail of exotic plants and dangerous animals feel so real that you have to remind yourself continually that they do not actually exist. And if you are not as soft as to fall in love with the beauty of the planet, than I'm sure the final battle will make you heart race and you will truly be blown away by the incredible effects that all of Cameron's team have managed to achieve, this really is film making at it's best. Don't be put off by the length or the fact that it's sci-fi because i do not doubt that coming out of that film, no matter what your favourite genre, will leave you so speechless and amazed that the only word you will be able to breathe is 'wow.'",
            "data-review-id": ""
        },
        {
            "reviewer_name": "myportal28",
            "reviewer_url": "/user/ur22504559/?ref_=tturv_usr_65_t",
            "review_date": "Jan 19, 2010",
            "rating_value": "10",
            "short_review": "Can we please just feel the Greatness of this movie?",
            "full_review": "Experiencing this movie, in Imax 3-D, was simply the best movie experience I have ever had. It is great that there is a lot to say about movies but this should be the fist and most important thing. What did the experience of watching evoke in you? I start this way because I have been reading very much about this movie and I have heard so many perspectives on it that I almost lost the direct feeling of it. Moreover the fact that It is being spoken about so much is to me another indication that this is an important and intriguing film. Of course attention in itself it not an indication of value, but it becomes apparent soon that the discussion is very widespread and represents many views that already are inherent to our society itself. As soon as this criterium is not met we should be aware what this movie is trying to do with us or with a certain group of people. From my point of view such a discussion is not going on and what is going on is a fair and multiperspectival approach to a deeply intriguing and moving cinematic masterpiece (even though the last word of this sentence is a bit more personal).Having said all that what is left now is for me to present my contribution to the ongoing dialogue. As one might have guessed I am very positive about the movie and not only because it was a great experience in a 3-D movie theater. This movie clearly has a message that our world needs. The consciousness that wants to aggressively dominate and control the world around itself for the purpose of profit regardless of the consequences for the world of nature, life and living beings is being defeated in here. And it is defeated by the conscious choice of beings living by natural law, by other beings abiding the ways of the spirit of the planet and by the very command of this planetary spiritual will itself. As such this storyline is a simplified but direct representation of processes playing out on the face of earth nowadays where the aggressive military-industrial (american) way of control and manipulation is being defeated by conscious processes on various levels of existence.My wholehearted thank goes to James Cameron and his crew for this fantastic tale of life, love, victory and hope. Thank you for creating this and good luck with all future endeavours (which I am looking forward to).",
            "data-review-id": ""
        },
        {
            "reviewer_name": "stalker_sas",
            "reviewer_url": "/user/ur22619547/?ref_=tturv_usr_66_t",
            "review_date": "Dec 30, 2009",
            "rating_value": "9",
            "short_review": "This is not a movie or an art piece. It's a lot more!",
            "full_review": "well, this is the best movie i ever seen. it is almost too good to be true, u get so sucked into it that at the end it's like the time and everything stops. the most impressive and the most balanced movie i ever saw. u know what they say, u get what u payed for, with the biggest budget you make the best movie. this is the kind of movie that will enter the history, next to the other great movie which impressed the world.about the goofs, one looks incorrect for me.Its more of a talk without thinking. arrows on first attack bounce of the windscreens, and in the second they blast them. its simple, in the first attack, they fire upwards, at an like 30 degrees angle or more, from a big distance, and they are stationary, not to mention that the arrows hit the windows at a 45 degrees plus, which makes them bounce, only few scratch the windows. at the second attack, they dive from above, with high speed, adding speed to the arrow (relative to the target), and they also fire from a few meters, and perpendicular (almost) on the windows. if i am correct, in the second attack, the arrows hit with more then twice the energy, and remember, in the first attack they could scratch the glass.they wouldn't make such mistake, this movie was too well done to make any mistake.I saw many well known and wonderful movies from top 250, at least 100, and they impressed me, i liked them. if I would view them now, after avatar, i don't think they could impress me anymore, just rized the standardsit has 10 stars from me, and i cant wait to see it at the cinema. people who rate this movie less then 8 either they really dun like this kind of movies or are total ignorants. You can't say it's crap when it's yellow and shines.***DO NOT READ FURTHER IF YOU DID NOT WATCHED THE MOVIE YET!!! it might spoil the surprise.***i read like 100 reviews on this movie and i noticed 2 major categories of people the ones who give this move 8+ and have a great impression about it, and another, much smaller, which gave it less then 5, mostly 1 stars, who say 'its a pure eye-candy with a crappy story and no plot, it copies many other movies, and its a ridiculous movie to watch'. that kind of words make my inside burn of frustration. i feel like those people are blind or deaf.its like they don't have a soul any more, they have a heart of cold lead, no imagination, no dreaming. it's horrible. this kinda movie cant be rated on 'points' like sound picture and bla bla bla.Something like this needs an overall opinion. the combination is the true masterpiece. Its a wonder. You cant judge a great picture and say its crap because the paint used is cheap.yesterday i had a flick like idea that passed in my head. i think terminator 2 has a very deep secret message in it. that we wont be killed or taken over by the machines. We are slowly turning into machines (in the inside, literally i mean) because of the environment we live in and the daily routine that we get used to. we will be like living machines. no feelings, no \"soul\", no dreaming, no hopes, just following 'laws' lines, parameters. People like that are starting to appear between us. only a cold blood \"machine like inside\" being cannot be touched by at least 10% of this movie. I hope and pray this is just a ridiculous inexistent coincidence i made. How can someone not be touched by the perfect balance of that wonderful race with the nature, living in harmony. how can u not get emotional at the sight of those hopeless beings after they're home tree is blown to pieces. how not to be sad that humans are a bit same to those in the movie? and the most impressing, how not to get touched by the way that paralyzed man of steel, marine, realized he fought all his life on the wrong side, and now he finally finds something that worth fighting for, real freedom and nature and how not to get touched by the wonderful ultimate freedom of being able to fly on the back of a dragon like creature, and control it like an extension of your mind, up in the sky, \"on top of the world\", between those floating mountains \"i am not too much of a horse guy, but i feel i was born to do this\" he says. from a wheal chair in a metal house, to the top of the sky. and not to mention that in the end he finally gets rid of the horror of waking up from the device that he was depending on to get into the in the wonderland, entering his avatar. His 'soul' is transfered from his human body to the avatar, finally being totally free to live his dream all the rest of his life in that world of perfect balance, full of life, enveloped by nature.I liked how Jake realizes that he fights for the wrong things, when the right thing that is worth to fight for, he was fighting against.Its funny how the colonel says that place is worse then hell, but actually is better then haven. Don't kick the dog! Look in his eyes, scratch him between his ears.Someone says this movie has a soul. I feel the same thing!1 of the most sad things about this movie is that it's just an imagination, a dream about a perfect place, but unreal.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "chrishaydon_63",
            "reviewer_url": "/user/ur17370818/?ref_=tturv_usr_67_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "Cameron's latest is unbelievable",
            "full_review": "Some directors go 'further'; some push the boundaries of controversial subject matter, some strive for a new means of expression, some are desperate to make ground-breaking content and others will do anything to be original and unique. Whatever these directors try for, they all dip their toes in the deep end of the unknown pool, and James Cameron is no stranger to these foreign waters.Cameron's filmography is far from a sad story; he is responsible for some of the most technologically advanced and brilliantly original cinema Hollywood has ever seen. From 'The Terminator' (1984) to 'Aliens' (1986), from 'The Abyss' (1989) to 'Titanic' (1997), he has always strived for more than the average Hollywood mega-director, and his latest picture, 'Avatar', looks set to follow in that same path. The film has already been said to be the most expensive film ever made, costing a whopping $237 million, it boasts the latest gadgets and technology, using High Definition cameras and ultra-sleek CGI, and it's been labelled by many as \"the future of cinema\". So, bearing all of these points in mind, Cameron has got a lot to deliver to a very hungry holiday audience, much like he did with 'Titanic'. He succeeded in '97, but will he strike gold again in '09?The film follows Jake Sully (Sam Worthington); a paraplegic ex-marine who's been asked to take over the role of his late brother in an 'avatar' experiment. This means that his DNA is genetically developed with another being, to form a second life. He's sent undercover to Pandora; a beautiful moon soaked with luscious foliage and filled with mesmerising creatures. His boss, Colonel Quaritch (Stephen Lang) has set him a mission; he must bond with the natives of the planet; the Na'vi. Once he has bonded with them and gained their trust, Sully must obtain a mineral that lives on their planet. This mineral sells for millions of dollars in the United States. But when Sully meets Neytiri (Zoe Saldana); a native of the planet that blossoms with beauty, courage and ruthlessness, he becomes attached to her and the Na'vi people. Now Jake is torn between his mission and his orders, and the planet and people that he learns to love.So, $237 million and 162 minutes later, what are we left with? We are left with one of the most beautiful, captivating and emotional roller-coaster experiences that 2009 has offered us. It totally blew me away, more so than I ever thought it could. Not a one moment are you taken out of the film; the audience is locked in for the film's mega duration, which passes by so quickly. Packed with dazzling CGI and mouth-watering cinematography, 'Avatar' most certainly is the future of American cinema. But it gets better; rather than all the throw-away blockbusters Hollywood has offered us this year, the film's life is in the narrative and character development, rather than the green-screen technology and gizmos. It's not just an attraction on the eyes; you are actually involved with the characters and the overall picture.The planet of Pandora is quite possibly the most stunningly gorgeous thing to grace the silver screen in years. It's plastered with radiant colours, wild flowers, twisted trees, crushing waterfalls and jaw-dropping mountains. I would have happily watched the film even if it just toured around this new world.The film is completely action-packed too; sporting some of the most mesmerising and memorable battle sequences. The fights between the Na'vi and the RDA (Resources Development Administration) are champion.The film also features stellar performances; Saldana is fabulous as Neytiri, Sigourney Weaver is excellent as always in her role as Dr. Grace Augustine, and Lang steals the show as the relentlessly evil Colonel. 'Avatar' is an ultra-brilliant package of proper film-making, and Hollywood glitz. Cameron has had this film is pre-production since the mid '90s, and it's so obvious how much he cares for this picture. Everything is perfectly placed and works accordingly.I'm hard pressed to find any problems with the film; the only thing I would have liked is if it was released in the summer, at least that way there would have been one summer Hollywood hit that was worth watching. But, nevertheless, this film should and will do tremendously at the box-office over the Christmas period and rightly so. Cameron deserves his praise for this picture, because 'Avatar' is so much more than a film, it's a cinematic experience.If you see any films this holiday, make sure this is one of them.'Avatar' is a modern masterpiece. See it.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "MattDevivre",
            "reviewer_url": "/user/ur1214202/?ref_=tturv_usr_68_t",
            "review_date": "Dec 21, 2009",
            "full_review": "Although \"Avatar\" may not be James Cameron's greatest story I consider it a great popcorn movie. It is a film, that should work fine even without IMAX cinema - however with 3D for me it was fantastic! Already once Cameron took a lot of risk with \"Titanic\". Back then his success was nothing you could have expected back then! His newest creation is no less risky but it seems it will work out perfectly fine.What has always impressed me considering this director and writer (especially when thinking of his movies \"The Abyss\", \"Terminator 2\", \"Aliens\"...): nothing in Camerons script seems to be coincidence. Everything seems to have a profound reason. Every picture is thoroughly thought. Same holds true for \"Avatar\". Its plot provides several typical Cameron elements: the clash of different worlds, technology versus nature, progress versus tradition, human species crossing a crucial line and so on. I heard it reminded several viewers of films like \"The Last Samurai\" but I'd say the meaning of this story goes deeper. It's not just about how we deal with other cultures and traditions, it's about how blind we deal with nature.During this picture, you can almost feel how its 3D technology is evolving. The director and his crew were painting an image of colossal size, merging tons of impressive ideas from all directions (movies, nature...). So far I have never seen anything as detailed. It's like seeing (feeling in some way) a different world - which from my point of view is \"Avatar\"'s greatest strength. This time the very archetypal plot is no more than a fancy (though not less moving) accessory.Easy to see I'm very positive about this movie. On the other hand - without 3D and especially on a TV screen - I could imagine that \"Avatar\" might have some lengthy moments. I assume that probably 3D needs more \"lengthy\" moments to relax than 2D. In my point of view Cameron chose the right pace and you'll have enough time to become familiar with this new world. There are several moments, when \"Avatar\" is like a \"prototype\", where not everything is perfect. And yes, the quality of 3D varies and some images seem to have little space, whereas others look totally overwhelming. But from my point of view the story is strong enough overcome little flaws.Summing up: \"Avatar\" is offering a truly wonderful impression of what is possible, how cinema can/will be plus even more and also a very moving story which hopefully will create a more positive spirit towards nature. A film which already is one important brick in the wall of film history !",
            "data-review-id": ""
        },
        {
            "reviewer_name": "paulbartley",
            "reviewer_url": "/user/ur19544585/?ref_=tturv_usr_69_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "7",
            "short_review": "The Avatar 3D-IMAX Experience - A review....",
            "full_review": "First off, I had never seen IMAX or 3D (only in 80's magazines) and was actually in two minds whether or not too go and see the 3D version... but boy am I glad I did... it should NOT be seen any other way, I went to my new IMAX cinema which opened on the day of Avatar release and was awestruck by the experience, I was so overwhelmed just from the 3D trailers before the movie that it made me physically laugh, I could not control it until I got used to it.The movie itself was amazing, the 'cutting edge' motion-capture CGI mixed in with Stereoscopic 3D (special 3D cameras built by James Cameron himself) all shot in IMAX 70mm film (10 times the resolution of normal movies) it was stunning to say the least, the storyline and dialogue was quite good and characters played very well, Sigourney Weaver played a great role as did the Stephen Lang (the army Colonel), it is a long film but as your engrossed in it - it really does seems to fly over and your left wanting more, the Wildlife and plants on Pandora just come to life, colours and detail were amazing and the 5.1 Dolby Digital was outstanding... robot machines walking from behind the camera and over your head and to the front...as it does its steps were thundering from the back of auditorium right through the middle and to the front whilst a big 30ft 3D robot comes towering over your head into view...AMAZING!! I strongly recommend you go and see this movie in IMAX-3D or just normal 3D if you don't have IMAX (the experience is roughly the same just on a smaller scale) its all cutting edge stuff, Steven Spielberg called it \"the future of cinema\" if you have kids even better - don't expect them (or you) to sleep that night haha",
            "data-review-id": ""
        },
        {
            "reviewer_name": "crashprash-641-144880",
            "reviewer_url": "/user/ur22743830/?ref_=tturv_usr_70_t",
            "review_date": "Jan 22, 2010",
            "rating_value": "10",
            "short_review": "A wonderful movie for all ages......truly amazing!!",
            "full_review": "Wow!!.....what a movie!! To be honest with you all, I'm 26 years old....and i have never, ever seen such an entertaining movie like this ever... its really confusing to put this movie in which genre........ coz, there is action, adventure, emotion, love, thrills, chills.....you name it. Even the LOTR trilogy are no match for Avatar. It has all the right ingredients for a great movie...and off-course my favorite....emotion....lots of LOVE and emotion.James Cameron ain't \"The king of the world\"....... He is THE GOD OF FILM MAKING. i have only one word for him and his cast & crew.....Awesome!!!Wonderfully executed movie which wont make you bored at all. It will just take you away to Pandora for over 150 minutes without even realizing how fast those minutes went.The technology used was brilliant, CGI animation incorporated with performance capture is something many people haven't even dreamt about. Plus the virtual camera tech & augmented reality system!!!......totally cool....totally awesome!!I'm myself a big fan of such techie stuff and cant wait for the sequels to come in future.....next time, there will be more that meets the eye... Cameron is god..... picturing Pandora like a place seen never before, the flora and fauna, the military gears, choppers etc....animals, birds are all absolutely amazing. And most of all...the NAVI'S!! Making a whole new language from scratch too was a great achievement. Thanks to Paul Frommer. Their is a scene where Jake flies with Neytiri on 2 Banshees......its one of my favorite scenes.....so lovely!!I really wondered the toll it had taken on Cameron and his men to bring these things to life. Wonderful!! Also a superb job done by the actors, without whom, this wouldn't be possible....Especially Sam Worthington, Zoe Saldana and Sigourney Weaver....To me, watching avatar in 3d was an experience....Not just pop-corn and friends. And Off-course......The center of the movie is all about LOVE. Love...So much love. And even i fell in love with Neytiri!!...i wished she was real!! Though the story lacked some punch, the 3d experience and CGI used will just carry you away for a ride, without even you noticing it. Avatar is truly, one of a kind movie...that is hard to find and will always remain as one of the best movies for all ages.I believe, that from this much info...you all would have got a brief idea about Avatar.....I can guarantee you all that Avatar will be a feast for your eyes...So people.....what are your waiting for???...don't watch it......EXPERIENCE IT!!And may Avatar cross the 2.5 billion $ landmark and win Oscars as well. And may god bless them all.....",
            "data-review-id": ""
        },
        {
            "reviewer_name": "u1_fd",
            "reviewer_url": "/user/ur5393154/?ref_=tturv_usr_71_t",
            "review_date": "Dec 30, 2009",
            "rating_value": "6",
            "short_review": "Average, in every respect but one",
            "full_review": "Entirely computer rendered movies are some of my favorites over the last 10 years. The Incredibles, Up, Toy Story, Finding Nemo, Wall-E, (the list is long!). But Avatar doesn't deserve to be on this list. In fact, given the money spent, it is a failure worth 2/10. However ignoring the budget for a second, it is a 6. A summer block buster popcorn movie that somehow is pretending to be a classic.it is bad? it is so well reviewed!well, first, the 3d. The glasses reduce the brightness, and for someone with good vision it just isn't pleasant to sit for 3 hours with a black fuzzy rim bracketing the screen and a plastic weight on your nose. The 3D effect, when executed, _demands_ you look at whatever is in focus lest you get a headache trying the impossible -- to focus the fuzz outside that spot. This is annoying. When 3d is mostly suppressed you'd really rather be watching a regular big screen movie.Second problem. Multiple ones. Forget for a moment the computer graphics. What you are left with is - a cliché ridden script - the least cohesive imagining of future science I've seen for ages. Stuff that varies from barely better than stuff the Pentagon shows off now, to god-like technology. All set in 2154. - stereotypical characters - a very dull leading man. He sounds a bit like Russell crowe, but there ends that comparison. - an extremely predictable plot. Not just predictable. You've sat through this story before, and parts of it you've seen several times.The worst is the script. On the rare occasion the characters reveal some inner emotion or conflict through subtle action or facial expression, they immediately blurt out their motivation. I guess for the sake of us dim wits in the audience. Meanwhile the full orchestral score swells and swirls almost without a breather from the first second to the last, unnecessarily ramming down our ear canals whatever emotion we are being ordered to feel.A good movie you think about not just the next morning, but the next week. The next month. Avatar only left me annoyed. I couldn't care less about the characters, I was left with zero curiosity for where an Avatar 2 might take them.I'm squarely in the demographic for this movie, supposedly. Bit of a geek. Like sci-fi. Interested in technology and prepared to pay to see good CGI and Avatar totally failed me. Reading some of the rabid comments left for the few professional reviewers brave enough to be actually critical makes me wonder if the studio has launched a viral \"think positive\" campaign to support this movie. Either that, or the lowest common denominator uncritical cud chewing PR swallowing movie going public is a lot more interested & active on blogs and message boards than I had imagined! If the latter then I'll be spending a lot less money on Hollywood over the next decade than I did over the last!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "s-tiley",
            "reviewer_url": "/user/ur16547778/?ref_=tturv_usr_72_t",
            "review_date": "Jan 22, 2010",
            "rating_value": "8",
            "short_review": "Predictable plot? Yes. Spoils film? Hell no!!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "artdev99",
            "reviewer_url": "/user/ur21416517/?ref_=tturv_usr_73_t",
            "review_date": "Jan 3, 2010",
            "rating_value": "6",
            "short_review": "It Depends on your experience",
            "full_review": "If you are 10 years old this film will probably move you. If you are older and remember movies like \"Broken Arrow\", \"little Big Man\", \"Dances with Wolves\", \"A Man called Horse\", then the plot will seem very familiar to you in fact, slightly hackneyed. It's really cowboys and Indians in space. And let's not forget that most of it is a cartoon.It has massive special effects that are impressive. It has great surround sound. It has 3D. 3D is nice but I don't feel that it has reached it's potential yet. I may be in a minority but so far I find 3 D to be inferior to a well directed well photographed normal film.But if you can get past the plot that is so familiar (to adults) as to remove all suspense from the movie then it will be OK. If you take your children to it I am sure they will enjoy it. And it will be a nice diversion for them for a couple of hours.Is it great movie art? Is it a breakthrough? NO. It's \"ok\".",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Ianmcane",
            "reviewer_url": "/user/ur0791177/?ref_=tturv_usr_74_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "4",
            "short_review": "Absolutely zero substance",
            "data-review-id": ""
        },
        {
            "reviewer_name": "kushaalsharmaks",
            "reviewer_url": "/user/ur127485563/?ref_=tturv_usr_75_t",
            "review_date": "Mar 22, 2022",
            "rating_value": "10",
            "short_review": "Epic Movie Of All Time",
            "full_review": "This is the best 3 hours in my life This was my subziest movie ever . Movie,s VFX was awesome And this movie takes you to a different beautiful world. Highly recommended.I LOVE IT.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Kevin_turner_5",
            "reviewer_url": "/user/ur18033520/?ref_=tturv_usr_76_t",
            "review_date": "Jan 8, 2010",
            "rating_value": "10",
            "short_review": "A mixture of great stories coming together.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "matidie",
            "reviewer_url": "/user/ur12735920/?ref_=tturv_usr_77_t",
            "review_date": "Jan 13, 2010",
            "rating_value": "10",
            "short_review": "Excellent for me",
            "full_review": "It's a pretty risky bet but for me is the best film at the visual of the story so far, has set a precedent setting a new level of credibility in the sense of reality and naturalness of 3D being capable of displaying a digital reality as credible as the reality of the real world but there are also limitations that are apparent when the amount of digital creations screen is very high producing some CGIs little expressive and replicated, a perfectly logical thing on the other hand in a technology that has just taken off and the he still has much to develop to get to graze their limitations, the spectacular contrasts found in the faces and amazingly realistic foregrounds. I can not believe how people gives 1 point of qualification. Have seen the movie?",
            "data-review-id": ""
        },
        {
            "reviewer_name": "essi-2",
            "reviewer_url": "/user/ur15992133/?ref_=tturv_usr_78_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "Watching Avatar felt like watching Indiana Jones, Jurassic Park or Star Wars for the first time when I was a kid.",
            "full_review": "Watching Avatar felt like watching Indiana Jones, Jurassic Park or Star Wars for the first time when I was a kid. Back then I didn't even really realize I was watching a movie, I felt more like one of the characters and a part of the story. Watching Avatar was like that. The 3D technology Cameron has perfected over the years makes you dive into the story so deep, you feel everything more effectively, just like when you were a child. After the movie was over my body was shaking and my heart was bounding from excitement. There's that feeling, that high again, the reason why I love movies above all thing.Avatar is director James Cameron's first film in 12 years after Titanic, which was the most expensive movie of it's time. So true to his grand style Avatar is no exception. It is clear from the start that this movie was very expensive. That being said, Cameron is one of those people who knows how to spend money wisely and in the right places. In this movie the money has gone mostly to CGI. And God knows how much money is spend on enhancing the 3D technology alone. I say money well spent, because Avatar is not only one of the most beautiful movies I have ever seen, but it is also a major breakthrough in 3D technology. The movie is so beautiful in fact that at times I was moved to near tears just by it's beauty alone.Although Avatar is highly entertaining it is also very anti-war and green. I might even say that the movie has a conscience. I truly admire the highly imaginative world Cameron has created for Avatar. It feels like he has thought of every tiny little thing. It's not every day you get to see a bunch of blue people running around half naked in the jungle and not think it's completely ridiculous. And this is one of those days.I'm not saying that the movie is flawless or that there were no negatives, sure they were. A cynic might even say that Avatar is a movie filled with crazy patriotic soldiers, bad dialog and a bunch of tree huggers. But who cares when you feel like you've just been injected with a doze of the most exquisite movie heroin. The only really negative thing about Avatar is that the movie is not meant to be watched in 2D or from you shitty TV screen, no matter how big it is. I'm already a little sad that I will never be able to see Avatar again, at least not in the right way, unless I go to the theater again.Oh wait, what's that ringing sound? Oh, it's the Oscar bells.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "mysecrets123",
            "reviewer_url": "/user/ur20928523/?ref_=tturv_usr_79_t",
            "review_date": "Dec 27, 2009",
            "full_review": "This is the most astonishing movie I have ever seen. First word I heard leaving the theater was 'amazing!' No doubt about it.I won't discuss the plot,but the plot is good, nothing can match the special effects of the 3-D.Here's the least you need to know:It is 'new age' all the way. It's all about 'we are all one with nature'.It's a long movie, about 3 hours to be precise. Be sure you have your snack in hand and your 'business' taken care of, just in case you don't have a 15 min break like I did. Sexuality was not much of an issue, the only thing remotely sexual was the 'hair-bonding' ritual.The ending was predictable from the start, but again an extremely enjoyable movie.Finally, the special effects were amazing. This you got to see in 3-D!!! You'll feel as if you are IN the movie after a few minutes. You'll be reaching for the floating jellyfish(tree seeds), dodging the flying dragon-birds...etc. I was so impressed that I felt as if it was all happening in front of my own eyes. I do not recommend watching this movie in 2-D. I believe that this movie was made to be viewed in 3-D. The movie is not only a movie but it will open your mind and make you reflect on your life. As I wrote earlier it's kinda \"new age vs modern world view\". I truly hope that you enjoy the movie. I know that I did. 3-D is a must !!! just a few extra bucks, believe me you won't regret it. the only thing that makes me sad :( is that I have to wait until late 2010 to buy the 3-D bluray. enjoy :)",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Abdulxoxo",
            "reviewer_url": "/user/ur106279729/?ref_=tturv_usr_80_t",
            "review_date": "Dec 22, 2020",
            "rating_value": "6",
            "short_review": "Visually astonishing",
            "full_review": "Avatar, in terms, visuals effects and overall aesthetics, it excels. The fictional world of Pandora is very well done. The many different animals, trees and how they connect with the Na'vis, and the Na'vis themselves are all truly spectacular. The CGI is outstanding. The score and cinematography are also amazing. But The plot is downright predictable and generic. Moreover, it is dragged out to an infuriating length. The characters are introduced well, but none of them are explored further, and the relationships between them lack any kind of complexity and depth.\nOverall, Avatar is a visually stunning sci-fi adventure, with good cast performances, amazing score and cinematography but suffers from formulaic story and one-dimensional characters.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "marco_dg91",
            "reviewer_url": "/user/ur16135531/?ref_=tturv_usr_81_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "9",
            "short_review": "Simply breathtaking. The King is back, baby!!!",
            "full_review": "Unfortunately, I had to watch it in 2D, but even with that, this movie was just brilliant. I think we all know the basic outline of the story by now, and I admit, some of the movie's flaws is that the plot is somewhat predictable, and that it had some cliché moments and some cheesy dialogue, but nevertheless, I thought the movie was overall fantastic. We all know the SFX are the best ever (everyone pretty much has said that, so why bother?), but what you don't know is that the way the film is executed actually carries quite an emotional punch that most people won't be expecting, and all of the performances overall are great, even Worthington's (which is the first film I've seen him in, by the way. Never got the chance to watch Terminator: Salvation, so he was a relatively new actor to me), but I can easily say that Zoe Saldaña was the best one, which brings me to my next point, and what I think is the highlight of the film: the na'vi. If you thought Gollum in the LotR films or the prawns in District 9 were incredible in how much emotion and realism they conveyed, just you wait 'till you see this film's blue humanoids. They're, without a shadow of a doubt, the best-looking CG characters I've ever seen. Not only do they LOOK real, they FELT real, and after a few minutes in, one could easily forget they were all actors in motion-capture suits. The na'vi showed more emotion, more expression and simply just more life than what most live-action actors have today. I hope the Academy Awards consider motion-capture performances from hereon out in the Acting categories, because they were just outstanding in this movie, and WAY better than most live-action performances we get today. And the action, of course, was also fantastic. Cameron just proved to people like Michael Bay that the King is back. Not just the battle scenes, but even some parts that were just, say, some characters flying around on their banshees were just a beauty to look at, since all shots just show how amazing the incredibly deep and detailed world that Pandora is. To the senses, it's the most stunning film I've ever seen. As for story and dialogue writing, it could've been better, it's not perfect, but this movie's really about how the story is executed rather than the content. Another highlight for me is, of course, just how deep and detailed everything in this film was, and being an artist myself, you could easily imagine just what an assault on the senses it was for me to witness such a beautifully created world that is Pandora. Ranging from its flora to its fauna, all things in this world are indeed alien, but also have a familiar sense to them from our world. One who's been watching Cameron for the past few years would know that he's always been into deep underwater exploration, and you can easily tell that a lot of what he saw down there influenced his vision for many of the things we see in this lush beauty of an ever-stretching rainforest.As for the film's score, I really don't get why some people are getting upset about it. In my opinion, James Horner gave us a tremendous score that fit perfectly to whatever was happening during the film. And yes, I even like Leona Lewis' song in the end credits.Many filmmakers out there think about CG effects and put no depth into the narrative or story, but that's not the case with Cameron. In this film, the special effects MAKE the story. He puts special effects and story in a blender, and meshes these elements up so well that what we get is one of the most unique films in history. My score: 8.5/10, and I think I'd probably give it a 9.0/10 or higher if I had seen it in 3D, and definitely a perfect 10 if I had seen it in an Imax 3D screen with the best seat in the hall, but then, we wouldn't really be speaking in that case about a movie, and instead a full-on cinematic experience, which is what makes me think that Avatar will become a classic; it's more an experience than a film, it's a journey to a new world where our imaginations are tested, and has achieved perfectly what a movie is intended for in the first place, at least of this genre: pure, out-of- this-world escapism.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ccthemovieman-1",
            "reviewer_url": "/user/ur4445210/?ref_=tturv_usr_82_t",
            "review_date": "May 25, 2010",
            "rating_value": "7",
            "short_review": "Typical Cameron: Dumb Story But Fantastic Visuals",
            "full_review": "Well, after all the hype - and a chance to see this for free on a Blu-Ray disc - it was an offer I couldn't refuse. In the end, and even though it's a long film (2 hrs, 40 minutes) I watched it all and wasn't surprised at much of anything story-wise. Like a lot of modern-day action films, they start off great but slowly become unraveled and during the last third of movie, you have to totally \"check your brains at the door,\" but this movie, overall, was fun to watch.For much of it, there were enough visual wonders in here, fantastic colors and special-effects to make up for Director/writer James Cameron's usual Liberal political bias and stereotypical characters. In many respects, you've seen this story before a number of times. In fact, if you've seen \"Dances With Wolves,\" you've seen \"Avatar,\" the main difference being the setting: instead of the Old West you have a futuristic planet. The story is basically the same, the one filmmakers love to present: the evil white military-like corporation men invade the peaceful natives for greed and profit.... and troubles ensue. Throw in the \"mixed\" romance you saw in \"Dances With Wolves\" and you have a good chunk of this story. Very little has changed except for the futuristic eye candy. Instead of the American Indian, we have the \"Na'vi,\" which are portrayed in a very similar light except for the blue skin, of course.The only creativity in this film is in the special-effects department, but - wow - what creativity! The visuals are the attraction to this movie, pure and simple. The amazing jungle scenery, bizarre bird creatures and illuminating small objects everywhere will dazzle you, especially played through a Blu-Ray disc and big HD set. The transfer is as sharp as any you'll see.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "deathtoll2001",
            "reviewer_url": "/user/ur10221248/?ref_=tturv_usr_83_t",
            "review_date": "Jan 23, 2010",
            "rating_value": "10",
            "short_review": "More than just a clichéd story",
            "full_review": "Avatar in 2D: Incredible movie. Amazing visuals. Beautiful story. Great action sequences.I absolutely would go to see it again. While the early movie does suffer from the same syndrome that is seen in so many movies, namely a rushed fake-feeling time-lapse of events in some areas, the final hour is absolutely worth it. I will add the caveat that my feelings are affected by my being a fantasy buff. The druidic religion of the natives, the landscapes, and the general story all hold to the fantasy mold. Including the heart-wrenching fate that awaits the good guys. But that isn't a bad thing. It's once in a generation, if that, that someone writes a story that breaks out of that mold.Avatar was a work of art as much as a movie. The immersion of sight and sound had me often on the edge of my seat. The performance capture used to film the movie lets the Na'Vi come to life in a way no animation can. The incredible eye for detail that went into this movie is astounding, both technically, and in terms of creating the world.It is a great joy to me to see a fantasy movie done so well. It is extremely difficult to capture the essence of a true epic fantasy in the traditional length movie. At approximately 2 1/2 hours, Avatar doesn't cut it inordinately short but neither does it deter all but the hardcore fantasy fans with its length.Overall I absolutely give Avatar 2D a 5 out of 5.Avatar in 3D was a bit difficult to get used to at first: glare on the frame of the glasses, things seeming to be out of focus at times, the fact that the screen does not fill the entire field of view. However, after a break-in period and the realization that some of the focusing is because it's not meant to be in focus, things improved. It pulls your view to a certain aspect of the scene, the same way you have to focus on a particular thing with your eyes. It's just disorienting at first since what you focus on isn't necessarily what they want you to focus on.Also, I noticed that a lot of the movement scenes early on seemed to blur the image, as if it was not updating fast enough to form a smooth image. Through the second half I did not notice this much at all, but whether that is because it wasn't there or because I was concentrating harder on the events, I do not know. I suspect I was trying too hard to see the 3D while I eagerly waited for the movie to progress, having seen it once already.Hopefully in the future they will improve the delivery mechanism (ie, the glasses) and make the experience even better. I look forward to taking the final step and watching it on IMAX 3D! I give the 3D aspect a 3.5 out of 5. It definitely added to the experience, but was disorienting, difficult to get into, and has a few annoyances yet to work out.Avatar in IMAX 3D blew me away, even after seeing the movie twice previously. I can't say if it was the fact that I had seen the 3D once previously, the IMAX screen, the different frame for the glasses, or all the above, but that was an incredible experience! I think the key is to not try to see the 3D, but to just let yourself sink into the movie. Filling the field of view and having that depth of field makes it easy to really get into the action and forget yourself.There's not really a whole lot more I can say about that. 8000-10000 (depending on the theater) watts of surround sound tops off something you're not likely to forget, at least until the sequel! The IMAX 3D experience gets an easy 5 out of 5.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "penandpaper52",
            "reviewer_url": "/user/ur5231934/?ref_=tturv_usr_84_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "6",
            "short_review": "Okay... torn between great cinema and a great movie",
            "full_review": "This is no doubt a great piece of cinema. The visuals are gorgeous and the effects are incredible and on a whole, this is by far worth the admission price.That being said, the plot is thin and the characters are thinner. The foreshadowing is often shoved in your face and there is little exploration into what could have been wonderfully unique characters. Essentially, the plot is the Last Samurai on a distant planet. The characters are stuck somewhere between honoring Native American culture and insulting it.If this were just some run of the mill Hollywood flick, those things would be easy to overlook--or at least forgivable. In a movie that was over a decade in the making, costing more than almost any other film, and introducing such glorious cinema, it's just a real shame that everything to do with the script was so carelessly put together.Again, see it. If these things don't bother you, you are very lucky and will end up having one of the best cinematic experiences of your life. If they do bother you, you'll nonetheless love the ride. But don't believe the reviews that don't see past the imagery. There's more to film than that.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "TheForgottenRealm",
            "reviewer_url": "/user/ur21100534/?ref_=tturv_usr_85_t",
            "review_date": "Apr 30, 2010",
            "rating_value": "4",
            "short_review": "boring and derivative movie for children",
            "full_review": "The only thing this movie did for me was make me soooo bored I actually started remembering the plot of FernGully. Which I hadn't seen in like 18 years. I couldn't even remember its name. When I arrived home I furiously searched the internet for this mystery movie that I had forgotten and that Avatar somehow reminded me of.Then I found it and realized that it's exactly the same plot, except that it's a movie for children - which incidentally AVATAR also is, it's just that it cost 500$ billion, or whatever, to make so they had to pretend like it was for adults, but it really isn't. It's a kid's movie, and a 2 hours too long one at that.Frankly, what surprised me most about it was that it gets such good reviews... from almost everyone. I'm going to sit and wonder why for a while.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "shanpanjwani",
            "reviewer_url": "/user/ur15848259/?ref_=tturv_usr_86_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "Cameron's return to greatness; One of the best cinematic experiences in modern film history.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "AxGr70",
            "reviewer_url": "/user/ur22741715/?ref_=tturv_usr_87_t",
            "review_date": "Jan 22, 2010",
            "rating_value": "10",
            "short_review": "Outstanding entertainment and visually awesome",
            "data-review-id": ""
        },
        {
            "reviewer_name": "j-burke-2",
            "reviewer_url": "/user/ur15652788/?ref_=tturv_usr_88_t",
            "review_date": "Dec 28, 2009",
            "rating_value": "10",
            "short_review": "Stunning, epic cinematic experience",
            "full_review": "Without a doubt, this was the single most amazing display of movie making that I or my family have ever watched. For all of you out there criticizing this movie because of the cartoonish characitures, or the simplistic plot, or the liberal pontification; you are completely missing the boat. You literally cannot see the forest for the trees.I will admit, entering the movie I was trepidatious over the reported 3 hour running time, but the movie flew by quicker than many 90 minute yawners. We will be going to see it again in a couple of weeks.The cool factor was off the charts. The visual stimulation from seeing it in 3D was something I'd never experienced at the movies before. The movie enveloped me and washed over me. I felt as though I was on Pandora. Incredible.Yes the imperialists were cartoonish, but they often are in real life too. The plot was simple, but that simplicity enable the viewer to focus on everything else that was going on.The word I kept repeating for hours afterwards was \"Amazing\". This is the first movie that I've given a \"10\" rating on my vote.My wife and my 11 year old son agree, you absolutely owe it to yourself to go see this movie. You won't be sorry you did.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "springsunnywinter",
            "reviewer_url": "/user/ur10583368/?ref_=tturv_usr_89_t",
            "review_date": "Dec 15, 2009",
            "rating_value": "10",
            "short_review": "Avatar is a masterpiece & a breakthrough in cinema",
            "data-review-id": ""
        },
        {
            "reviewer_name": "hellojaeson",
            "reviewer_url": "/user/ur24172176/?ref_=tturv_usr_91_t",
            "review_date": "Dec 20, 2010",
            "rating_value": "6",
            "short_review": "Beauty = Skin Deep",
            "data-review-id": ""
        },
        {
            "reviewer_name": "akbarnali",
            "reviewer_url": "/user/ur3440756/?ref_=tturv_usr_92_t",
            "review_date": "Dec 28, 2009",
            "rating_value": "10",
            "short_review": "The Definitive Film On Native Americans and Manifest Destiny?",
            "data-review-id": ""
        },
        {
            "reviewer_name": "LiamMaru",
            "reviewer_url": "/user/ur7171782/?ref_=tturv_usr_93_t",
            "review_date": "Jan 9, 2010",
            "rating_value": "6",
            "short_review": "Not bad, but largely over-hyped and unoriginal",
            "full_review": "Seriously: 1. The soundtrack - Pretty standard 'epic-jaw-dropping-orchestra' fare, nothing particularly new here.2. The effects - OK. Let's be clear: I'm a professional Software Engineer with a hand in computer graphics (specifically, high end visualization of geological volumes) so I've made a lot of pretty pictures myself, and know how a lot of Avatar was made. I've seen a lot of CG, some of it good, a lot of it bad.The effects in this movie are nice, and large parts of this movie are basically render porn, specifically some of the volumetric effects (the water, smoke, dust), some of it isn't that impressive (some of the surfaces just look downright plastic, particularly that huge gunship thing), and some of it REALLY isn't that impressive (external shots of the spaceships at the start made me cringe).If we look at it as a matter of scale, this movie is hardly ground breaking: For $237,000,000 you can buy a LOT of computing power. Throw enough money, time and manpower at any computing problem and you'll get something purdy.If you want to talk about pioneers, read about the founder of Pixar, Edwin Catmull; he is one of the guys who made hard things easy. This movie looked nice, but it DID cost $237,000,000 so if it did look crummy, someone would have probably been kneecapped.3. The 3D - 3D isn't new, I don't know why people are so excited. The process they used is a good many years old, and has been used for far less hyped movies. At the start of this movie I went 'wow, this is interesting' and about 10 minutes later I stopped caring, like everyone else I saw this movie with. Kudos though for not making half the audience vomit with nausea.4. The storyline - I just read that James Cameron wrote the script in two weeks. I wonder if he wrote if after watching Fern Gully? The storyline has a pretty heavy liberal bias, 'military bad, environment good, let's all hug a tree' type stuff, been there done that. It's neither particularly insightful of thought provoking; if you believe this stuff you'll swallow it whole, if you hate it you'll really hate it, and if you're after something thought provoking (duality of man), you'll be left severely disappointed.The other problem I had was that at times the need for visual spectacle overtook both storytelling and pacing in priority, a large portion of Avatar feels like a a tech demo. I've sat through enough tech demos to know when I'm watching a finely tuned fly though of a rendered scene to show off all the sub-surface light scattering and how well the volumetric effects handle the 200 light sources. subtract some of the rather protracted visual scenes and there could have been some decent dialog, and perhaps even an original storyline. I count this as a missed opportunity.5. Etc - I got a cool pair of glasses.In summary, this movie cost $237,000,000, and it's pure spectacle. The soundtrack is forgettable, the storyline would get you a C+ in junior high school (or accused of plagiarism, have you seen Pocahontas?), and a lot of the visuals feel contrived to the point of a tech demo. It's not completely bad, but it's not spectacularly good. I did get to keep those 3D glasses though.I think it's a C+ at most.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "thekrikke",
            "reviewer_url": "/user/ur22535510/?ref_=tturv_usr_94_t",
            "review_date": "Dec 16, 2009",
            "rating_value": "10",
            "short_review": "Transcendent and amazing experience",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Koettbullen",
            "reviewer_url": "/user/ur20559011/?ref_=tturv_usr_95_t",
            "review_date": "Jan 2, 2010",
            "rating_value": "7",
            "short_review": "Avatar is fantastic!",
            "full_review": "Simply put, Avatar is an epic. For it's 2 & a half hour run time, I sat mesmerized, until my eyes watered and I realized I wasn't blinking. By the time it was over, I had a headache as a result of over stimulation. Now I feel like I need to wind down and watch something like Godzilla Vs. Monster Zero to feel normal again.Avatar is a spectacle film, with a lot of action and visuals. The story is simple and the anti-war message is very obvious. But in the long run, you get a compelling movie out of it that gains momentum all the way into its final act.James Cameron always manages to get his actors to seem natural. You believe the characters, because the dialogue is not overwritten. My favorite is Stephen Lang who plays a Colonel who's hellbent on pillaging the alien world. He ranks up with one of the greatest villains I've seen in recent times.This was the first major 3D movie I saw. It didn't use any gimmicks. Usually, you would expect objects to fly straight into your face, but instead it used the 3D as a depth of field to see into the screen and immerse yourself in the environment. I felt like I was there.History has repeated itself. In the 1950's, 3D and lavish color widescreen \"Cinemascope\" epics enticed people away from their Televisions, to get off their asses and come back to the theater. Today, the convenience of Netflix, downloading movies, DVR, and movies coming out on DVD/Blu-Ray within a few months of their theatrical release, for little over the same cost, loaded with extras, it makes you wonder why go to the theater at all. But the answer is here. Avatar made me glad to leave my house and saved the movie-going experience.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "leprutz13-1",
            "reviewer_url": "/user/ur14984420/?ref_=tturv_usr_96_t",
            "review_date": "Dec 25, 2009",
            "rating_value": "1",
            "short_review": "People are weak minded.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "chefmbd",
            "reviewer_url": "/user/ur17851363/?ref_=tturv_usr_97_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "10",
            "short_review": "Went with low expectations, but LOVED it!",
            "full_review": "I went today with my husband and two sons simply because I didn't want to be left out. After all, I thought it was just a bunch of blue aliens jumping and flying around. I also do not enjoy wearing the 3-D glasses as they give me a headache. Then I saw that it was 2 hours and 40 minutes of wearing those glasses and watching blue aliens. Needless to say, I had extremely low expectations. I'm not one of the people that has been following and anticipating this movie for years.As it so happened, I absolutely was mesmerized by this movie. I loved the plot. I'm sitting there thinking someone had to have been on crack to come up with the world of Pandora due to how creative it was. I really want to go there and fly on those dragon-like things. I thought the transformation of Jake was so cool. The 3-D effects were amazing, but I would have definitely enjoyed this movie without it.In fact, I have only seen one other movie more than once in the theatre and it was Titanic...another James Cameron movie. I can tell you that I will see this one again and I can hardly wait to buy the Blue-Ray disk and see all the extras on how they made the movie. That will be awesome!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "aerovian",
            "reviewer_url": "/user/ur10796108/?ref_=tturv_usr_98_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "10",
            "short_review": "Nobody in the Western world should miss this movie.",
            "full_review": "I've seen a great many movies in five decades of life in this \"age of media\", and I've seen quite a pile of IMAX 3D features as well. Within the latter domain, this movie is really nothing special. I mean, yeah, it's VERY cool if you've never seen live-action IMAX 3D before. All around me during the screening I could hear the new initiates in the audience experiencing the giddy delight that strikes so many of us on our \"first time.\" But what was very apparent to me as a seasoned IMAX aficionado was the difference between the live-action scenes and computer-generated ones. Though still spectacular by virtue of the sheer screen size, CGI 3D still has a long way to go to rival what IMAX cameras can do.That said, the tale itself is simply wonderful. Yes, as other reviewers have remarked, it's an old and well-worn storyline. But then, as many film reviewers have pointed out time and again, there are really only a couple of dozen different basic story lines in existence to begin with, so if you've been around the block a few times as I have, they all look pretty familiar in one way or another. However, what sets Avatar apart is that it an essential parable for our times . . . and if you are TRULY willing to look and listen, you will find it resonating within you at a level that goes far, far beyond the messaging of messaging of even the best of Hollywood's standard film-fare. Cameron has a way of reaching to an emotional depth in the sapient viewer's soul that nobody else in cinema comes close to. And upon this power he overlays a subtle yet vital message to which we simply must pay attention. For that reason alone, Avatar is an absolute must-see for all.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "SebaZava",
            "reviewer_url": "/user/ur4610211/?ref_=tturv_usr_99_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "An epic masterpiece",
            "full_review": "James Cameron has never directed a bad - or even mediocre - motion picture; this is the guy who has brought us such classics as the first two Terminators, Aliens - one of the best sequels of all time -, True Lies - exceptional action movie - and, of course, Titanic. That's why, despite some negative buzz, I was always pretty sure his latest endeavor, Avatar, was going to be something else. Maybe not a \"game changer\", as many - including Cameron himself - have been saying, but certainly something that we haven't seen before.Well, I still am not sure if this is a \"game changer\", but it certainly is \"something else.\"Avatar is the most visually impressive and most immersive motion picture I've seen in some time. Not since Peter Jackson released the last of the Lord of the Rings movies has someone marveled me in such an amazing way, transporting me into a different land where - apparently - anything is possible. So maybe the story Cameron is telling is not 100% original, but the way in which he tells it certainly is. I haven't seen the movie in 3D - I will on Saturday and a review will follow - and I imagine it must be impressive, but even while watching it on 2D I can't imagine anyone not being marveled and feel inspired by what Cameron has created. This is one epic, epic film - an event and an experience unlike anything I've seen this year.Performances are quite solid. The real scene-stealer is Stephen Lang, whose Quaritch is one of the most effective villains I've seen in some time. We know he is the villain not only because the screenplay tells us so, but because Lang makes the character his own, a real sonofabitch who knows no compassion and no mercy. He never goes over-the-top and avoids turning his character into a caricature. (Although he is larger-than-life.) Sam Worthington is pretty good as Jake Sully - although his \"American\" accent is less-than-stellar - and Sigourney Weaver is memorable as Dr. Augustine. On the other hand, Zoe Saldana has a tougher job - Weaver and Worthington appear both in human and Na'avi form, but Saldana's character appears only as the former. No problem, though - her performance - with the aid of performance capture - is strong enough to make the audience believe in her. Like Gollum in the Lord of the Rings pictures, the audience believe in the Na'avi - we believe they are real characters who breath, cry, laugh and can even die, not just a bunch of pretty-looking cartoons.But what about the spectacle? Despite all the drama and the romance, Cameron has actually managed to deliver action-wise - if there is someone in Hollywood who truly knows how to portray the right balance between action, special effects, character development and story, it is Cameron. Simply put, the film is breath-taking. Despite being approximately 60% CGI, there was never a moment in which I was aware that I was watching big, powerful computers at work. There isn't one - not a single one - fake-looking shot. Pandora is simply beautiful, and all the creatures - including of course the Na'avi - are amazing and totally believable. The way Cameron has populated his world is, simply put, worthy of applause - every single plant, creature, monster, predator, everything is credible and awesome-looking, showing that Cameron is talented at both creating great stories and characters and using his vivid, visual and fantasy-based imagination.And there is the difference between a masterpiece like Avatar and a mindless product like Transformers 2: the viewer actually believes in all the computer-generated creatures, characters and locations, accepting them as real and believing they actually exist, even when they appear on-screen at the same time with flesh-and-blood characters. Unlike the soul-less Michael Bay movie, Avatar has spirit and charm, and never bores. Yes, there is action, but it is not mindless because there are incredibly high stakes at hand, and because we feel for the characters. There are a lot of ridiculously tense moments in Avatar because of this - on the other hand, I didn't even flinch while watching Transformers 2. (And if I did, it was because the action scenes were almost incomprehensible.)Since I haven't seen the film on 3D, I really don't know if Avatar truly is a \"game-changer\" or not. Why I do know, though, is that the movie is one of the most imaginative, visually-arresting and gripping motion pictures I've seen in years, and quite possibly the best film I've seen this 2009. Avatar is not simply a \"movie\" - it is a experience, something that quite literally has to be seen to be believed. It boasts a smart screenplay, it has believable and sympathetic characters, it's got the most believable and awe-inspiring special effects ever seen on the big screen, and it contains more thrills and emotions that any other film this year. I don't care that Cameron took 12 years to make this film - the final product was definitely worth the wait. I just hope that all the rumours that say Cameron plans to shoot a sequel are actually true. This is one rare case in which I just wish a second installment is actually released. (Hopefully, it won't take 12 more years.)",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Horst_In_Translation",
            "reviewer_url": "/user/ur3914439/?ref_=tturv_usr_101_t",
            "review_date": "May 17, 2017",
            "rating_value": "6",
            "short_review": "Neither a natural disaster nor a real force of nature",
            "data-review-id": ""
        },
        {
            "reviewer_name": "alanyuu",
            "reviewer_url": "/user/ur5147808/?ref_=tturv_usr_102_t",
            "review_date": "Dec 28, 2009",
            "rating_value": "10",
            "short_review": "Movie to watch, see and learn",
            "full_review": "Avatar is a movie about two races, usually covering both the human and another race on another planet. Its simply outstanding, it has a plot, it has a structure, it has effects that are done so excellently, you'd definitely imagine yourself in the movie. Learning how to talk, learning how to feel nature, learning how to fly and heroic love, all of these are all present.Loved it, loved it, simply loved it.The cast is simply mixed but appropriate. The lady from aliens plus some new talents add to the already excellent finished product.The musical score is simply beholding. You get into the music and it rocks the whole time you are in the theater.Overall, and for all of the above facts, I give it a 10 vote!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "dbborroughs",
            "reviewer_url": "/user/ur3079504/?ref_=tturv_usr_103_t",
            "review_date": "Dec 26, 2009",
            "rating_value": "6",
            "short_review": "Good, but far from the next step in entertainment since it borrows so much from what has gone before",
            "data-review-id": ""
        },
        {
            "reviewer_name": "jammerknight",
            "reviewer_url": "/user/ur41191320/?ref_=tturv_usr_104_t",
            "review_date": "May 11, 2022",
            "rating_value": "9",
            "short_review": "Groundbreaking cinema",
            "full_review": "I've always enjoyed this film, following the release of the trailer for the second avatar film I decided to give this a rewatch to see if it has 'aged' like many CG heavy films do after 5-10 years and I was pleasantly surprised by how well it holds up.There are certain shadows, textures & lighting which look a bit old now but the rest is still stunning to look at.From a story point of view this is one of my favourite type of films with the big action set piece & the underdog coming out on top. I really enjoy the world building.My main critique of this film is the rushed ending, it feels as though the last 30 minutes some BIG things happen that would impact our characters but this is heavily glossed over which I believe can be put down to the runtime.Overall I give this film a 9 because of the quality of the film craft, the beautiful soundtrack and the story isn't 'bad' just rushed at the end. There is also great rewatch ability to this film which helps its rating. I'm hyped for the new film!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Al_X",
            "reviewer_url": "/user/ur4950322/?ref_=tturv_usr_105_t",
            "review_date": "Dec 15, 2009",
            "rating_value": "6",
            "short_review": "Infantile film, sure hit",
            "data-review-id": ""
        },
        {
            "reviewer_name": "iamthegreenfairy",
            "reviewer_url": "/user/ur11558751/?ref_=tturv_usr_106_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "5",
            "short_review": "I might be the only one, but...",
            "full_review": "I was not blown away by this movie like everyone else seems to be. First, the good stuff. There are some good actors in here, especially the actor who plays Jake (though I might be biased, because he was pretty hot), and they all commit to what they're doing and make it believable. As everyone says, the graphics and visuals are pretty freakin' awesome (as well they should be, with the budget of this movie). The world that Cameron creates is stunning, mesmerizing, and pure: the special effects are amazing. Like many, I saw it in 3D and it was good old fashioned movie-going fun. Yay! Okay, now for the not so good parts. As others have stated, the storyline/plot is a little lacking. I had trouble understanding the motivations of many of the characters. Ah, yes, character development - that would have been nice, too. Don't expect any. Yes, it's a recycled and re-used plot: clichéd and often predictable. It seems reminiscent of many great classics, my favorite being \"Star Wars.\" Now I'll be the first to admit that the mythical structure of \"Star Wars\" was not completely original, but at least it seemed Lucas \"made it his own\" (to quote American Idol?) with his original characters and unique setting. \"Avatar\" is practically plagiarism (one line in particular made me want to shout \"THE FORCE!\" in the middle of the movie). Also- we get practically no character background at all, so we have no idea what makes these people tick (perhaps there would have been more if the edited version wasn't already a staggering 2 hrs 40 min.). Instead, we get one-dimensional, stock characters that had me rolling my eyes underneath my uncomfortable and overpriced 3D glasses. Lastly, the film is doused with lessons in morality from Mr. Cameron; it is a blatant criticism of US foreign policy. Not everyone will pick up on this, which I understand, since most of us want mindless entertainment at the movies. But upon closer review, I don't see how some people cannot see it. One of the \"evil\" characters actually says: \"We'll fight terror with terror!\" (Though mind you, they are attacking a planet filled with peaceful inhabitants who have never attacked them, for the simple quest of obtaining a precious metal called...unobtainium...::rolls eyes again::) Now I don't mind a little political satire here and there, but it seems misplaced in what is seemingly intended as a mindlessly entertaining popcorn flick.To give an example of the poor story-telling and lack of motivation: the \"evil\" humans are attacking the peaceful planet of Pandora in hopes of getting more \"unobtainium\" (gah it's so cheesy) but Cameron never bothers to tell us WHY. It is barely even mentioned. Is it just pretty and shiny like gold? Or, as another reviewer brilliantly pointed out, this stuff could save lives on Earth for all we know. It is never explained and the movie makers just assume you will accept it and not care what the reason is. I was actually really glad to come to IMDb and find there were others who felt the same way. I don't think it was an awful movie, I just don't think it's worthy of the enormous praise that seems to surround it. Should you see it? Yeah, sure, it's pretty entertaining I guess. And if you are into graphics/special effects, and/or don't mind gaping plot holes, then you'll probably love it.Bottom line: Remember when Lucas revamped the \"Star Wars\" saga with the three new prequels, and instead of telling a great story with interesting characters like he did with the original trilogy, he got so obsessed with graphics and special effects that it pretty much ruined the whole movie? Yeah, it's kind of like that. I guess they stole that from \"Star Wars,\" too.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "witerary",
            "reviewer_url": "/user/ur18001676/?ref_=tturv_usr_107_t",
            "review_date": "Jan 16, 2010",
            "rating_value": "10",
            "short_review": "A spectacular movie with so much heart",
            "full_review": "For the first time in my life as a writer, I won't be writing a lengthy paragraph.When I saw the movie, I cried for two reasons. One, because I am also an artist, and the sheer beauty of its digital imagery stunned me to tears. Second, with a lesson in environmental concern, the simple story of a lost tribe and their survival moved me so much. I fell in love with such imaginary, admirable characters (both human and Navi). I fell for a sci-fi story with a heart.So allow me this reluctance to elaborate further. You just have to see it to believe it. Believe that you are in Pandora even for two fleeting hours, and it will be more than worth the trip.Thank you, James Cameron. Once again, you are king of the world.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "jjack929",
            "reviewer_url": "/user/ur22081801/?ref_=tturv_usr_108_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "Unbelievable (Long review, one minor \"spoiler\")",
            "data-review-id": ""
        },
        {
            "reviewer_name": "beenhavingfun",
            "reviewer_url": "/user/ur17175987/?ref_=tturv_usr_109_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "8",
            "short_review": "Avatar is Original",
            "full_review": "I just saw it and I had unbelievable expectations for it(the kind that expected the next Star Wars out of it). And I was not disappointed in the least. I had read many comments about it being Dance's with Wolves in Space. I knew all the so called critical badmouth of the story. I have to tell you that I not only loved the characters, I loved the story as well. Something that many people forget is that there is a difference between plot and story. Plot is the generalized events that happen within a story. \"A person learns the ways of a race he originally looked down upon or did not understand. He ends up joining them in a battle against the people who he originally identified himself with.\" That is a plot very cut and dry. There are many films with similar plots, in fact more than you would think. Does this plot line sound familiar to you? Guess why? Because you saw it in a little film I like to call 'District 9'. The man in District 9 looks down upon a race he does not understand, but as he becomes one of them(parallels Jake Sully in Avatar) he begins to identify with them and in the end fights with his own people. This film hailed by every living man and woman as original is almost identical with Avatar in plot. What you misunderstand is that what makes a film original is not it's plot but the story that carries the plot. District 9 is original because you have never seen Science fiction come to life as if it could happen. The story(the plots delivery if you will) makes all the difference. So now that we know the difference between plot and story lets look at why Avatar is original. While the story may draw parallels to Dances and Pocahontas it is by no means a copy. Never have you seen a paraplegic marine get his legs back by living through a organically grown alien. Never have you visited Pandora and explored such a vast and 'original' world. Or felt the thrill of flying on a dragon beside an ever increasingly attractive alien princess. The originality in this story is incredible for one reason alone, that the story takes the audience member on a journey with the character Jake Sully. We truly get to discover this amazing new world with him and share his excitement. Many people have said that this film has no character development, I beg to differ, I believe it adds a new depth to character development in cinema. How do we get to know people in real life? By sharing our time with them and laughing along with each other. Instead of this film telling you what to think of each character through their words, it allows us to share the events with the characters. As Jake learns to fly, we get the feeling of learning to fly along with him. The love story comes naturally because as we experience these things with Sully we too grow attached to Neytiri. As it has been said, this film is an experience. It is a journey we have never taken before and will wish to take again. That is why audiences adore this film, because it is original and we just aren't used to originality.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "manusankar_e",
            "reviewer_url": "/user/ur135045681/?ref_=tturv_usr_110_t",
            "review_date": "Aug 21, 2021",
            "rating_value": "9",
            "short_review": "VISUAL TREAT what else!",
            "full_review": "Yes Avatar is a movie which standouts by technical brilliance. It might don't have the best story, but all it provides is a visual treat. Wonder that they have created an authentic language for a movie. It's been 11 years still, it still stands tall on visual effects and moments. There aren't many films which drags you to a whole new world and Avatar Does Exist!Waiting for the second Part....",
            "data-review-id": ""
        },
        {
            "reviewer_name": "blhemenway",
            "reviewer_url": "/user/ur22635408/?ref_=tturv_usr_111_t",
            "review_date": "Jan 2, 2010",
            "rating_value": "6",
            "short_review": "Superb visuals but...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "robert-masaryk",
            "reviewer_url": "/user/ur22575367/?ref_=tturv_usr_112_t",
            "review_date": "Dec 22, 2009",
            "rating_value": "10",
            "short_review": "It's 3 days after I left the cinema... already got the tickets for a 2nd visit",
            "full_review": "I've never done this before... Even if I am absolutely aware of my poor level of English, I simply had to register. Just to be able express my feelings and to leave my vote here.This movie is something I didn't expect. After all those \"blockbusters\" I have seen in the last time, no one could convince me about the fact, that this flick will be something different. Entering the cinema, I was really skeptic and awaited just another boring shooter with some expensive computer animations.Well.. But then it happened. After just few minutes, I was completely sucked into the world of Pandora, I was there, breathed the air, enjoyed the extraordinary nature. I fell in love with the Na'vi and with their lifestyle, their world.For those 166 minutes, I completely forgot everything else, my work, troubles, everything. This was the best experience, the best feeling I had from a movie ever! Actually the movie was too short for me, even after those almost 3 hours I still wanted more of it, can't describe my feelings.Leaving the cinema, I had tears in my eyes... couldn't stop them. I was just sad that I have to return back to Earth... Pandora was well... go and see it people and maybe you will feel the same I felt!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "gunners_fan-657-244180",
            "reviewer_url": "/user/ur22831727/?ref_=tturv_usr_113_t",
            "review_date": "Feb 9, 2010",
            "rating_value": "6",
            "short_review": "Most over-hyped film in history",
            "data-review-id": ""
        },
        {
            "reviewer_name": "nerdgasm1129",
            "reviewer_url": "/user/ur22346091/?ref_=tturv_usr_114_t",
            "review_date": "Dec 24, 2009",
            "rating_value": "10",
            "short_review": "One of the best films of the year...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "dupfeifer",
            "reviewer_url": "/user/ur22522253/?ref_=tturv_usr_115_t",
            "review_date": "Dec 21, 2009",
            "rating_value": "7",
            "short_review": "Enthralling and unforgettable. A theater experience I'll remember forever",
            "full_review": "Avatar is to my generation of movies what 9/11 was to my generation of tragic events that shook the world (I'm 16), in that is an experience I will never forget. When I am much much older, I will still be able to look back on this very night and remember everything about it; where I was, who I was with, how old I was, and, most of all, how amazed I was at what was happening before me. This all may sound like a bit much to say about one movie, but believe me. This is an event, folks.Many people have compared Avatar to Star Wars, saying that it had the same effect on audiences today as the latter had on its audience back in '77. They're right (to a certain extent, obviously). What James Cameron has done with his latest project is taken a simple enough story, and poured his heart, vision and imagination, and a couple hundred million dollars into it. The result blew me away in a way I didn't think was possible with movies today. I really thought we had seen it all. Leave it to the one and only Cameron to prove me wrong on that.The level of detail in every plant, creature, and environment is a new landmark in the world of cinema. It really goes to show that anything is possible in the movie world, and it takes a movie like Avatar to remind us of that in this day in age when audiences are so used to getting huge overdoses of special effects in their movies, and show us why we love going to the theater so much. Because, like I said before, anything is possible in a film. If Avatar doesn't make you realize that, then I can guarantee you that nothing else will.Avatar is every bit the movie I was hoping it would be. It lived up to and surpassed all the hype and I can't wait to see it again. What makes this movie so special is that you can watch it again and again and still be amazed by it, unlike some films where the impact is never the same after the first viewing. Obviously the effect of Avatar on its audiences will be much different after their first viewing, but it will always be an incredible experience.10/10",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Jigsaw_At_The_Disco",
            "reviewer_url": "/user/ur9958018/?ref_=tturv_usr_116_t",
            "review_date": "Jul 10, 2010",
            "rating_value": "2",
            "short_review": "Really Don't Understand the Reviews",
            "full_review": "Avatar is a poorly written, and poorly acted animated movie. James Cameron directs Avatar like he would a TV movie. There's no real depth and no real emotion. The special effects aren't even all that great, and the 3-D is absolutely, 100% terrible.There's no \"experience\" while watching Avatar. It's like watching an animated film. I could hardly sit through it, but I spent a lot of money for the 3D so I forced myself to stay. The entire movie, aside from a few action sequences, is incredibly boring. Mostly because I don't have any reason to care about any of the characters on screen because they are also boring. I recommend that if you're going to see this, get it on DVD, don't waste your money on 3D. It's a cheap gimmick and I really hope it goes away. Avatar utilizes the 3D in the worst way, I felt like I was looking at a pop out book that I wasn't interested enough to finish.I don't really feel like there's much else to say. Avatar is just an extremely lame movie.*/****",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Sleepin_Dragon",
            "reviewer_url": "/user/ur15311310/?ref_=tturv_usr_117_t",
            "review_date": "Dec 12, 2022",
            "rating_value": "9",
            "short_review": "A cinematic triumph.",
            "full_review": "Avatar is the kind of film that makes a cinema visit worthwhile, I saw it 13 years ago, and it lived with me ever since. It is of course known for its sensational visuals, but it is so much more than that.It's a great storyline, I love the concept of the planet, The Avatars, Jake's story, it's just captivating.It's moving, exciting, dramatic, it crosses over so many genres, it's the kind of film that takes you away from whatever you have going on.You still cannot help but be blown away by the visuals, you could say it's arthouse in the mainstream, but it's more than that, this film was a game changer, the visuals even now are spellbinding. The animals, forests, effects are all tremendous, they've aged pretty well also.Three tremendous performances, which have all always stood out for me, Sam Worthington, Zoe Saldana, and of course Sigourney Weaver.I knew we'd get a follow up, I just didn't think that we'd be waiting 13 years for it, I can't wait to see it.Glorious, 9/10.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "venki-kumar",
            "reviewer_url": "/user/ur21227797/?ref_=tturv_usr_118_t",
            "review_date": "Jan 17, 2010",
            "rating_value": "10",
            "short_review": "$1.6 Billion... **** on that!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "lee_loo@hotmail.com",
            "reviewer_url": "/user/ur1823446/?ref_=tturv_usr_119_t",
            "review_date": "Dec 27, 2009",
            "rating_value": "10",
            "short_review": "Avatar is a brain massage, that you will never forget !",
            "full_review": "Avatar, the movie that turns into a world !I Would like to share the joy I have watching this movie over and over (twice in 2D and once in 3D).Avatar is really hitting the brain, it makes you feeling so good, but unfortunately, so sad after quiting the theater, you just want to stick next to the Na'vi on Pandora.I think that everyone that has an heart will be affected by this movie, and will feel very sad on earth after this !Enjoy the one of the best movie ever !!!The actors are playing very well, the music is epic, the tears will just flow on your face during the movie !ney-tiri@live.com",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Smells_Like_Cheese",
            "reviewer_url": "/user/ur1293485/?ref_=tturv_usr_120_t",
            "review_date": "Jan 14, 2010",
            "rating_value": "10",
            "short_review": "James Cameron, welcome back!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "hellothisisanuj",
            "reviewer_url": "/user/ur22560309/?ref_=tturv_usr_122_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "10",
            "short_review": "A movie to go down history!",
            "full_review": "To me no man can be gifted more and gifted better than the ability to imagine, create, structure, and produce thoughts against convention or any degree of sanity; the best that a man can ever do is think, and make an audience experience his thoughts and his world in a way he deems best. The only work of James Cameron that I loved till this evening was the Judgement Day. It was slick, it was futuristic and it was everything we wanted in the early nineties; Titanic was stupid, Titanic was glossy and borrowed in ideas, and Titanic was everything commercial cinema wanted in the late nineties. Today, I watched the best movie I've ever enjoyed in my twenty years of life, the only movie that got me to the edge of the seat, clapping and smiling widely for 2.5 long hours, the only movie I thought I felt goosebumps until 20 minutes outside the hall, and the only movie that was special enough to make me hold my pee in and consider taking a leak in my pants, fearing I might miss a second of this cinematic brilliance.They say the only reason Avatar's working is because it's got the most brilliant effects but can't afford an enthralling plot line, I say thats bullshit. The only movie I think came extremely close to Avatar was The return of the king, and the plot line there wasn't as much of an original script as a screen adaptation of one of the most popular literary works in history. Avatar is original, avatar doesn't feel futuristic, it's like a totally new world that is so believable not because of of the effects but for the totally incredible concepts that Cameron produced and delivered patiently and with the prowess he's acquired over the years. There have been movies, documentaries, commercials, infomercials on the way the humans are filthiest race ever, but never has a movie pulled it off as this. The best part about it is that the creatures (strangely they never make a very strong mention of what they're called), are so emotive, so real and so much more human than the human characters in the movie, that your heart goes out to them and you feel the stab in your chest when things go wrong. Avatar is unachievable and irreplaceable in cinematic history. It's epic, but not a revolution since it's so brilliant that it's almost improbable for a movie to follow-up to what Cameron's achieved. It does have plot lines dissolving in the most predictable climaxes, and I'm glad it's done that way and originality for the sake of originality is not attempted. The movie reestablishes our belief in love, life, hope, power, energy, and magic, and in the strongest way makes us question- What really went wrong with us?I have no idea how the guy produced and held such insane creativity inside his head for 3 long years while creating this epic, and still managed to keep it sane,",
            "data-review-id": ""
        },
        {
            "reviewer_name": "jg_antunes",
            "reviewer_url": "/user/ur2022569/?ref_=tturv_usr_123_t",
            "review_date": "Jan 26, 2010",
            "rating_value": "6",
            "short_review": "I must be fixed, I didn't liked Avatar",
            "full_review": "Well, I have to say I'm not exactly an enthusiast of this movie. James Cameron does it again and is able to create a huge blockbuster that everyone seems to like, that seems to be carved to do big in the Oscars but again I'm left with a bittersweet taste that this will not have, like Titanic, a very long life in the top of the best movies. For me the movie seems to try to disguise the simple plot with a wide variety of computer graphics (not as amazing as I thought) and making it long, really long, so that it can leave us numb. Then they put all those 3d stuff flashing that is just pure evil to leave you amazed. But if you look behind the cosmetics you'll see a simple and uninteresting movie. The movie reminds a bit Miyazaki but without the passion, without the creativity, and embedded in action and corny scenes. Well maybe I'm broken. Am I the only one who didn't like this movie?",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Hyperboievr",
            "reviewer_url": "/user/ur10385460/?ref_=tturv_usr_124_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "10",
            "short_review": "James Cameron has done it again.",
            "full_review": "Avatar, set in the far future, is the story of wounded ex-marine Jake Sully (played by Sam Worthington). Sully is handicapped and cannot walk anymore, but is offered a deal that would change his life forever. Space travel is common and a mining mission is employed on an alien planet known as Pandora. The planet is populated by a race of indigenous and environmentalist extraterrestrials known as the Na'vi. Their main village rests upon the richest deposit of the substance that the humans are trying to mine, but the population simply refuses to re-locate. Colonel Quaritch (played by Stephen Lang) introduces Sully to an operation in which he will control an external body called an Avatar, which is his DNA mixed with the DNA of a Na'vi. Sully's Avatar is transported to Pandora in an effort for him to befriend the Na'vi, gain their trust, and eventually find a desire that could get the aliens to relocate. While learning the Na'vi culture and language, he bonds and falls in love with Neytiri, the daughter of the Na'vi king and queen. Sully switches sides and eventually joins the aliens in a fight to save the stunning beauty of Pandora.One word may have popped into your mind after you read my plot summary: Pocahontas. Yes, Avatar does draw many parallels to the Pocahontas legend, and simultaneously embeds strong environmentalist messages into the story as well. The story was not the most original ever created, and it is not meant to be. The simplistic story adds to the epic tone of the film that slowly creeps its way in as the climax builds up to its finale. It is true that the plot is something we have all heard about, but never has it been presented in this manner. By the end of the film, the satisfaction one garners after the grand finale exceeds that of every Lord of the Rings film. This is classic storytelling, in James Cameron's simple yet powerful directing style. Although Avatar may seem like the average action flick of today, many of Cameron's old-time trademarks are clearly evident. There are plenty of rolling feet shots, notorious one-liners from villainous characters (like those found in Aliens, True Lies, and Terminator 2) and the action flows very nicely in true Cameron style. The writing was also very nostalgic. Cameron does not rely on complex, mind-wrenching dialogue to tell his story. The romance was well written, and character development is clearly evident as Jake Sully undergoes his transitional phase on Pandora. Some people criticize this Avatar's dialogue for coming out as a bit clichéd and \"corny.\" I honestly would not have enjoyed the film if the dialogue tried to hard to be revolutionary. An epic adventure like this just needs powerful acting behind the lines to work, and in that area, Avatar delivers. Sam Worthington is great and this film is yet another great example of how the Australian actor is quickly becoming one of the best and prolific actors of this generation. Zoe Saldana brought the bold, strong, and fearless character of Neytiri to life. She served as a great love interest character and her Na'vi background helped enhance how valuable of a character she is. Sigourney Weaver's performance as Grace Augustine, a botanist who specializes on Pandoran plant life, is also great as one can expect from her. The villainous Colonel Quaritch was also a fantastic character thanks to Stephen Lang's absolutely powerful performances. Cameron implemented a wonderful and fearless villain into the film and every character (including the wildlife of Pandora) stood out on it's own.I cannot find words to describe the visual impact of this film. Breathtaking, phenomenal, and amazing are all understatements. The amount of painstaking effort put into realizing the world of Pandora really paid off. The entire alien planet, including the Na'vi characters, is computer-generated, yet many shots would make the viewer wonder where they shot the film on location. New and extensive performance capture techniques were created for this film. Cameron improved upon previous motion capture methods that were used for characters such as Gollum (The Lord of the Rings) and Davy Jones (Pirates of the Caribbean) in order to make his computer-generated characters more life-like. The Na'vis convey real emotions down to the very small muscles on their faces. The attention to detail was so carefully handled that you do not worry about things being over-the-top. You simply believe that the setting is there and the characters are undergoing a huge conflict within it. The design involved in the film was astounding and a lot of caring dedication was put into the character designs. A full phonetic language was designed from the ground up for the Na'vi civilization, in addition to a full background lore and mythology for the population. The animals look like ordinary animals at first glance, but when you see them up close with repeated viewings, you realize how alien they are. The predatory creatures that dwell in the forests of Pandora look absolutely menacing, and the dragon-like Ikrans serve a great purpose in the entire movie. James Cameron, along with other top-notch artists like Neville Page (of Cloverfield and Star Trek fame) and others from WETA Digital created a new world full of wildlife, plants, geographical locations, and a humanoid population. Pandora is simply a living and breathing world that is truly a sight to see in which the 3D effect greatly enhances.Avatar is a film experience that will be remembered for years to come. James Cameron has succeeded once again in creating a wonderfully entertaining film with the perfect balance between love, action, and mild comedy. In addition to this, the director has taken another step in upgrading the way we watch films in the future.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "chiel1989",
            "reviewer_url": "/user/ur11174042/?ref_=tturv_usr_125_t",
            "review_date": "Jan 18, 2010",
            "rating_value": "6",
            "short_review": "A next generation in blockbusters",
            "data-review-id": ""
        },
        {
            "reviewer_name": "CraneFist",
            "reviewer_url": "/user/ur20724086/?ref_=tturv_usr_126_t",
            "review_date": "Apr 8, 2010",
            "rating_value": "1",
            "short_review": "Actually insulting to avid film lovers",
            "data-review-id": ""
        },
        {
            "reviewer_name": "JohnTequila",
            "reviewer_url": "/user/ur3004163/?ref_=tturv_usr_127_t",
            "review_date": "Dec 17, 2009",
            "rating_value": "10",
            "short_review": "Breathtaking, simply breathtaking.",
            "full_review": "I just came home 5 minutes ago from seeing an early morning showing in 3D. My expectations were pretty high in seeing this movie as lets face it, it's James Cameron. James has consistently made great films through his career and he's tried to better himself every time, but still maintaining to entertain the audience. This time round he have excelled in every aspect of film-making.Right, down to the film. All the backlash from the first teasers were forgot within the first 30 minutes of viewing, and I'll never listen to critics in the future ever again. How wrong they were. Sure there were elements of other films like Dances with Wolves, but I saw greater connections with the Final Fantasy VII game. I'm not even prepared to say that the comparisons are a bad thing, as this film (in my opinion) is greater than anything it will be compared to. A bold statement I know.Now Pandora is a world needed to be seen in 3D, I'm sure the 2D version will be a great movie, but you won't feel like you are actually there. The realism in the visuals is far greater than anything I have ever seen, the CG characters make Gollum look like Roger Rabbit. The world appears real like our own and you connect and feel for the place and its inhabitants towards the end. I really wanted it to be as real as it seemed.If you are familiar with the plot, you will be please to know that any political statement made, its not one forced upon us throughout, its subtle, but the message is clear. As the audience, you are allowed to forget about our own world troubles and be part of an amazing adventure that will stay in your mind for a long time. Bravo James Cameron.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "jamiemamo",
            "reviewer_url": "/user/ur22250190/?ref_=tturv_usr_128_t",
            "review_date": "Jan 4, 2010",
            "rating_value": "10",
            "short_review": "Cameron is a Genius",
            "full_review": "I don't understand how some people could criticize this outstanding work of art, i never in my life felt so good watching a movie at the theaters and i didn't even watch it in 3d.I liked all of Cameron's work, especially aliens and terminator 2,titanic was OK but nothing to rage about,but this goes on to a whole different level, the scenes in this movie are incredible,the imagination a person has to have to create a movie like this have to be beyond description,not even district 9 comes close to some of the visuals in this movie, the storyline amazing, what else can you ask for. I've read some comments stating that avatar does not belong in the top 250 movies on IMDb, as its numbered 26th i think,well not only should it belong there i personally think it deserves to take first or second place on IMDb's list for the pure genuine pleasure, and Cameron is ahead of time, he proved it in 1991 with T2 JUDJMENT DAY and he proved it again with AVATAR.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "l_cobern1989",
            "reviewer_url": "/user/ur13045182/?ref_=tturv_usr_129_t",
            "review_date": "Dec 17, 2009",
            "rating_value": "10",
            "short_review": "Another movie spectacular by James Cameron",
            "full_review": "When I first heard about this film I was looking forward to it a lot but I must admit when I saw the trailer it didn't really do it for me. It wasn't what I thought it would look like. But as I like every other James Cameron film I thought I would check it out and I must say it is spectacular. I didn't think I would like but it is one of the best films I have ever seen.The visual effects are just amazing. There is no other word to describe it. Pandora actually felt like it was real. It was that good. The attention to detail was brilliant. It just looked so realistic, visually stunning. The scene where Jake learns how to fly looked amazing. The dragon like creatures looked very real and were very well designed. I loved it when Jake and Neytiri were racing down the side of the mountain. The camera angle they got on that was brilliant.The last 30 minutes of the film was just breathtaking. I mean it was all systems go. It was non stop action the whole way. James done a great job of putting that together. It was just so well done. They had some great moments when it went slow motion. That was brilliant. It was just so mad with all helicopters and the navi in the air taking each other out.Colonel Miles who was played by Stephen Lang was the best character for me. He played him so well that he really made you hate him because he was just so brutal. He just didn't really care about anyone. He just pretty much wanted everyone dead. The look of his character was spot on, making him big and mean and having those scars across his face.Also the navi looked really good. I mean loads of people were saying they looked rubbish in the trailer but on the big screen they looked amazing. It was just amazing how they got the facial expression looking so good. I mean when Jake jumped in the lake when he was being chased it looked so real when the water was dripping from his face.James Cameron can definitely be happy with this film. He just never disappoints. Some of his camera angles were brilliant. They were just so clever. I mean the end battle must have taken him ages to film, let alone edit. This film is definitely one was best films I have ever seen and gets me really excited to see what the film industry could be like in a few years to come with technology like this. It is so entertaining and will have you glued to the screen throughout the whole film and wanting to see what Cameron can come up with next. I can't wait to see what the sequel will be like.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "yogi_2032",
            "reviewer_url": "/user/ur14170097/?ref_=tturv_usr_130_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "10",
            "short_review": "Trust me, you can't watch it just watch  just once: AVATAR!",
            "full_review": "Watch everything in your life you'd have ever wanted to appreciate, before you watch the AVATAR , there won't be anything you could ever praise but AVATAR , once you'd seen it! There's no guessing game and not too much of the plotting, it was objective and smart with its clichés ,it keeps you glued and pays you many times more to you than you paid with every second.A complete lovable heartfelt connection of man with an alien, an instinct to survive and the way of life , a journey from the underdog to the leader , a journey from pandora to earth! I loved it for its beauty, i love it because it surpassed my imagination, this was my life's greatest spectacle after 80 days around the world!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "cooper101183",
            "reviewer_url": "/user/ur19034094/?ref_=tturv_usr_132_t",
            "review_date": "Jan 18, 2010",
            "rating_value": "6",
            "short_review": "Simply Outstanding",
            "full_review": "James Cameron's Avatar is a breath of fresh air. Although the story itself is one that we have seen before in the likes of Kevin Costner's Dances with Wolves and The Last Samurai of a man who falls in love with a way of life and has to choose between what he knows and what he loves, Cameron's masterstroke is in setting the story on another world and so it is not restrained by certain parameters which leaves him free to tell an emotional story. The performances by the actors are fine and all invoke the emotions of there characters eg Giovanni Ribisi plays the Corporate bad guy perfectly. However it is James Cameron's ability to make you fall in love with a world that does not exist which makes this film work. People remark that it is a work of art which you will have to decide for yourself. In all this is a must see movie and I believe will collect a lot of Oscars.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "tacmovies",
            "reviewer_url": "/user/ur20815404/?ref_=tturv_usr_133_t",
            "review_date": "Jan 7, 2010",
            "rating_value": "10",
            "short_review": "It's Soooo Beautiful!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "umer_ejaz007",
            "reviewer_url": "/user/ur8216874/?ref_=tturv_usr_134_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "7",
            "short_review": "The greatest film of all time.....beats all classic films (Contains spoilers)",
            "data-review-id": ""
        },
        {
            "reviewer_name": "mdada",
            "reviewer_url": "/user/ur4894118/?ref_=tturv_usr_135_t",
            "review_date": "Jan 21, 2010",
            "rating_value": "10",
            "short_review": "Movie will inspire many movie makers for some years to Come.",
            "full_review": "I was expecting a lot and I did get a lot in the movie. So much so that Vatican felt threatened and made a statement on nature worship and NeoPaganism as they have monopoly on any GOD about some themes in the movie. Graphics is best in class and actually I had motion sickness, personally I may not see more 3D movies because I cannot take it. Let your self roll with the movie and wander where the movie want to take you. Race is shown little bit but usually very abstract themes don't drive home a major point without some simple analogy and analogies are logically related in the sense not in totality, hence futility of people finding race question here. There are some scenes of hanging rocks and holographic screens which I think are for entertainment purpose vs enlightenment of young minds and are truly quite original though journey to the center of earth did introduce the concept. Na'vi's speaking English makes me wonder what point we are making there but let us not hang on that theme because you will loose the effort spent in getting Na' vian language up to speed. Na'vi people are not so realistic but just think that movie is a super hit without that because Madagascar has a better eye coordination with mode and dialogues. One more point, Avatar is an Indian word meaning reincarnated self of usually God or superhuman being and quite well chosen like Yoda (another Indian word meaning warrior from Star Wars). All in all buckle up and get ready for pretty fantastic future like Wall.E, it may be a matter of choice in future to have or not have and struggle.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "classicalsteve",
            "reviewer_url": "/user/ur7383416/?ref_=tturv_usr_136_t",
            "review_date": "Feb 20, 2010",
            "rating_value": "7",
            "short_review": "Spectacular Visuals BUT Story Needed More Development: Rather Weak Ending",
            "full_review": "I will certainly not argue that this is a highly entertaining film. But again with a lot of films of this type recently, the script gradually takes a back seat to the visuals. The premise of the story is a good one, and I admire Cameron for giving us a relatively original plot from which to tell his story via CGI. However, there were still a few problems with the script. Like many of movies of this type, the script seemed a couple of re-writes away from being an absolutely phenomenal story. There were a few too many aspects that started ringing of Aliens and Titanic, both of which Cameron wrote and directed. And there were glaring holes in some of the story but instead the action sequences were overlong almost to cover-up the lack of development, particularly in regards to the mineral substance sought-after by the corporate baddies. The basic plot is pretty complex. American white capitalists are exploiting Pandora, a world that is a cross between the jungles of modern-day Africa, the world of the dinosaurs 100 million years ago, and the unpredictability of Wall Street. Some of the creatures that habituate the planet are crosses between dinosaurs, reptiles, mammals, and Enron Corporation. At one point a character says you could get a little rest and relaxation in Hell after being on Pandora. Nestled inside this wilderness are a race of green humanoids resembling something that could pass for an ancient African or Native American tribe with a little bit of Vulcan added for good measure, called the Na'vi. They reside inside a giant tree that would give the Empire State Building a run for its money. Trouble is the Tree (aka Hometree) contains a mineral that's supposed to be worth $20 million per 2\" x 2\" x 2\" cube, which would mean that one the size of a bowling ball would be enough to buy the entire state of Rhode Island or the estate of Bill Gates. But this is one of the holes in the script: What the hell is this stuff and why is it potentially worth more than all the that pops up on \"Antiques Roadshow\" and \"Pawn Stars\" combined? This is never explained. I think we are given only one line about the mineral and left to speculate ourselves, and the subject never comes up again. Of course this is a gaping hole as the whole premise is based on the immense desirability of this stuff! The man in charge of the corporate interests of the operation, Parker Selfridge, seemed a clone of Carter Burke from Aliens. (I notice their first names seem like a last names!) Like Burke he is only interested in the capital gain of mining the mineral. The native people, of course, are going to get screwed.A crippled soldier, Jake Sully, who lost the use of his legs in the Marines, is hired to place his consciousness inside an \"avatar\", a life-like replica of one of the Na'vi and infiltrate their society and culture to see if an agreement can be reached between the money-hungry corporation and the Na'vi. The agreement is the native tribe is being evicted from their Tree, without even a written 30-day notice. The better part of the film is Sully learning about the Na'vi. That aspect worked relatively well, although there were characteristics of the Na'vi that seemed so much like either idealized Native American or Ancient African culture that it was getting a bit deja-vu all over again. My favorite moment is the relationship between the Na'vi and the winged beasts, the Toruk, and how the Na'vi tame them. Later, the scientists discover that much of the planet is interconnected like a giant organism but again the idea is neither developed nor resolved.The baddies are led by a colonel who is so replete with over-the-top military cliché I half-expected to see him worshipping at a shrine to General Patton. He would probably feel right at home in the company of Atilla the Hun. (Again he was very similar to Cameron's character from Titanic, Spicer Lovejoy, who is just pure evil even when the ship is sinking! Without giving it away, there is a similar scene in Avatar.) Which points to what I think is the biggest problem I had with the final confrontation of the horrible white corporation with the wonderful Na'vi. The Na'vi seemed to have very little dark aspects to them and the baddies had almost no redeeming qualities barring the scientists and Sully. For those who like their bad guys and good guys very well-defined, this is your kind of movie.Unfortunately, I predicted the last 20 minutes of the film during the first 20 minutes. The ending needed something unexpected that also tied up the loose ends concerning the valuable mineral and the idea of interconnected consciousness of life on Pandora. I speculated that the corporation might earn greater profit from fostering this idea of interconnected consciousness, but nope. They don't listen to reason and simply go for the jugular. Probably the first one-half to three-quarters of this film were exceptional. The last quarter became a slash-and-bang shoot-em-up action video game. Sort of a Spaghetti Western in space. The ending needed to transcend itself to meet the very interesting rhetoric of the middle of the story. But of course that probably would have meant cutting down the action sequences, God forbid.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "tigerkittyskf",
            "reviewer_url": "/user/ur2349840/?ref_=tturv_usr_137_t",
            "review_date": "Oct 28, 2010",
            "rating_value": "1",
            "short_review": "I've lost hope...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "SubZeroMK",
            "reviewer_url": "/user/ur21139910/?ref_=tturv_usr_138_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "10",
            "short_review": "The new era of film begins with Avatar",
            "full_review": "I am still in awe. This film has surpassed the visual barriers. It is the marking the beginning of a new era in film. Why do I say that? Because it's done by James Cameron and after-all, he has surpassed technological barriers before with the release of Terminator 2 and Titanic in the 90's.This movie has been in the making for over 15 years and it looks like it has paid off. James wanted to wait till technology got better, then he got his inspiration from Lord of the Rings. He took that inspiration and he perfected so that NO ONE will ever make a movie this good for a very long time, visually. He created the camera, the graphics, basically he created new technology and this opens SO MANY windows of opportunities for other film-makers in Hollywood. The next decade of sci-fi, or special effects driven films will look like Avatar thanks to James Camerons' technology.Now to the story. This is such a beautiful tale of a man with a disability who befriends a different species outside of our solar system and respects their way of life. Now a lot of people compare this movie with \"Dances With Wolves\" but I have never seen that movie so I can't say anything and it seems that people love comparing films nowadays to feel like they deserve to have an opinion. Anyway, on with the story. After our main hero befriends the Na'vi populace, he has a change of heart and sides with them, the militia that has populated Pandora doesn't like this, they just want their materials and will kill anything in their path to have it.The Na'vi are not a violent species unless they are pushed over the edge. The humans who inhabit the planet only want raw materials that sell for 20 million a kilo. A lot of other parasites have said that it makes fun of Americans and their way of life, of how they seek nothing else but to dominate everything in its path. I mean, isn't that true? They love doing that, and they have been doing that for the last 200 years. But this movie is not about that egotistical, and arrogant country, it's about the human species when it comes into contact with another species; we hunt them down if they don't co-operate or if they we think they're a nuisance, and on top of that, claim their land as ours. It's true though, we would do that if we wanted to colonize on another planet with another species. We would kill them. No wonder aliens don't visit us, we're f***ed up.Anyways, I can't stress it more that you MUST see this movie. It's one of those movies you should see before you die. Even if it's your last day before you die because you have a critical disease or condition; you have to see this film. It will make your life and your death so worthwhile. You will die in awe. Definitely a blu-ray purchase in my books. 10/10 for a visual evolution, a breathtaking story and an outstanding experience in IMAX 3D..the way it was meant to be seen.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "veereshg",
            "reviewer_url": "/user/ur19731473/?ref_=tturv_usr_139_t",
            "review_date": "Dec 20, 2009",
            "rating_value": "10",
            "short_review": "Outstanding,Mesmerizing,Hypnotising",
            "full_review": "I believe in James Cameron, way back from the Aliens to Titanic he delivered a sensation or a magic. And his new magnum Opus, AVATAR is most entertaining,thrilling cinematic experience of my lifetime. Its mesmerizing, and Cameron crafted it wonderfully.The film focuses on an epic conflict on Pandora, Pandora is inhabited by an indigenous species called the Na'vi. Standing nine feet tall, with tails and sparkling blue skin, the Na'vi live in harmony with the natural world around them.The word Avatar is an ancient Indian word, with literal meaning of \"the Lord Vishnu taking another form, to counter the evil forces\". Here it refers to human scientists led by Dr. Grace(Sigourney Weaver) taking form of Na'vis with the help of Genetic engineering.Jake Sully(Sam Worthington), a marine, who replaces his brother on a mission to infiltrate the Na' vis on the planet of Pandora. During Jake's first assignment through the Pandora jungle, few wild creatures attacks him and becomes alone in that jungle, attempts to survive and steals the attention of Nytiri (Zoe Saldana) a Na'vi female.The Na'vi people decide to take Jake and teach him about their culture. As Jake learns the way of the Na'vi, he finds himself caught between the military-industrial forces of Earth and a newfound love for his adopted home and people. Believing that the Na'vi will never abandon their home, the humans attack and destroy the Hometree, forcing the Na'vi to flee. The Na'vi feel betrayed by Jake, ostracizing him from the tribe. Back at base, Jake and his compatriots are forcibly disconnected from their avatar interfaces and are detained for arguing against the destruction.Finally, with Neytiri's assistance, Jake assembles thousands of Na'vi from other tribes and lead them into battle with the increasingly violent human forces, in order to save their race and world, after the battle, the humans are forced to evacuate Pandora. To talk about the performance, all arrows from the Cameron's bow done an excellent job.Especially Nytiri, an electrifying performance, even Sam did an excellent job.I mean all are acted brilliantly. Visual effects is superb and hypnotizingAvatar offers not only Space war but also a drizzling love story between Jake's Avatar and Nytiri. Every scene offers you a thrilling Taquila. I added Avatar in my favorites list. I give 10 rating for James Cameron's Avatar because i cannot give less than that.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "amcdalton7",
            "reviewer_url": "/user/ur30449358/?ref_=tturv_usr_140_t",
            "review_date": "Feb 21, 2022",
            "rating_value": "10",
            "short_review": "Beautiful",
            "full_review": "Easy one of the best visual films I have ever seen. The story line is perfect and the cig is just absolutely beautiful.Would definitely recommend this to anyone that has not seen it.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "v_savin2000",
            "reviewer_url": "/user/ur13833294/?ref_=tturv_usr_141_t",
            "review_date": "Jan 1, 2010",
            "full_review": "Wow! Bravo James Cameron! Nothing I have seen so far was so breathtaking! Special effects are another breakthrough! Well worth to see it for yourself in a theater.Mainly this movie gives us (the humanity) a chance to look in the mirror (which is not especially pleasant) and to survive as species.However, people who let their minds consider themselves \"the crown of evolution\" will not grasp the Idea and will not like the movie. For them, the main character remains a mere traitor. (oh, what should i say! what a pity!)We, people, have our mechanical toys OK, but watching this movie made me for the first time feel (indeed) that \"advanced\" people from a mechanical civilization have _nothing_ valuable to offer for such \"usual barbarians\" as Navi, who are living in perfect balance at Pandora planet and in perfect harmony with every creature.Definitely I want to see this movie again.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "frosty-44431",
            "reviewer_url": "/user/ur129208002/?ref_=tturv_usr_142_t",
            "review_date": "Feb 9, 2021",
            "rating_value": "6",
            "short_review": "Hyped for a mediocre film",
            "full_review": "I think the build up to t's release was more exciting than the actual film. I'm not sure if I'm missing something or need to give it another watch. I just didn't see what all the fuss was about.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "dilbharadwaj",
            "reviewer_url": "/user/ur18893003/?ref_=tturv_usr_143_t",
            "review_date": "Dec 29, 2009",
            "rating_value": "10",
            "short_review": "This generation's STAR WARS. Mark my words, people will talk about this movie even after 30 years...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "kos-27",
            "reviewer_url": "/user/ur19180889/?ref_=tturv_usr_144_t",
            "review_date": "Feb 16, 2013",
            "rating_value": "6",
            "short_review": "eye candy with no substance",
            "full_review": "It's very possible that this is an important movie in the field of CGI and 3D technology. In that category it is certainly a groundbreaking pioneer and it will have its followers. In fact it already has (life of Pi). The artificial world that was created was amazingly beautiful and imaginative. For this I give the movie all ten points.But in the movie industry there are different categories. More than half of the playing time - namely the scenes of the Avatar world - belonged more or less to the category of animated movies with CGI effects. It was made rather on the computer than it was behind the camera.The question is: shouldn't Avatar be treated and rated like an animated movie rather than a motion picture with real actors? Even animated movies and are judged as whole, not only for their outstanding visual execution.If you extract the whole high tech visual aspect of Avatar what is left of it?-average acting (except Sigurney Weaver) (- 1 point) -predictable story (- 1 point) -full of clichés: bad military people versus native peoples preserving nature (-1 point) -full of stereotypes: there are either good or bad characters (-1 point)If the Avatar world would have been replaced (and played) by some real Aborigines, this movie would have been neither noticed nor watched.I read somewhere that this movie is the equivalent for pop music hits: Today for the best tomorrow for the garbage.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "caspare",
            "reviewer_url": "/user/ur1440460/?ref_=tturv_usr_145_t",
            "review_date": "Dec 19, 2009",
            "rating_value": "10",
            "short_review": "Hard criticism for the USA. But will anybody notice??",
            "full_review": "One of the best movies ever. There was the famous Mr. Gorbachev, who wrote in his book \"Perestroika\" the remarkable sentence: \"Capitalism is incapable of solving mankind's global problems\". We just witnessed Copenhagen, where the two most aggressive nations on this planet finally paved the way to global doom.Avatar shows us the extinction of the Native Americans by the first Europeans coming to America, it shows us the way the Aborigines ended after the English came to Australia, it shows us numerous \"smaller\" events, where the evil combination of a mighty military machine and insidious commercial interests. This combination (some call it fascism) will do everything to get its profit.I find it fascinating, that especially a nation like the USA, who can't kick militarism, is making such movies, watching such movies, enjoys such movies and ... continues exactly like they did before. Don't marines visit movies theaters? Don't managers visit such movies? We destroy everything. This process continues, it actually happens each and every day. Each day, \"Avatar\" happens on Earth. A little Pandora in every hour of our life. But since we don't watch it in 3-D in a movie theater, it doesn't bother us too much and our \"Na'vi's\" ain't always that perfect and pretty.So now we watch it in beautiful, magical pictures in a movie theater and the good ones win for once. At least until another profit-hungry corporation comes back and throws some ERW /neutron bombs on the Na'vi, because after that, they can continue making 20 Million bugs a kilo of something mineral - so we can buy more non-alcoholic beer and more blue jeans and more bankers can claim more bonuses.The movie is wonderful, but the victory of the Na'vi can only be considered a \"Little Bighorn\". Nothing more.For the few among us who know about Enlightenment, the movie pictures the Na'vi as beings living in a state of knowing who they are. This alone makes it worth watching the movie.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "BoriskaMoscow",
            "reviewer_url": "/user/ur22796020/?ref_=tturv_usr_146_t",
            "review_date": "Feb 2, 2010",
            "rating_value": "6",
            "short_review": "Amazing graphics...but crap overall",
            "full_review": "Well people, I would like to start off by saying that if you have seen this movie more than twice, you should really check your IQ (it might be lower than you've expected). The reason I say that, is that like most of the other modern super high graphics movies, this movie lacks a good story. I mean its just a complete mess, the plot is like 5 minutes, some idiot comes in the village speaking English, and they are like oh yeah dude we are just going to teach you \"our way\" out of the blue, not even caring where he came from or what he wants. Followed by boring 45 minutes of dragon flights, etc...I was yawning when I was watching it. The of course the savage fight scene, a cheesy love story, all that crap. Here's the breakdown of all the mess they've made:1) Terminator - Their sarge, a ruthless idiot. 2) Lord of the Rings - the Stupid tree the people live in, just blow up the tree..could have nuked it, but it's OK) 3) Alines - well that one actor whatever her name is, was from aliens and so did the space ships looked a lot like in that movie. 4) Matrix - guy in the tub, loading him to the avatar...oh jeez, come on people, it's not original anymore to be a copy cat(I am sure I forgot another movie they copied the stuff from, but that's OK. So I gave it a 6/10 because that's all it deserves for crap story and amazing graphics. But seriously don't see it more than twice, just because you are wasting your money. I'll get my BluRay copy of it, but that's about it.Adios!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "dfranzen70",
            "reviewer_url": "/user/ur0543054/?ref_=tturv_usr_147_t",
            "review_date": "Dec 29, 2009",
            "rating_value": "5",
            "short_review": "Incredible, inventive effects can't save this",
            "full_review": "James Cameron's long-awaited Titanic follow-up is very pretty to look at but suffers from a flimsy plot and astoundingly stupid plot development. The characters are one dimensional, both as written and as portrayed, and there's hardly anything unpredictable. The only thing this movie has going for it are its state-of-the-art effects, which are truly boggling.Sam Worthington plays Jake, a paraplegic ex-Marine who's sent to a distant moon to help humans mine a mineral called unobtainium (in the running for the least creative chemical name ever). Seems there's a huge cache of the stuff under a huge tree in a jungle that's populated by an indigenous race called the Na'vi, blue-skinned, really tall people with feline characteristics. Meanwhile, a scientific program headed by Grace Augustine (played by a typically stiff Sigourney Weaver) has focused on learning as much as possible about the Na'vi in order to benefit scientific knowledge. Augustine's research (funded by the same company who's mining the unobtainium) involves the use of avatars, in which scientists form a psychological link with a mock-up that looks just like a native Na'Vi, the better for the humans to exist within the unbreathable atmosphere. Jake gets inside the Na'vi within his avatar and attempts to find out what they would want in exchange for moving from away from the giant store of unobtainium; during the course of his mission, he falls for the Na'vi chief's daughter, Neytiri (Zoe Saldana). (Of course he does.) And as said mission drags on, Jake's perspective changes from meathead jerk to tree-loving jerk, and he begins to wonder if what he's doing is right.Is he serious? You're an alien race (humans) and have no business on this moon. Your employer's stated goal is to gobble up all the jewels he can find, basically raping the planet. Your employer will stop at nothing to get it, as he answers to no one. You're being sent down to find a diplomatic way to screw the natives out of the bounty on which they sit. And he thinks this might be wrong? A power grab ensues when the military leader of the human expedition, a Colonel Quaritch (Stephen Lang) decides enough is enough and wants to bomb the hell out of the Na'vi, with the approval of the head of the company, Parker Selfridge (Giovanni Ribisi), another patently obvious name. This sets up the rather obvious showdown between the primitive Na'vi and the gung-ho ex-Marine humans, who have missiles and guns and ammo and rockets and helicopters and who knows, even a Star Destroyer or two. The final battle scene is overtly reminiscent of the Battle of Endor in Return of the Jedi, in which the primitive Ewoks manage to defeat a stormtrooper army using only their quick wits and some old-school, homemade traps of destruction.But even if the plot doesn't need to be complex, it sure ought to make sense. Here's a nonspoiler question to ponder. Jake, under the guise of his avatar, is taken in by the Na'vi, whose spiritual leader asks Neytiri to teach Jake their ways. Why this is to be is not terribly clear. It's evident that the humans have made several attempts at learning the ways of the Na'vi but that prior emissaries had been scientists; as soon as Jake tells the Na'vi that he's a warrior, they're all about teaching him. I don't quite follow the logic here; if I were the Na'vi and had not been able to teach the smart humans who obviously (to me) were not there to do me harm, why in the world would I want to teach someone who's used to using aggression and violence to solve problems? I get that the Na'vi, as a warrior race, would relate more to the soldier, but surely they would be reluctant to share knowledge with someone who was outside of their group anyway, let alone with one who might well do them harm.Moreover, I'm not sure what the Na'vi thought Jake was, really. He looked like them, through his avatar, but they referred to him at least once as an alien. My best guess is that they just thought he was from another clan. Other clan? I'll assume that only this one clan, the Omaticaya, made its home at Hometree (yet another clumsy naming convention) and therefore was the only clan with a stake in protecting it. But if they simply thought Jake was from another clan, why did they let him in anyway? Why did they teach him? What purpose would it serve them? And on top of that, since the Omaticaya mentioned being approached by \"aliens\" before, doesn't it seem more likely that they would have assumed Jake was another alien ambassador anyway? This makes my brain hurt.I think it's pretty obvious that Cameron wanted this to be his own Star Wars, an epic taking place on a distant world. He uses the standard Cameron recipe of astounding special effects and innovation coupled with a weak plot and laughable characters and hopes it all comes out okay (although for a movie that gestated for more than a decade, that's simplifying things a bit). The effects, it should be noted, are really mesmerizing visuals of the jaw-dropping variety. The 3D effects were unbelievable, and I mean that in a good way. Avatar is extraordinarily shot, using 60% CGI and 40% live action, and the two elements are flawlessly intertwined. It's a remarkable film.But it's only part of a film. the entire movie seems to try pretty hard to keep some emotional distance from its audience, and when a film is emotionally uninvolving, it's lost the battle for your heart.And that's the core problem. Despite some wonderful, beautiful effects, Avatar gives us characters in whom we can't really get invested, and when a key element of your story is an interspecies romance, this is a crucial, fatal flaw.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "madboynutter",
            "reviewer_url": "/user/ur21299642/?ref_=tturv_usr_148_t",
            "review_date": "Dec 18, 2009",
            "rating_value": "10",
            "short_review": "Avatar - a comprehensive review (no spoilers)",
            "full_review": "Avatar is quite simply the most outstanding movie experience that I have witnessed to date. It excels on all levels without exception. Anyone who is fan of science fiction / fantasy and enjoys having their imagination tickled will thrive on the vast wealth of original creativity contained within this multi-layered epic masterpiece. Avatar is a movie you don't watch... you live it.VISUAL PRESENTATION: James Cameron has thrown down the gauntlet with Avatar's stunning visual imagery, phenomenal CGI and 3D presentation. The next generation motion capture technology that James Cameron developed and utilised in the production of this movie has achieved a wholly realistic quality. The days of dead-eyes, emotionless facial expressions and general unnatural creepiness (such as seen in Robert Zemekis' Polar Express) are at an end. CG characters are for the first time truly emotionally expressive to the extent that they appear real. The overall quality of the CGI is so high that for the first time it is practically impossible to distinguish between what's real and CGI. Cameron's perfectionism has paid off particularly in this regard.3D OR NOT 3D? Avatar is a great movie irrespective of whether you watch it in 2D or 3D. However, if you want the best viewing experience I strongly recommend you watch the 3D version. Opting to view the 2D version would be akin to choosing to watch Titanic on a black and white television... why would you do that? I watched the 3D version (in RealD not Dolby3D) and can comment that it was a mind-boggling spectacular experience. I have never, ever found myself so immersed within a movie... The 3D is not in any way the occasional gimmicky hey-look-I'm-jumping-out-the-screen-at-you effect of the past. Everything has a truly three dimensional depth... the effect is that of astonishing realism... It is literally as if you are actually there in Pandora watching events as they occur. With Avatar any apprehension I had about the new 3D technology has been quashed, it is without a doubt the way forward for visual entertainment and I very much hope other movies take note of Avatar's demonstration of how it should be done.AUDIO: The music composed by James Horner is consistent with his previous work and superbly lends itself to immersing you in the world of Pandora rather than beating you over the head with a relentlessly pounding soundtrack. Horner provides the perfect balance of atmospheric ambiance where relevant blended with thrill-inspiring pulse-pounding accompaniment to the various action sequences. The quality of the sound effects and mixing is also exceptional. Whilst the music was pleasingly emotive there were also times I was literally shaking in my seat.STORY: The one area that Avatar has received criticism from some is regarding its story. I'm not going to include any spoilers here, but suffice to say that the theme of the story is strongly science fiction / fantasy so if you don't like that sort of thing then this movie may not particularly enthral you. On the other hand if you enjoy sci-fi and possess even a modicum of intelligence you will almost certainly enjoy the story as much as I did. Please don't pay attention to any of the tabloid film critics who in my opinion always try to be too clever for their own boots. Any talk of Avatar's story lacking originality is quite frankly utter nonsense. Of course, there are certain aspects that could be considered similar to this movie or that movie, but commenting that Avatar is low in originality is akin to stating that The Terminator is not original because it comprises what is essentially the standard formula for an action film, namely lead/hero meets villain, lead/hero battles villain through various action sequences, lead/hero kills villain, the end. Of course The Terminator was most original, and so is Avatar. In fact, the extent of imaginative creativity contained within Avatar's story, in particular relating to Pandora and its inhabitants, is mind-numbing. Furthermore, Cameron pulls off a high level of character depth to not only the lead characters but even those of a supporting role. The wealth of imaginative ideas contained within Avatar is more than enough to produce at least one if not two sequels. Let's just hope that we don't have to wait so long for the next instalment. I for one am longing to return to Pandora!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "nugrahane-2",
            "reviewer_url": "/user/ur12002032/?ref_=tturv_usr_149_t",
            "review_date": "Dec 27, 2009",
            "rating_value": "10",
            "short_review": "A classic in the true sense",
            "full_review": "I was a bit hesitant to write a review after my first viewing of Avatar. But now after my third viewing, I am not shy in declaring that this movie will become a classic and remembered for its groundbreaking vista for as long time. We have become used to \"production\" movies coming out of assembly lines from Hollywood, Bollywood, Asian and European movie houses that we almost forgot how wonderful a cinematic experience can be. Sure, there may have been other movies this year with \"more quirky\", \"more original\" stories but as a whole, Avatar is by far the best movie this year and in the top ten of best movie this decade. A classic is by definition something that you can enjoy as much if not more in the second, third, fourth viewing, and Avatar is definitely it. I don't understand the critic that this film lack story and emotion because it has all of it, even if a bit on the cliché side.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "crazymonk19",
            "reviewer_url": "/user/ur22600631/?ref_=tturv_usr_150_t",
            "review_date": "Dec 27, 2009",
            "rating_value": "10",
            "short_review": "This movie is now on the list of one of my most favorite movies.",
            "data-review-id": ""
        }
    ]
}