{
    "ImdbId": "tt27433995",
    "total_reviews": 37,
    "reviews": [
        {
            "reviewer_name": "gibarizt",
            "reviewer_url": "/user/ur35009056/?ref_=tturv_usr_1_t",
            "review_date": "Apr 4, 2025",
            "rating_value": "8",
            "full_review": "📌 A major Gamechanger for Indonesia Animation, film comes with great Storyline and many Pop Culture Reference, warm atmosphere at all entire of movie, will heal you inner child and you at your age right know. All characters got enough screen time with no wasted potential, every Major char got their backstory motivation and acchieve their goal at the end of story. So great for your kid as their first time at the cinema, will gain their beauty and heartwarming Core memory on their life. Ryan as writers and director just nailed it at his first directing project, Camera movement, great soundtrack and scoring all this mix and match into absolute Cinema.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "andreas1412",
            "reviewer_url": "/user/ur131681689/?ref_=tturv_usr_3_t",
            "review_date": "Apr 1, 2025",
            "rating_value": "9",
            "full_review": "Absolutely stunning!! The visuals in Jumbo are straight-up breathtaking, honestly, something I've never seen before in any Indonesian animated movie. The animation quality is on par with international films, and it totally grabbed my attention from the very first scene.The story itself is exciting and full of adventure, following Jumbo and Meri as they help each other through every twist and turn. There are moments where the pacing slows down a bit, and yeah, some parts feel slightly dragged out, making it a little tiring to watch. But honestly? The insane visuals make up for it big time.The comedy is decent and works for all ages. Personally, I didn't find all the jokes funny, some felt more geared toward kids (and yeah, the whole theater was kinda silent during certain comedy moments). But overall, the humor lands well and feels well-executed.Things really pick up towards the end when the stakes get high, with Jumbo and the gang trying to save Meri while facing all sorts of challenges. That final stretch? Super intense and visually stunning, easily the best part of the film.The message of the movie is easy to digest, and Jumbo honestly feels like a game-changer for Indonesian animation. This movie sets a new benchmark for local animators to create something that brings joy to a wider audience.Fingers crossed that Jumbo helps push Indonesian animation to new heights and gets the recognition it deserves worldwide!(btw, this movie is actually goated (if u know what i mean))",
            "data-review-id": ""
        },
        {
            "reviewer_name": "AmellyaC",
            "reviewer_url": "/user/ur199395660/?ref_=tturv_usr_4_t",
            "review_date": "Apr 5, 2025",
            "rating_value": "10",
            "full_review": "This movie made me cry every 10 minutes but i enjoyed it nonetheless. As an indonesian, it's very refreshing to see the animation standards really change and improved. I can tell that they put a lot of love into this movie, really worth the watch.This movie really shows how a good person won't always be good, and a bad person won't always be bad. As humans, we have flaws.Before watching this movie, i didn't think that it would be this touching. I didn't expect to cry every 15 minutes because of how sad and heartbreaking it is (i am a VERY emotional person) , but at the same time, it's heartwarming and happy. It's also balanced with comedy and action which i love.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "safiyyahconway",
            "reviewer_url": "/user/ur59975175/?ref_=tturv_usr_5_t",
            "review_date": "Apr 4, 2025",
            "rating_value": "10",
            "full_review": "Words can't contain how excited I was to see a fully-Indonesian production of an animated movie with a feel-good story, worthy of international recognition. The pacing, the themes, moral values, comedic timing, overall writing is highly enjoyable. Digestible enough for the kiddos, nuanced enough with a touch of nostalgia for the adults. The setting and vibe was an authentic and very real portrayal of Indonesian culture and community, yet the core of the story was entirely human; and I can't wait for this movie to touch the hearts of international viewers. It's an homage to the arts on all accounts- song, storytelling, animation, drawings. I give my highest respects to the over 420 creative minds that worked together to create this masterpiece.~Much love, an audience member that couldn't contain his laughter and tears.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "alstoniasp",
            "reviewer_url": "/user/ur165746318/?ref_=tturv_usr_7_t",
            "review_date": "Mar 31, 2025",
            "rating_value": "10",
            "full_review": "This movie feels very special. The whole movie really has a story with a great message and feeling, which is not only aimed at children but also at adults. It reminds us of being human with all the flaws and strengths and all the things that happen in our lives. That's what makes the audience, especially the adult audience, will always be attached to the characters and their feelings. In the end, it's not uncommon to feel that it's really me.Watching Jumbo feels like a roller coaster ride of emotions. It often gives reminders without sounding patronizing. The advice really reaches the heart. The choice of animation medium feels right. The complexity of emotions presented through various characters is really felt. That's also what made me laugh, cry, nervous, and annoyed while watching.I'm really impressed with the portrayal of the characters in Jumbo. Varied and complementary. Watching it is like watching myself. There are times when I feel like Don who misses his parents who are no longer there. Sometimes I want to be like Nurman and Mae, sometimes I am like Atta who looks tough but has something inside him. Also, sometimes I feel like the committee lady who is flat.The story, the characters, the messages, and everything that happens in Jumbo is supported by stunning technical aspects. The world built in the story is detailed, realistic, and even nostalgic. It's full of color and feels real. Love the changing costumes of the characters. The research is really cool. Big appreciation to all the animators, costumes, and everyone behind the making of this movie.The emotions presented are supported by the role of voice actors. In Jumbo, the voices are just right, both for the characters and what they are feeling. This makes the character feel alive and the feeling that they want to convey is conveyed. This makes the character feel alive and the feeling that they want to convey is conveyed.What's also cool about Jumbo is the songs. I love all the songs. My favorite is the one sung by Don. I was really teary during that part. When the songs are released on music platforms, I want to listen to them again and again. Apart from the movie, which is definitely on the list of favorites to watch this year, the songs are also on the list of favorites.Overall, Jumbo is a great movie. One of the best movies of the year. A movie that's not just for kids, but all ages. I cried when I watched it, it was so wonderful. While watching it, it's really not boring. Every dialog doesn't want to be missed. Even up to the credit title, it's funny and adorable.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "reynardranyer",
            "reviewer_url": "/user/ur94106292/?ref_=tturv_usr_8_t",
            "review_date": "Apr 3, 2025",
            "rating_value": "7",
            "full_review": "Film was dragged a bit too long. Solid establishment and ending. Storyboarding for conflict, climax, and solution could've done better. The story was conflict heavy but light on the solution. Rendering was inconsistent in many parts of the movie. The scoring for the movie was well done, and voice acting was pretty decent. A lot of product placement and sponsorship can be seen throughout the entire film. The SFX were pretty well done too. A reasonable step in the right direction for the animation industry for Indonesia. Overall the movie is definitely worth a watch, a rewatch on the other hand is a little optimistic in my personal opinion.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "daffasakhiyputera",
            "reviewer_url": "/user/ur164713329/?ref_=tturv_usr_9_t",
            "review_date": "Apr 7, 2025",
            "rating_value": "10",
            "full_review": "This movie was a masterclass. Truly, it was more than just an animated film - it was a cultural statement. It educated countless children across Indonesia, introduced values that go beyond the screen, and opened our eyes to the rich potential of cartoon cinematography in our own country. At a time when children are often bombarded with imported content, this film stood tall as an Indonesian original - a source of national pride and a shining example of what local creatives are capable of achieving.From the very beginning, the movie captivates its audience with impressive visuals. The animation is clean, vibrant, and expressive. The character designs are unique yet relatable, with careful attention to detail that reflects Indonesian culture - from the way people dress, the settings of the environment, to the traditional houses and food shown in scenes. It's clear that the creators poured their heart into making every frame feel authentic.But even more important than the visuals is the film's heart - its story. This movie doesn't just aim to entertain; it educates. Themes like kindness, honesty, family, religion, determination, and empathy are woven seamlessly into the storyline. Children don't feel like they are being lectured, but instead learn naturally through the characters' experiences and choices. This is one of the film's greatest strengths: its ability to teach while keeping viewers emotionally invested.One of the most powerful aspects of the film is its emphasis on local wisdom. Unlike many Western animations that focus on fantasy or faraway worlds, this movie is grounded in the real-life experiences of Indonesian families. Whether it's showing the struggle of a child balancing school and home responsibilities, or highlighting moments of religious values like honesty and gratitude, everything feels familiar - like a reflection of our own lives.This authenticity is exactly what makes the movie so impactful. Children across the archipelago can finally see themselves on screen. They can watch a character who speaks their language, eats the same food, lives in the same kind of house, and celebrates the same holidays. This kind of representation is invaluable, especially in formative years. It gives children a sense of pride in their identity and roots.Moreover, this film is a celebration of Indonesian storytelling. The humor is clever and age-appropriate, filled with witty dialogue and physical comedy that lands well with both kids and adults. The emotional moments are genuine and not forced. There are scenes that make you laugh out loud, but also others that may bring tears to your eyes - not because they're tragic, but because they're real and touching.The voice acting deserves special praise. The cast brings the characters to life with sincerity and warmth. Whether it's the voice of a loving mother, a supportive friend, or a mischievous sibling, each performance feels natural. Combined with strong writing, the characters quickly become familiar and lovable - as if we've known them for years.Musically, the soundtrack is also a triumph. The background scores help build the atmosphere perfectly, while the original songs (if included) are catchy and memorable. Some of these tunes become instant favorites among kids, with lyrics that are positive, motivating, and easy to sing along with.But perhaps what's most impressive is how this film opens our knowledge about cartoon cinematography in Indonesia. For too long, the local animation industry was underestimated. People thought only foreign studios could create high-quality animated films. But this movie shatters that myth completely. It shows that with the right team, resources, and vision, Indonesian animation can stand proudly on the global stage.The attention to lighting, background design, and camera movement is evidence of serious craftsmanship. There are moments where the animation even mimics cinematic techniques - wide landscape shots, dynamic transitions, emotional close-ups - proving that this is not just \"a cartoon,\" but a legitimate work of visual storytelling.Furthermore, this film has played a significant role in developing media literacy and critical thinking among children. By watching a locally made cartoon with thoughtful plots and meaningful messages, children learn to reflect on what they watch. They're encouraged to ask questions, connect the story to their daily life, and even dream about becoming animators, voice actors, or storytellers themselves. The inspirational value of this film cannot be overstated.This movie also gives hope for the future of the Indonesian animation industry. It sets a new standard for what can be achieved and raises expectations - in a good way. It has inspired other creators, both young and old, to believe in the power of local content. It sends a clear message: We don't have to look outside to find greatness. We can build it right here, at home.In schools, many teachers and parents have praised the movie for being both fun and educational. It's the kind of movie that can be shown in classrooms without hesitation. It encourages discussions about ethics, family, dreams, and discipline. And unlike some imported cartoons that may carry different cultural values, this film feels safe and aligned with Indonesian norms.Beyond the screen, the success of this film has also sparked merchandise, books, and even learning apps - extending its positive influence into various aspects of children's lives. It's more than a one-time watch; it becomes part of a child's world, shaping their thoughts, behavior, and even aspirations.In conclusion, this movie is a true masterclass. It's a beautiful combination of art, education, culture, and technology. It proves that Indonesian cartoon movies are not only capable of entertaining but also of shaping the next generation with wisdom, creativity, and national pride. It opens the door to a brighter, more self-confident future for Indonesian cinema. And as audiences, we are not just watching history being made - we are part of it.If you haven't watched this film yet, don't wait. Gather your family, sit down together, and let yourself be moved, inspired, and proud. This isn't just a cartoon. It's a legacy in the making.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "kecilkecilpedas",
            "reviewer_url": "/user/ur194424496/?ref_=tturv_usr_11_t",
            "review_date": "Apr 4, 2025",
            "rating_value": "8",
            "full_review": "Jumbo, directed by Ryan Adriandhy, is a charming adventure about a parentless child, wrapped in Disney-like fantasy and local Indonesian flavor. The protagonist's journey is rooted in themes of integrity and the importance of keeping promises-wrapped in childlike wonder and emotional maturity.Meri, the ghostly figure Jumbo (or Don) wants to help, evokes memories of Casper-gentle, lonely, and longing for connection. Her presence gives the story both heart and a sense of innocent mystique. The film blends light-hearted humor with emotional undertones, allowing audiences of all ages to find something meaningful.There's clear inspiration from Monsters Inc. And The Prestige, especially in the sap sap sap scene-a nod to the three stages of a magic trick, offering misdirection and surprise. While the film leans into sci-fi, it stays grounded, like using a radio to communicate with \"the other realm,\" creating a fantastical yet relatable world.German culture appears subtly through Meri's family, primarily in a brief yet impactful dialogue with her mother. A standout comedic moment comes when the villain is apprehended not by global forces or the FBI-but by a humble local security officer (hansip), delivering a punchline that's uniquely Indonesian.Playful nods to Dr. Stone and Avengers are cleverly embedded, making the film feel like a love letter to modern pop culture fans. The final emotional exchange between Don and Papa Don is reminiscent of Naruto's farewell to Yondaime-bringing unexpected emotional depth to this seemingly light tale.With smart references, grounded storytelling, and a magical tone, Jumbo is more than a children's film. It's a warm, imaginative story for anyone who has ever loved, lost, or believed in second chances.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "RifqiS",
            "reviewer_url": "/user/ur199752969/?ref_=tturv_usr_12_t",
            "review_date": "Apr 11, 2025",
            "rating_value": "6",
            "full_review": "First, despite all the controversies I watched Jumbo with an open mind. After all, this so-called first local animation movie have been hyped for quite some times. Call me excited.And the story begin...\nTell me you're South Jakartans without telling me you're South Jakartans - this movie is littered with so many tells not shows. Everything has to be told when it could be shown and the story - or lack of it - suffers.The fantasy side collides awkwardly with raison d'etre of the villain of the story. And the music....please, not every scene needs music and the victim of course is the main song of the movie, it fell flat.I really want to like this movie. 5 years in the making, I wish it could spend one more year on tightening the story itself.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Feople",
            "reviewer_url": "/user/ur199671166/?ref_=tturv_usr_14_t",
            "review_date": "Apr 10, 2025",
            "rating_value": "10",
            "full_review": "There is rarely local animation made in Indonesia itself, but this is one that is directly very high-quality, in terms of graphics, animation, atmosphere and particles integrated very perfectly carrying the theme of the story and morals that bind the hearts of the audience, the storyline is also unusual compared to other animations, it is very unique with the right character, even the moral values contained in this film are very rich where one film does not only contain one moral value, Not forgetting that the introduction of Indonesian culture in this animation is very subtle so that its existence can still be known without disturbing the course of the film.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "AlA-69",
            "reviewer_url": "/user/ur199511710/?ref_=tturv_usr_16_t",
            "review_date": "Apr 7, 2025",
            "rating_value": "10",
            "full_review": "Jumbo is one of those rare animated films that really touches your heart. It's visually stunning, emotionally rich, and full of charm. The story follows a young boy on a journey of self-discovery, told in a way that feels magical and deeply human. I was immediately drawn into its world-the animation is vibrant, the music is beautifully composed, and every moment feels carefully crafted.What makes Jumbo so special is how relatable it is. It speaks to anyone who's ever felt different, unsure, or left out. But instead of focusing on sadness, it's full of hope and inspiration. The film celebrates creativity, imagination, and inner strength in a way that feels honest and uplifting.Whether you're a child, a teenager, or an adult, there's something in Jumbo that will speak to you. It's a joyful and moving film that stays with you long after it ends.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ARFAM-3",
            "reviewer_url": "/user/ur199731976/?ref_=tturv_usr_17_t",
            "review_date": "Apr 11, 2025",
            "rating_value": "10",
            "full_review": "JUMBO is an ABSOLUTELY ENTERTAINING Indonesian film! From start to finish, it delivers laughter, heartwarming moments, and positive messages in the most effortless way.Strengths:\n✔ Outstanding cast chemistry - Every character has unique dynamics that make their scenes genuinely engaging and natural.✔ Smart & fresh comedy - The humor isn't just slapstick; it's well-timed and relatable to everyday life.✔ Creative visuals - While not a big-budget fantasy film, the effects and direction are impressive for a local production.✔ Lighthearted yet meaningful story - Perfect for all ages, especially for family or friends' movie nights.✔ Catchy soundtrack - The theme song sticks in your head and perfectly complements the film's vibe.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "FairuzN-0",
            "reviewer_url": "/user/ur199797766/?ref_=tturv_usr_19_t",
            "review_date": "Apr 12, 2025",
            "rating_value": "10",
            "full_review": "It's so rare for an animated film from Indonesia to be this good. The animation and storywriting are surprisingly well-crafted and heartwarming. I hope that more Indonesian filmmakers can follow in Jumbo's footsteps. This film shows that when local creators are given the right resources and creative freedom, they can produce work that is both commercially successful and emotionally meaningful. Jumbo has already made history as the highest-grossing Indonesian animated film to date, a feat that is both encouraging and inspiring for the industry.In addition to its technical and narrative strengths, Jumbo offers something even more valuable: representation. Indonesian children and families can see their own language, traditions, and everyday struggles reflected on screen in a way that feels authentic and respectful. That kind of cultural storytelling is powerful, and it's something the film industry in the region should continue to invest in.In conclusion, Jumbo is a heartwarming and beautifully made film that delivers on every level. It entertains, it moves, and it uplifts. It sets a new standard for what Indonesian animation can be and proves that local stories, when told with passion and skill, can resonate with audiences everywhere. Whether you're watching for the adorable characters, the emotional depth, or the cultural charm, Jumbo is a film you won't forget-and one that deserves all the praise it's getting.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "AdheliaP-7",
            "reviewer_url": "/user/ur199563378/?ref_=tturv_usr_22_t",
            "review_date": "Apr 8, 2025",
            "rating_value": "10",
            "full_review": "The story is good and relatable to life, the animation is funny, there are many moral messages that can be taken. The comedy is really good, the annoying characters are also good, it provokes the audience's emotions. This 25-year-old woman was made to cry by the story of Don and Atta.Also amazing, there are hundreds of animators involved in making this film. In terms of graphics, it's also good. Really like the voice actor, it suits the character. The point is everything is good, in my opinion there is nothing lacking here or there. Perfect.This should be 100000/10. Deserve to get an Oscar nomination.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "chandrakops",
            "reviewer_url": "/user/ur87042514/?ref_=tturv_usr_23_t",
            "review_date": "Apr 8, 2025",
            "rating_value": "10",
            "full_review": "Jumbo is a heartwarming film that beautifully captures the essence of Indonesian culture through its simple yet touching story. The movie radiates warmth with its portrayal of family values, local traditions, and the genuine kindness of its characters. Set against the backdrop of everyday Indonesian life, it delivers a nostalgic taste that feels both familiar and comforting. The cultural nuances, from language to setting, are presented with authenticity, making Jumbo not just a film, but an emotional journey that celebrates the richness of Indonesia's spiritand this is Indonesia's first animated film that truly stands side by side with Disney's masterpieces.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "IqbalD-5",
            "reviewer_url": "/user/ur199800186/?ref_=tturv_usr_24_t",
            "review_date": "Apr 12, 2025",
            "rating_value": "10",
            "full_review": "This movie is nothing less than a revolutionary masterpiece of animated cinema-a kaleidoscopic spectacle that proudly holds the title of the greatest of all time for Indonesian cinema. The first scene unfolding, the audience is swept away into a magical world of meticulous detail and color. The story is both textured and intellectual, blending old cultural storytelling traditions with new cinematic sensibilities with such mastery that they take the heart and mind captive. All of the plot twists and turns with measured pace, encouraging viewers to be fully enveloped and have a deep emotional investment in the journey of the characters.The animation itself is a visual treat, with each frame seemingly hand-painted with love and attention to detail. The color scheme and meticulous details bring the scenes alive, nicely transporting the viewer into a realm where dreams and reality merge harmoniously. This visual masterpiece is matched by an equally brilliant musical soundtrack. The music ideally complements each scene, heightening the story and deepening the emotional effect. The melodies not only harmonize with the visual narration, but also linger long after the credits, leaving an indelible mark on the viewer.In addition, the work of the voice-over talent is superb, giving each character a unique and authentic persona that really breathes life into them. The voices are performed with feeling and subtlety, adding depth and layers of meaning to the conversations. The expert blending of the voices of talented performers creates a clear and emotive delivery of the storytelling, making for an improved viewing experience.In conclusion, this animation is a milestone production that sets the bar higher for quality in storytelling, visual art, musical scoring, and vocal acting. It is a cultural treasure that not only amuses but also engages the mind and touches the heart. I unreservedly endorse it for anyone seeking an experience with cinema that will not soon be forgotten. I thank you for this masterpiece-a beaming exemplar of what happens when passion and skill are brought together.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "robsiregar",
            "reviewer_url": "/user/ur131756530/?ref_=tturv_usr_25_t",
            "review_date": "Apr 13, 2025",
            "rating_value": "9",
            "full_review": "One of the best animation movies I ever watched!The animation is pretty good, considering this come from underrated Indonesian movie industry. No cringe voice over and jokes, the transition is smooth, more than most audience expected.But when it comes to storytelling, this is where it hits. Every character has background stories, always two sides point of view. We can experience different emotional connections to each character, and feel related in some way to them, about the reason why they feel or they do something.You can watch this and put yourself into everyone shoes, as the parents, the children, the bully, the victim, the left out, the selfish, the care ones, literally everyone.No matter how old or cranky you are, just go, watch the movie. Worth your time.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ptihhkram",
            "reviewer_url": "/user/ur196828903/?ref_=tturv_usr_26_t",
            "review_date": "Apr 9, 2025",
            "rating_value": "9",
            "full_review": "I proud that Indonesia can make animation like this. The visual, cinematography, sound, plot, is perfect! The vfx like smoke, lightning, Meri's spirit aura, those are looks like western animation! The detail, the graphic, all of instrument is make this movie looks alive!I didn't realize this movie was showed plot twists too! I think the character named Atta will be antagonist kid until the end of the movie, cause he bullied Don. But when I know his backstory, I realize that I was wrong. Atta have a reason to bullied him. If you want to know the reason, just watch it!When Meri, the spirit of little girl, met Jumbo and friends, she called them by their name. I wonder as they wonder why she can know their friend. Meri acknowledges that she watched them as an invisible spirit for them for a long time. But the reason why Meri can know their names was not just only that! The other reason was unexpectedThere still one more plot twist I found, but I don't want to spill it. Just watch by yourself and find the reason of plot twist I tell and one more plot twist I didn't tellBut I won't rate it subjectively, but I will rate it objectively too. I still found little mistake in this movie that the production house to upgrade on the next movie. I know there's no perfect thing in this worldYou know, the graphic of the characters skin must be upgraded. The lighting makes the skin looks oily. But that doesn't matter! I still love this movie!!!By the way, I love Meri! She's pretty even she was a spirit😍😍😍 Her face, hand, voice, I love how Visinema design her. Respect for Visinema Pictures 👏👏👏👏",
            "data-review-id": ""
        },
        {
            "reviewer_name": "KennethW-91",
            "reviewer_url": "/user/ur201242103/?ref_=tturv_usr_27_t",
            "review_date": "May 11, 2025",
            "rating_value": "4",
            "full_review": "In my opinion the movie just go boom because of their dubber & ads onthe social media. Beside, for the storyline very predictable with minor plot twist. I think it is also a little bit heavy for the kids to comprehent the \"Ghost\" character and the \"Radio\" thing. There is plenty of room for them to do more and to explore all of the aspects.Conclusion, the movie was worth to watch, but lower the expectation. I put my expectation too high from the begining because of the hype. One thing to appreciate is the theme song. Every aproach in the movie was so indonesian, so me as indonesian can easily predict the movie.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "H5-5",
            "reviewer_url": "/user/ur200150229/?ref_=tturv_usr_28_t",
            "review_date": "Apr 18, 2025",
            "rating_value": "9",
            "full_review": "MUST WATCH IT. DO NOT MISS IT! Luv. However this movie never ever ever.Marking a historic milestone in Indonesian cinema, Jumbo bursts onto the screen as the nation's first-ever animated feature film-a dazzling testament to creativity, cultural pride, and the limitless potential of homegrown storytelling. With vibrant visuals, heartwarming characters, and a story that resonates across generations, this groundbreaking achievement not only paves the way for future animators but also proudly shouts to the world: Indonesian animation has arrived!---\nKey Elements Covered:\n1. Historic Significance - Highlights its \"first-ever\" status.2. Cultural Pride - Positions it as a national achievement.3. Artistic Appeal- Mentions visuals, characters, and storytelling.4. Future Impact- Emphasizes its role in inspiring the industry.5. Global Appeal - Positions it for international recognition.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "AlfianFilmscape",
            "reviewer_url": "/user/ur175200388/?ref_=tturv_usr_29_t",
            "review_date": "Apr 16, 2025",
            "rating_value": "10",
            "full_review": "Jumbo stands as a groundbreaking achievement in Indonesian animation, proudly crafted by Jagartha and Visinema. As an original animated film, it breaks new ground not only with its technical brilliance but also with its deeply emotional storytelling. That's why I confidently rate this film a 10 out of 10.Visually, Jumbo is stunning. The animation quality rivals international standards, showcasing fluid character movement, vibrant colors, and imaginative world-building. Each scene is thoughtfully designed to draw viewers into its universe, and every frame reflects the passion of the creators behind it. It's a cinematic experience that proves Indonesian animation can shine on the global stage.But the true heart of Jumbo lies in its story. The film beautifully conveys themes of family, friendship, bravery, and believing in oneself. These messages are delivered through compelling characters who are relatable, charming, and full of personality. The emotional depth of the narrative is genuine, managing to touch the audience without ever feeling forced.The soundtrack and musical score are also major highlights. The original songs are heartfelt and memorable, enhancing the storytelling and deepening the emotional moments. The music perfectly complements the film's tone - uplifting, touching, and inspiring all at once.While Jumbo is definitely appealing to children, it's also a meaningful and emotional journey for adult viewers. The pacing is well-crafted, the tone is warm and inviting, and the story leaves a lasting impression. It's a celebration of creativity, determination, and the power of dreams.In conclusion, Jumbo is not just a film - it's a milestone for Indonesian cinema. It sets a new benchmark for local animated films and offers a heartfelt story that resonates with audiences of all ages.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ibenimages",
            "reviewer_url": "/user/ur16051836/?ref_=tturv_usr_30_t",
            "review_date": "Apr 27, 2025",
            "rating_value": "8",
            "full_review": "\"Jumbo\", an animated film produced by Visinema, has made history by surpassing 7 million viewers. The big dream of the film's director, Ryan Adriandhy, who needed 5 years from the initial idea to its arrival on the big screen, has paid off.Yesterday, me and my son, who studied in Animation Studies, watched this latest phenomenon in Indonesian cinema. And we both agree that \"Jumbo\" is the best animation ever produced by Indonesia. Although it has some notes. Here is my brief review.Less \"Indonesian\" CharactersThe characters of Jumbo and his friends offer relatively smooth animation. Of course, this is not (yet) Pixar level. However, their movements and expressions are alive, although the character Don feels less \"Indonesian\" in terms of skin color and appearance. Maybe only Nurman feels very Indonesian in my opinion. Well, his name is \"Don\". The title of the film is also an adaptation of a foreign word. So maybe it was intentional.The environment in the film is also in the spotlight. Although it is decorated with typical Indonesian knick-knacks, the village or small town setting looks more like an old European city. This slightly reduces the local feel that I expected.Whimsical but MagicalLike many animated films, \"Jumbo\" is also made whimsically. Sometimes there are illogical scenes, and it combines the imaginary world and the real world. It's only natural, right? It's an animated film.The story itself starts simply, but is surprising with an exciting and unexpected plot twist at the end. Unfortunately, the pacing in the middle of the film feels slow. There were moments when I felt bored and sleepy, even though the film ended nicely.The peak of the film is the scene where Don and his friends perform an extraordinary stage. The eye-pleasing colors are combined with the OST song sung beautifully by the main cast. Plus, the remake of the song \"Kumpul Bocah\" by Malik & D'Essentials successfully evokes nostalgia. I almost shed tears, remembering my childhood when I heard Vina Panduwinata's version. This soundtrack is really fitting!Momentum for Indonesian Animated Films\"Jumbo\" was not only a commercial success, but also proved the potential of Indonesian animation. Hopefully this will be a momentum for producers to present more quality animated works. I personally really hope that this will also open up inspiration and opportunities for my son to work in this industry. Despite its shortcomings, \"Jumbo\" is a big step that deserves to be appreciated. Especially when the trend of Artificial Intelligence illustrations is touching the hearts of many artists today.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "rtnF-1",
            "reviewer_url": "/user/ur199468720/?ref_=tturv_usr_31_t",
            "review_date": "Apr 6, 2025",
            "rating_value": "8",
            "full_review": "Visuals: 93/100 (except for that banner design in the registration booth scene - it's so jarring and screams \"graphic design is my passion.\")Voice Acting: 96/100 (everything sounds very natural - the children's voice acting is especially superb.)Plot: 86/100Admittedly a bit biased here, since the plot heavily leans into supernatural elements, musicals, and performance art - not really my cup of tea. That said, the musical parts are actually well done.Nevertheless, I really liked the slice-of-life depiction of the village citizens; it reminds me a lot of Arawi's CITY, especially with the shady political subplot running in the background. Unfortunately, that only makes up about 20% of the total screen time.Overall : 87/100A solid start - I really hope the studio continues making more animated films in the future (and maybe inspires others to do the same).",
            "data-review-id": ""
        },
        {
            "reviewer_name": "kingofpeace19",
            "reviewer_url": "/user/ur45725163/?ref_=tturv_usr_32_t",
            "review_date": "Apr 26, 2025",
            "rating_value": "8",
            "full_review": "This is a massive step up in Indonesian animation industry. While the animation itself isn't perfect, there are a lot of positive sides in this movie. The animation quality is averagely excellent, but still vary. Some scenes are done impressively (i.e. The perfomance scene), while some other scenes miss out some details. The story idea is great, but I feel it's lack a strong point and the conflict's resolutions are sometimes too loose. Still, this storyline is a massive improvement in Indonesian children storyline.The soundtrack, voice casting and visual effects are near perfect for me. The product placement is nice and not annoying. Overall this is a must watch show for Indonesians and Southeast Asians.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "RyunjinY",
            "reviewer_url": "/user/ur200240633/?ref_=tturv_usr_33_t",
            "review_date": "Apr 20, 2025",
            "rating_value": "10",
            "full_review": "From the moment Jumbo takes its first breath on screen, you're swept away by animation so rich it feels like wandering through a living painting every color pops, every movement flows, and yet it's the characters' genuine struggles that really stick with you. I found myself laughing at their playful antics one minute and choking up the next as themes of self discovery, responsibility, and belonging landed with real emotional weight. The voice cast delivers performances brimming with warmth and nuance, while the soaring musical score elevates each scene without ever feeling overbearing. It's rare to see a family film balance dazzling visuals and heartfelt storytelling this well, and Jumbo proves that a movie aimed at kids can also offer surprising depth for viewers of all ages.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "tryandrian",
            "reviewer_url": "/user/ur102256943/?ref_=tturv_usr_34_t",
            "review_date": "May 13, 2025",
            "rating_value": "10",
            "full_review": "I will say that Jumbo is more than just an animated movie. It's an emotional journey that quietly sneaks up on you. I went in with no expectations, but ended up laughing, crying, and thinking about it long after the credits rolled. The story is touching and surprisingly deep, with lovable characters and a strong message about love, loss, and friendship. The animation is great, the humor is well-timed, and the soundtrack is beautiful and meaningful. I've watched it multiple times, and it still hits me every time. It's not just for kids but adults will feel it too. A true gem that deserves global recognition.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "hizkiahuwae",
            "reviewer_url": "/user/ur88311920/?ref_=tturv_usr_35_t",
            "review_date": "Apr 3, 2025",
            "rating_value": "8",
            "full_review": "\"Jumbo\" is a captivating Indonesian animated film that masterfully blends humor, heartfelt moments, and thrilling adventures. The story follows Don, a ten-year-old boy who embarks on a magical journey to prove himself, confronting themes of bullying, friendship, and self-discovery. The film's layered storytelling offers profound moral lessons about family and friendship, resonating deeply with audiences. The voice acting, featuring talents like Prince Poetiray and Bunga Citra Lestari, is exceptionally natural and engaging. Set in a nostalgic Indonesian backdrop, \"Jumbo\" authentically connects with children, especially those in Indonesia and perhaps other parts of the world. This film is highly recommended for its rich narrative and cultural relevance.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "fauzig-5",
            "reviewer_url": "/user/ur200021144/?ref_=tturv_usr_36_t",
            "review_date": "Apr 16, 2025",
            "rating_value": "10",
            "full_review": "This Animation Great Early for Indonesia Animation, Plot, Story And Animation Is Good.Certainly! Here's a positive review of the Indonesian animated film Jumbo (2025), directed by Ryan AdriandhyThanks for the clarification! Here's a positive and engaging English review for the Indonesian film Jumbo directed by Ryan Andriandi:\nJumbo, directed by Ryan Andriandi, is a heartfelt Indonesian family drama that delivers warmth, emotion, and an important message wrapped in a charming story. At its core, the film is about the beautiful bond between a lonely boy and an elephant, exploring themes of friendship, empathy, and personal growth.Ryan Andriandi presents the story with sincerity and a gentle pace, allowing the audience to truly connect with the characters. Bima Sena gives a touching performance as the young boy, capturing the innocence and emotional complexity of a child navigating loneliness and change. His relationship with Jumbo, the elephant, is portrayed with such tenderness that it becomes the emotional anchor of the film.The cinematography showcases the natural beauty of Indonesia, creating a visually rich backdrop that enhances the storytelling. Combined with a warm and subtle musical score, the atmosphere feels both intimate and cinematic.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "mademoisherl",
            "reviewer_url": "/user/ur67698132/?ref_=tturv_usr_37_t",
            "review_date": "May 17, 2025",
            "rating_value": "8",
            "full_review": "A wholesome, heartwarming, tear-jerking film that is very much needed as a breath of fresh air in the Indonesian cinema. The main theme song is beautiful, the animation is cute, and the characters have the right portions of the story for us to relate to. I especially appreciate that the reasoning behind the antagonists' actions are all very humane; we're not quite ourselves when we hurt. The comedy elements hit thanks to Ryan Adriandhy's comedic background, and the child actors did a tremendous job for their respective characters. I'm obsessed with the fact that Prince Poetiray looks pretty much like Don in real life.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "dimasfikrikamandanu",
            "reviewer_url": "/user/ur85155972/?ref_=tturv_usr_38_t",
            "review_date": "Apr 11, 2025",
            "rating_value": "10",
            "full_review": "Fun, colorful, cheerful, but also sad, heartful, and emotional. Value and messages are conveyed really well in the story, not just for kids, but for adults, and our inner child. The scoring is just right. Musical scene really breakdown your tears, especially for those who are missing their parents. Voice acting is phenomenal, particularly the children voice actors, great job kids. And last but not least, the smooth animation on par with pixar and dreamworks, created by 420 creators of Indonesia. Great job Jumbo and those behind the scenes, you just leveled up the standard of animation movies in your country!",
            "data-review-id": ""
        },
        {
            "reviewer_name": "wulangdanendra",
            "reviewer_url": "/user/ur60844061/?ref_=tturv_usr_40_t",
            "review_date": "May 2, 2025",
            "rating_value": "9",
            "full_review": "This animated movie carries a theme that goes beyond helping and helping but also the identity of a child. The conflicts may be heavy but with every plot and story that is presented, for me, it is perfect. Every magical element is beautifully reaped in each act that is full of emotional imagery.I really hope there will be a continuation of the story. The bad side that I found is that there are still some supporting characters that don't get enough attention, making some supporting characters seem less consistent in the animation round. We need the big animation production houses to start opening up the non-linear agenda to focus on simple concepts like Jumbo.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "jmediac",
            "reviewer_url": "/user/ur200628662/?ref_=tturv_usr_41_t",
            "review_date": "Apr 28, 2025",
            "rating_value": "10",
            "full_review": "The conflicts and the division of the story phases are very well done, making the structure clear and easy for children to understand. The story is also engaging for all ages, including evoking childhood nostalgia for the millennial generation.The film Jumbo is a proud production that embodies Indonesian local values. The conflicts and the world of Indonesian children in the 1990s are well portrayed.The Indonesian animation industry is expected to grow even stronger in the future. With over 5 million viewers in just 20 days, it proves that animation also has strong commercial value.Hopefully, Jumbo can become the film with the highest number of viewers in Indonesia.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "manaluclinton",
            "reviewer_url": "/user/ur153700304/?ref_=tturv_usr_42_t",
            "review_date": "Apr 22, 2025",
            "rating_value": "10",
            "full_review": "Jumbo is the first animated film that has an art design that is 11/12 equivalent to Disney Pixar animation along with a story that is quite touching. Although this film is locally made in Indonesia, but this animated film has been trusted in Southeast Asia, even to Europe. Some of the most popular Southeast Asian animations are Boboiboy, Ejen Ali, and Mechamato. The rest we are waiting for are Upin Ipin, Adit Sopo Jarwo, and so on. For those who want to watch an animated film with a touching story but the art style is equal to Disney Pixar, this film is the solution. Amazing!!Good news: If you watch it till the end, there are some scenes that are references from famous animated movies, just give it a try If there isn't any, maybe it's just from my mind :v.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "ML-226",
            "reviewer_url": "/user/ur199855481/?ref_=tturv_usr_43_t",
            "review_date": "Apr 13, 2025",
            "rating_value": "10",
            "full_review": "As a 32-year-old viewer, Jumbo transported me back to the wonder and innocence of childhood. This film is more than just an animated adventure. It's a poignant reminder of the dreams and imagination we often leave behind as we grow older.The story of Don, a 10-year-old boy who faces bullying due to his size, is both touching and inspiring. His journey to reclaim his cherished storybook and his encounter with the mysterious fairy, Meri, lead to an adventure that beautifully explores themes of friendship, courage, and self-discovery.The animation is visually stunning, capturing the essence of Indonesian culture with authenticity. From the vibrant Kampung Seruni to the intricate details of local life, every scene is crafted with care.The voice performances, especially by Prince Poetiray as Don, bring depth and emotion to the characters. The film's music and storytelling resonate deeply, making it a memorable experience for audiences of all ages.Whether you're young or simply young at heart, Jumbo is a cinematic gem that reminds us of the magic that lies within us all.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "AraryaP",
            "reviewer_url": "/user/ur200755960/?ref_=tturv_usr_44_t",
            "review_date": "May 1, 2025",
            "rating_value": "10",
            "full_review": "Honestly i never expected that this movie was THAT good, the visual effects was reallyy good and the story itself was interesting enough that i forgot to eat my popcorn, besides that it also had me on a roller coaster of emotions, the jokes were pure gold, and there were some twists that i never saw coming. The soundtrack itself was quite amazing, some of them made the movie way better, besides that the movie had alot of life lessons and showed me what real friends looked like. I've watched this movie 2 times and i still want to watch it again. Definitely a must watch. (This movie is so good that i hope there will be a sequel to it)",
            "data-review-id": ""
        },
        {
            "reviewer_name": "Crescent11",
            "reviewer_url": "/user/ur97923882/?ref_=tturv_usr_45_t",
            "review_date": "Apr 21, 2025",
            "rating_value": "10",
            "full_review": "This is a very good cartoon. Don is a very adorable character. It is actually very nice to have the main character to be not so perfect. He was a good person, but ge also has flaws. One moment you sympathise him for being left out of the other kids, the next moment you are disappointed by his selfishness. It actually a good thing to teach kids that they always have things to improve.Also, I like the part when antagoniistic characters also had a background story, a reason why they are so mean. It teaches kids that mean people are not born mean, but it is a result of circumstances, condition, and tragedy.It is worth a watch.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "alhasib",
            "reviewer_url": "/user/ur4957618/?ref_=tturv_usr_46_t",
            "review_date": "Apr 9, 2025",
            "rating_value": "9",
            "full_review": "After the director and writer visited my daughter's school, the film stuck with her-so much so that once it finally hit theaters, she begged us to go see it. I wasn't sure what to expect, but I'm really glad we went.The animation is way beyond what I anticipated, and the storytelling has a great mix of plot and heart. There's a perfect balance of humor and emotion that hits the right notes for both kids and adults.It's surprising that it didn't make a bigger splash right away. Maybe the title threw people off-Jumbo kind of suggests something totally different. But the story is fresh, imaginative, and definitely not what the name might lead you to think.Now that people are discovering it through word of mouth, I truly hope it gets a chance to shine on the international stage. This feels like the beginning of something big for Indonesian cinema, and I can't wait to see what comes next.",
            "data-review-id": ""
        }
    ]
}