{
    "ImdbId": "tt0335349",
    "total_reviews": 4,
    "reviews": [
        {
            "reviewer_name": "raditya-44466",
            "reviewer_url": "/user/ur105261516/?ref_=tturv_usr_1_t",
            "review_date": "Jul 8, 2019",
            "rating_value": "7",
            "full_review": "What is this movie genre ? Propaganda? Action? Histrorical? Thriller? Slash movie?\nYou got allI appreciate about the detail in scare of the victim shooting effect the property (yes) like the gun is real and military unifirm is real. Also i have read in some story that director also ask President Soeharto what medals and uniform he use and wear when he meet Sukarno, went to Lubang Buaya etc for the purpose of realism.The property acting etc is look like real but you know maybe the story not real.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "alessandronuel",
            "reviewer_url": "/user/ur74469710/?ref_=tturv_usr_2_t",
            "review_date": "May 18, 2019",
            "rating_value": "9",
            "full_review": "Immersed from the beginning to the middle, but attention was dropped reaching the end...There are closeups that were creepy and hilarious at the same time of the communist characters like DN Aidit... everything is building up and doesn't immediately jump towards violence...like the omen of the crows that turns to the right moment of massive nightmare for The Generals and the audience....The scars of the generals are spiteful...a great job from the makeup department...great casting, there are almost no difference between the actors and the real characters they are portraying specially with Soeharto and Nasution...Honorable production, if we ignore the historical content...",
            "data-review-id": ""
        },
        {
            "reviewer_name": "h-warnk",
            "reviewer_url": "/user/ur6667607/?ref_=tturv_usr_3_t",
            "review_date": "Apr 3, 2006",
            "rating_value": "1",
            "full_review": "This movie was shown each year on Indonesian TV to perform the national trauma of the incidents of 1965 in Java, Bali and elsewhere in Indonesia. It is a propaganda movie of the New Order of the Indonesian military dictator Soeharto whose rule was established in the aftermath of the mass killings. The movie is filled with lies ignoring historical facts. There was no conspiratorial meeting of the leaders of the Indonesian Communist Party (PKI) right before the kidnapping and killing of six high generals of the Indonesian army. When the dead bodies of the generals had been found a few days later, no signs of torture at all was reported by the doctors and experts involved in the case. This movie had only the intention to justify Soeharto's military regime whose violations of human rights are well-known. That Soeharto's most favorite military historian Nugroho Notosusanto was involved in writing the screenplay is hardly surprising, but to find such highly rated Indonesian intellectuals as Arifin C. Noer (screenplay, was leading in Indonesian theatre in the 1970s) or Umar Kayam (played Sukarno, well-known sociologist and novelist) gives one quite some thoughts on their other artistic and literary works.",
            "data-review-id": ""
        },
        {
            "reviewer_name": "phillipshilmardsson",
            "reviewer_url": "/user/ur83228988/?ref_=tturv_usr_4_t",
            "review_date": "Oct 1, 2021",
            "rating_value": "1",
            "full_review": "Not a historical movie, just a fiction movie. There are many facts and scenes that are still being debated in this movie, especially Umar Dhani's involvement in the rebellion..",
            "data-review-id": ""
        }
    ]
}